{"african sideneck turtle": {"page_url": "https://www.petguide.com/breeds/turtle/african-sideneck-turtle/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/09/african-sideneck-turtle.jpg", "name": "African Sideneck Turtle", "type": "turtle", "text": "The African Sideneck Turtle belongs to the family Pelomedusidae, which encompasses several different species. Also known as African Mud Turtles or African Helmeted Turtles, these turtles can’t completely hide their heads in their shells. Instead, this turtle is known for folding its head underneath the upper edge of his shell after his head has been drawn to the side. The African Sideneck Turtle’s face can be described as friendly and adorable in appearance. The African Sideneck Turtle is a part of a group of turtles. They are also sometimes called East African Serrated Mud Turtles. Fifteen species that are within the Pelusios genus live in Africa, Madagascar, and the Seychelles, and Pelomedusa subrufa is found in Madagascar and many parts of Africa. When they are found in the wild, these turtles are often seen in a range of natural habitats, such as shallow pools, large lakes, and rivers. These turtles vary from one individual to another in terms of their size. For example, a P. castaneus adult turtle could be up to a foot long, while the P. sinuatus will grow to 20” as an adult, and the Pelomedusa subrufa will only be around 6-8” long as an adult. When looking at the African Sideneck Turtle, you will notice two barbels that extend from the animal’s lower jaw. These are sensory organs that look a lot like a beard. These turtles also feature feet that are slightly webbed, and they will have sharp, long claws as well. Also, the face of this turtle breed can be described as friendly and adorable in appearance, thanks to its large, round eyes and the mouth that looks like it is smiling. The African Sideneck Turtle can vary in color from tan and dark brown, to gray and black. While some of these turtles can have lighter colored skin, they are generally darker, especially on the plastron, or underbelly area, which will also feature a poorly defined and wide yellow area. The head of the African Sideneck Turtle will be anywhere from olive to brown in color, and you will also note a black marking on the top of the head. African Sideneck Turtles are often seen in a range of natural habitats, such as shallow pools, large lakes, and rivers. You can keep your African Sideneck Turtle in a pretty basic enclosure. Unless you live in a climate that is warm all year round, these turtles should not be kept outdoors because they don’t hibernate. It is best to give your turtle a few inches of filtered water that is kept clean at all times, so filtration will be necessary. However, your turtle will enjoy basking as well, and will usually like swimming short distances before coming back to the surface. The amount of water in the tank will depend upon your turtle’s length. A good place to start is 6-10” deep. Provide your turtle with several different forms of enclosure décor, focusing on driftwood or piles of rocks that can be used for basking. There should be hiding places available, too, so focus on decorating your tank with plants and décor that can give your turtle a sense of security when he does not want to be out in the open. If you have a larger species, such as the P. gabonensis or the P. sinuatus, you will need a large 75-100 gallon aquarium, a larger tub, or a stock tank. On the other hand, if you have smaller species, such as the P. castanoides, Pelomedusa, or P. subniger, you can put turtles in a smaller 60-gallon tank, a stock tank, or a medium sized tub. Incandescent or fluorescent light bulbs can be using for lighting the tank, but using ultraviolet bulbs will also provide UVB rays that will promote vitamin D3 production. Also, a heater will keep the temperature between 70-75°F in the water and 95-100°F in the basking area. Monitor the temperature in the water and in the basking area with an accurate thermometer. The African Sideneck Turtle can vary in color from tan and dark brown, to gray and black. Variety is important in an African Sideneck Turtle’s diet. You can feed your pet a commercial aquatic turtle diet, but your turtle will also enjoy eating crickets, worms, crayfish, and fish. You can also provide aquatic plants for snacking on, and these turtles like munching on the leaves of water lettuce and water hyacinth. These turtles have become quite popular as pets, as they are hardy, curious, and active, but pet owners should be aware that these animals can sometimes be a little aggressive too. When you have a large enough enclosure, you can even house more than one of these turtles in the same space. Even though these turtles are shy at the beginning, once they get used to their environment and family, they will be inquisitive and more outgoing. However, like all other aquatic turtles, you should consider your African Sideneck Turtle a display pet that likely will not be easy to hold. Turtles that hatched in captivity will make the best pets and will be the most social.", "facts": " 7-12\" Semi-Aquatic Commercial turtle diet, freeze-dried and sun-dried turtle treats, dark leafy greens Moderate", "tags": "african aquatic sideneck turtle, african helmeted turtle, african mud turtle, african sideneck turtle, east african serrated mud turtle, Side-neck Turtle, sideneck turtle, "}, "alabama map turtle": {"page_url": "https://www.petguide.com/breeds/turtle/alabama-map-turtle/", "image_url": "https://www.petguide.com/wp-content/uploads/2017/12/alabama-map-turtle.jpg", "name": "Alabama Map Turtle", "type": "turtle", "text": "The Alabama Map Turtle is a beautiful breed that is protected in Alabama and rare in Georgia. This is a good breed to start with if you are a beginner turtle keeper. The Alabama Map Turtle is a beautiful breed that is protected in Alabama and rare in Georgia. Alabama Map Turtles could be found in several rivers and streams in Georgia and—you guessed it—Alabama. These rivers include the Tombigbee, the Tensaw, the Tallapoosa, the Black Warrior, the Alabama, and the Coosa rivers. They can also be found in Florida, Louisiana, and Mississippi. These turtles seem to prefer both rocky streams and large, muddy rivers. Males and juveniles will often be seen in shallower habitats, and they also like to bask on piles of brush or on fallen logs. Females, on the other hand, prefer to spend their time in deeper waters. The Alabama Map Turtle is an aquatic breed that could run from medium to large in size. The dorsal keel on the shell helps to easily recognize these turtles, at least while they are young, as the projections will typically wear down as the animal ages. An Alabama Map Turtle’s carapace could sometimes showcase a pattern of orange and yellow colors that could be described as net-like and fine. Also, the olive facial mask features three connected blotches, which is considered a unique feature behind and between the animal’s eyes. You will also notice that a light bar can be seen running from the turtle’s chin to its neck. Juvenile Alabama Map Turtles will feature a dark stripe that runs down their olive colored carapace, while the plastron will be a light yellow color that has darker coloration along the seams. Each marginal scute will feature yellow lines in a pattern, and the turtle’s interorbital blotch is described as single-pointed. Adult males, which are smaller than females, will continue to feature the majority of the pattern that is found on young turtles, while adult females will typically become more dull in color, with the potential to lose the majority of the markings that make the males and juveniles so attractive. As adults, these turtles will also feature a broad head, but females have a larger head that could be used to crush mollusks, while males and juveniles feature a strong jaw that is great for eating aquatic insects. The Alabama Map Turtle is an aquatic breed that could run from medium to large in size. Overall, the carapace of an Alabama Map Turtle will be brown, but it could feature some faint green, yellow, or orange markings as well. Juveniles will typically be more colorful, but their coloration will end up fading as they get older. The famous knobbed keel is black and also more pronounced while these turtles are young. Meanwhile, the plastron will be lightly colored and feature five lines that run horizontally so that they outline the turtle’s scutes. Also, the head will be lightly masked, while the legs and neck will be green and feature patterns made up of thin, yellow lines. In the wild, Alabama Map Turtles like to spend their time in streams and rivers that feature muddy or sandy bottoms, even though they could also be seen spending time in fast moving creeks that have rocky bottoms. Mimicking this natural habitat in your enclosure will help your pet turtle feel right at home. It is important to note that a basking site will be necessary for your Alabama Map Turtle. Provide UVB lighting and a heat lamp over your turtle’s basking area and ensure the temperature is set anywhere from the high 80s to low 90s Fahrenheit. Also, use a submersible heater to keep the water temperature anywhere from the low to mid 70s Fahrenheit. Finally, the air temperature could range from the low to mid 80s Fahrenheit. In terms of water level, the depth should be as deep as possible for your turtle to comfortably swim around. The substrate could be fine to large sized gravel or sand. You could also provide plenty of vegetation. One adult male Alabama Map Turtle should have an enclosure that is at least 40 gallons or larger, while a single female should have an enclosure that is at least 90 gallons or larger. If you plan on housing more than one turtle in the same enclosure, add 20 gallons of tank space for each male or 50 gallons per female. These turtles seem to prefer both rocky streams and large, muddy rivers. Even though juvenile Alabama Map Turtles will feast on some plants, such as duckweed and other nutritious aquatic plants, this breed is mainly carnivorous. Females prefer meals like mollusks and freshwater aquatic snails. Juveniles and males will enjoy eating mollusks and aquatic snails as well, but because they have smaller and less powerful jaws and heads than their adult female counterparts, they also need access to foods like small fish, worms, tadpoles, aquatic insects, and crawfish. Alabama Map Turtles could be described as shy, and they will often slip into the water as soon as they think there is even just a hint of potential danger. In terms of living with other turtles, you could create a community habitat that consists of other Map Turtles, Cooters, Painted Turtles, and Sliders.", "facts": " 3.5-11.5\" Aquatic Aquatic snails, mollusks, small fish, worms, tadpoles, aquatic insects, and crawfish Low maintenance", "tags": "Alabama Map Turtle, aquatic turtle, common map turtle, map turtle, turtle breed, turtle care, "}, "alabama red-bellied turtle": {"page_url": "https://www.petguide.com/breeds/turtle/alabama-red-bellied-turtle/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/11/alabama-red-bellied-turtle.jpg", "name": "Alabama Red-Bellied Turtle", "type": "turtle", "text": "Also known as the Alabama Red-Bellied Cooter, the Alabama Red-Bellied Turtle is popular in the pet trade, and it is also Alabama’s official state reptile. However, because this species is endangered in its natural habitat, it is important to be absolutely sure you are purchasing your pet from a reputable breeder who can guarantee that the animal was born and raised in captivity rather than taken from the wild. Also known as the Alabama Red-Bellied Cooter, the Alabama Red-Bellied Turtle is popular in the pet trade. The Alabama Red-Bellied Turtle is one of three species of red-bellied turtles. Each of these three species are isolated from one another geographically. The natural range for the Alabama Red-Bellied Turtle is limited to the Mobile-Tensaw River Delta, which is found in Baldwin and Mobile counties in the state of Alabama. These turtles prefer the shallow backwaters of bays, bayous, rivers, and streams that contain freshwater and plenty of vegetation. They also like bodies of water that have soft bottoms. The Alabama Red-Bellied Turtle is one of three species of red-bellied turtles. One of most unique characteristics of the Alabama Red-Bellied Turtle is the obvious notch found at the tip of the animal’s upper jaw, with a tooth-like cusp on either side as well. Male and female Alabama Red-Bellied Turtles can be distinguished from one another quite easily because the females will be a bit bigger. Also, the males will feature foreclaws that are elongated. The Alabama Red-Bellied Turtle features a carapace that could be anywhere from black or dark brown to greenish in color. There will also be red, orange, or yellow markings that run vertically along the sides of the turtle’s body. The plastron, on the other hand, may or may not feature dark markings, and it will be anywhere from red to pale yellow in color. Also, this turtle’s legs, neck, and head will have yellow colored stripes as well. Young Alabama Red-Bellied Turtles will usually feature colors and markings that are more intense in appearance. Like other cooters, the Alabama Red-Bellied Turtle will benefit from being housed in a backyard pond or an aquarium in which the water will be clean at all times with the help of a high quality filtration system. Because these turtles can grow to be quite large, you will need a big enclosure. The depth of the water should be anywhere from 1-2 feet or more. These turtles like to bask, so you will need to have a large platform with UV lighting and a heat lamp that will get the basking area up to around 85°F. The water temperature should be around 75°F, so use a water heater if necessary. For substrate, you can use gravel to create a thin layer at the bottom of your pet’s tank. You can add extra gravel in one corner and then place the basking site above the gravel mound you created. If you are planning on housing your Alabama Red-Bellied Turtle in an outdoor pond, make sure the water temperature does not go up too high in the summer by placing it in an area that will be partially shaded. You will not need to provide a UV light, as your pet will receive the rays from the sun. A fenced plastic-lined pond will ensure predators are kept out and your turtle will not be able to escape, and a good size for an in-ground pond would be around 5’x5’ or more if you are housing a pair of these turtles. You can line the edges of the pond with smooth rocks that can be used for basking. You can also include non-toxic aquatic plants like water lilies that your turtle can eat. You can house your Alabama Red-Bellied Turtle with similar species. In the wild, the Alabama Red-Bellied Turtle is herbivorous, so these animals feed on various aquatic plants. You can provide a commercial pelleted diet for turtles as a base for good nutrition, but also provide your pet with non-toxic aquatic plants, such as hydrilla, elodea, pickerelweed, lilies, arrowhead, mud plantain, and eelgrass. You can also give your pet leafy greens like romaine. If you wish to set up a community tank with several turtles in one enclosure, you can house your Alabama Red-Bellied Turtle with similar species, such as Red-Eared Sliders, other Red-Bellied Turtles, Yellow-Bellied Sliders, and Rio Grande Cooters. However, when a male and female are housed together, just be sure to watch for any signs that the male is harassing the female too much. Like other aquatic turtles, you should not expect to handle your Alabama Red-Bellied Turtle unless it is necessary to do so. Instead, you should expect that these animals are more for observing rather than holding.", "facts": " 12-15” Aquatic Commercial pelleted diet for turtles, leafy greens, non-toxic aquatic plants Moderate Maintenance", "tags": "Alabama Red-Bellied Cooter, Alabama Red-Bellied Turtle, Florida Red-Bellied Cooter, Florida Red-Bellied Turtle, Northern Red-Bellied Cooter, Northern Red-Bellied Turtle, Red-Bellied Cooter, Red-Bellied Turtle, turtle, turtle breed, "}, "argentine snake-necked turtle": {"page_url": "https://www.petguide.com/breeds/turtle/argentine-snake-necked-turtle/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/11/argentine-snake-necked-turtle.jpg", "name": "Argentine Snake-Necked Turtle", "type": "turtle", "text": "The Argentine Snake-Necked Turtle, which is one of the two South American Snake-Necked Turtle breeds, is a unique breed of aquatic turtle that is named for its long neck. Unlike so many other turtles that are kept as pets, this turtle does not bask regularly. Instead, these turtles only go on land to dry off a bit, to explore, to escape a bully, or to deal with a shell issue. Provided that you can give this shy turtle everything that it needs to thrive in captivity, including a proper enclosure and diet, you can enjoy watching your pet become a part of your family. These animals do require an advanced level of care because they are finicky eaters and they have higher water quality requirements, so they are not an ideal choice for beginner turtle keepers. The Argentine Snake-Necked Turtle is a unique breed of aquatic turtle that is named for its long neck. Argentine Snake-Necked Turtles are found in the wild in Uruguay, southern Brazil, Paraguay, and northern Argentina. They prefer rivers, marshes, streams, and ponds that have aquatic vegetation. When found in coastal areas, these turtles will even be found in brackish water. They will also hibernate in cooler areas within their range. The carapace of the Argentine Snake-Necked Turtle will be oval and flattened. The surface could either be smooth, covered with peaks and grooves, or have cone-like or thorn-like knobs on the scutes down the center, thereby forming a ridge that runs down the middle of the carapace. The knobs can also be seen on scutes on either side of the center ridge. As the turtle matures, the carapace can become smooth, though the knobs can sometimes be maintained in older adults. The head will be of a moderate size and feature a slightly protruding, short snout. The upper jaw will not feature a notch, nor will it be hooked. There will also be many scales on the top of the head that will be irregularly shaped. The fronts of the front limbs, as well as the backs of the hind legs, will feature transverse scales that are large, and there will be four claws on each foot. Females will grow larger than males. Both genders will have twisting, long necks that allow them to capture fish, insects, and worms with ease. Argentine Snake-Necked Turtles are found in the wild in Uruguay, southern Brazil, Paraguay, and northern Argentina. The Argentine Snake-Necked Turtle’s carapace will be a dark brown color, and it can sometimes be speckled. The narrow bridge on the carapace could be anywhere from brown to yellow with large blotches that are brown. The plastron pattern and color will vary. It could be totally yellow, or it could be yellow along with brown blotches. Some turtles will even showcase a black pattern. This turtle’s head will be gray to olive in color. It will feature a cream or white stripe that is bordered with gray or black and extends from the upper jaw along the neck. The jaws could be tan or yellow, and the underside of the animal’s chin and head will be yellow with dark lines or spots. The tail will be olive gray. To keep your Argentine Snake-Necked Turtle happy and healthy, you will need to set up a large enclosure. A single male should be kept in a 90-gallon tank as the minimum, while females will need at least a 125-gallon tank. More space will be necessary if you are planning on housing more than one turtle in the same tank. These turtles are fairly active and they are strong swimmers, so deep water is necessary. Even though they do not bask frequently, they will need a basking area that is easy to access, and you also need to set up a UVB light and a heat lamp over the basking area. The tank should provide this shy pet with hiding places in the form of aquatic vegetation and safe underwater hiding areas. For the substrate, stick with something that’s soft and will not cause injuries to your turtle’s shell. Because the Argentine Snake-Necked Turtle is vulnerable to fungal outbreaks, you need to provide your pet with pure, filtered water that has a low pH between 5.0-5.8. The air temperature in your turtle’s enclosure should be anywhere from the low to mid 80s Fahrenheit, while the basking area should be in the mid 80s Fahrenheit. The water temperature can be maintained anywhere from the low to mid 70s Fahrenheit with the help of a high quality water heater. To keep your Argentine Snake-Necked Turtle happy and healthy, you will need to set up a large enclosure. The Argentine Snake-Necked Turtle is a strict carnivore, so you can feed your pet a range of live foods, such as crickets, snails, worms, and fish. You can also give your pet a commercial pelleted diet designed for turtles, and you can even add feeder fish in your turtle’s enclosure so he can hunt whenever he wants. You can house your Argentine Snake-Necked Turtle in a community tank, but you will only be able to house several of the same species in the same enclosure because these turtles prefer water that has a low pH. Only handle these turtles when it is absolutely necessary to do so. And make sure that you purchase a turtle that was born in captivity rather than taken from the wild.", "facts": " 7-12” Aquatic Commercial pelleted turtle diet, worms, fish, crickets, snails High Maintenance", "tags": "Argentine Snake-Necked Turtle, Brazilian Snake-Necked Turtle, Snake-Necked Turtle, turtle, turtle breed, "}, "black wood turtle": {"page_url": "https://www.petguide.com/breeds/turtle/black-wood-turtle/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/11/black-wood-turtle.jpg", "name": "Black Wood Turtle", "type": "turtle", "text": "The Black Wood Turtle is one of many species of Wood Turtle, but it is the biggest of all of the Wood Turtle breeds. These active and personable animals are also extremely popular within the pet trade in the United States because their size is manageable, they are hardy, and they can form a strong bond with their human family. The Black Wood Turtle is one of many species of Wood Turtle, but it is the biggest of all of the Wood Turtle breeds. Black Wood Turtles are naturally found throughout Central America. They make their home in Panama, Costa Rica, Honduras, and Nicaragua, as well as the Coco River. These turtles prefer slow moving but deep bodies of freshwater, including rivers, streams, swamps, marshes, ponds, and lakes, and they also like a forested habitat. They are found in environments that provide them with a lot of vegetation both in the water and on land. The Black Wood Turtle features a carapace that is domed. The plastron will be concave and curved, but juveniles and females will feature a flat plastron. Also, the plastron will totally cover the underside of this turtle’s body. As its name suggests, the Black Wood Turtle will have a shell that is typically black in color, although some animals might show brown hues within the shell as well. Also, the turtle’s limbs will feature lighter spots, and both sides of the jaw will also have yellow spots. The plastron of a female or juvenile, in particular, will be brown or dull gray. Black Wood Turtles are popular pets because they have an outgoing personality. The enclosure for your Black Wood Turtle should be large enough to accommodate this pet’s size. There should be plenty of room for your turtle to move about freely. So, as an example, a 100-gallon tank should have 60 gallons of water space and 40 gallons of land space. The water in your turtle’s enclosure should be deep enough that he can totally submerge himself and swim around with ease. At the bottom of the tank, there should also be a thick and soft substrate that will be safe for your turtle. Because these turtles enjoy swimming so much, you can provide some underwater tank décor, including non-toxic natural plants that can be consumed, as well as artificial plants, in order to create a natural looking environment. You can even give your turtle a combination of submerged and floating plants in his water. There should be a UVB light above your turtle’s enclosure, and it should remain on for about 12-14 hours each day. The enclosure should also include a heat lamp that will create a basking area for your pet to use. Misting the enclosure regularly will ensure that it is kept humid and tropical. Humidity should be maintained at around 60-80%. If you are going to house your Black Wood Turtle outdoors, you will not need to provide a UVB light if there is adequate exposure to sunlight. However, you will have to make sure the enclosure is totally secure so that your turtle will not be able to dig his way out. You will also need to bring your turtle indoors when the temperature drops to below 50°F at night. In terms of temperature, you should aim to keep your turtle’s enclosure heated to 85-90°F by day, and then the temperature could drop to around 70°F by night. Because the Black Wood Turtle is an omnivorous breed, you can feed your pet a variety of foods. Because the Black Wood Turtle is an omnivorous breed, you can feed your pet a variety of foods. These include live meals consisting of bloodworms, earthworms, snails, waxworms, tadpoles, small fish, and crayfish. You should also provide your turtle with various fruits and vegetables. For example, you can give him foods that include romaine lettuce, cabbage, hyacinth, leafy greens like spinach, apples, and bananas. The combination of meat and plants in your pet’s diet will help keep your turtle happy and healthy, but you can also provide him with a weekly dose of vitamins and calcium, as these are highly recommended. On top of that, you can feed your pet a commercial pelleted diet for turtles to ensure all of his nutritional needs are met. Black Wood Turtles are popular pets because they have an outgoing personality. It is always best, however, to ensure that you are purchasing a turtle that was born in captivity. Not only will these turtles be even more tame, healthy, and easy to handle, but you will also be doing your part in ensuring that wild turtles stay in their native habitats where they belong.", "facts": " Up to 14” Semi-aquatic Commercial pelleted turtle diet, worms, snails, fish, fruits, vegetables, non-toxic aquatic plants, leafy greens Low Maintenance", "tags": "Black Wood Turtle, Central American Wood Turtle, north american wood turtle, turtle, turtle breed, wood turtle, "}, "bog turtle": {"page_url": "https://www.petguide.com/breeds/turtle/bog-turtle/", "image_url": "https://www.petguide.com/wp-content/uploads/2017/12/bog-turtle.jpg", "name": "Bog Turtle", "type": "turtle", "text": "The adorable little Bog Turtle is actually one of the smallest of all the turtle breeds on the planet. Also known as the Muhlenberg’s Turtle, this breed is rare and endangered. For these reasons, it is best to ensure that you get your Bog Turtle from a reputable breeder or from an adoption center. The adorable little Bog Turtle is actually one of the smallest of all the turtle breeds on the planet. In terms of its natural wild habitat, you will only be able to find the Bog Turtle living in the United States. It is found in several states on the eastern part of the country. These include Connecticut, Massachusetts, New York, New Jersey, Pennsylvania, Maryland, and Delaware. Plus, they could also be found in Virginia, Tennessee, North Carolina, South Carolina, and Georgia. Generally, these turtles prefer to spend their time in marshy areas, swamps, and bogs, as well as slow-moving streams. They also like to live in habitats that have a soft substrate and low-growth vegetation. Little Bog Turtles are super cute because they are so small. They also have a shell that is slightly elongated. Juveniles will have a shell that is rough in terms of its texture. However, that roughness will become smoother as the turtle gets older, especially because these animals like to burrow a lot. You could differentiate a male Bog Turtle from a female by their tails and plastrons. A male will feature a thicker and longer tail, as well as a moderately concave plastron. A female will have a flat plastron and a shell that is wider and more domed in appearance. Also known as the Muhlenberg’s Turtle, this breed is rare and endangered. It could be easy to spot a Bog Turtle, thanks to the bright red, yellow, or orange blotch that is found on each side of the animal’s head. The shell could be anywhere from a brown color to black, and every bony plate on the shell typically will feature a light colored center as well. The plastron will also be either brown or black, and it will feature some light markings in an irregular pattern too. Finally, the skin of the Bog Turtle will be brown or black, and it might also be speckled or streaked with orange or red markings, particularly on the edges of the scales on the legs. In terms of housing, the Bog Turtle could do well in a fairly simple enclosure. The key is to provide your pet with equal areas of shallow water and land so that you could mimic this breed’s natural habitat. A single Bog Turtle could do well in a 3’ x 2’ tank, at a minimum, while two turtles would require double this amount of space. Also make it a point to set up various hiding spots and sightline breaks throughout the enclosure as well, especially if you have more than one turtle. Choose a soft substrate, such as fine mulch or leaf litter, to cover the dry area of the enclosure. Shelters in the form of hollow logs, as an example, are also necessary, and they should be big enough that your pet could easily turn around inside comfortably. And you could also add some plants in the dry area, as these could provide more hiding places for your pet. For the aquatic area of your enclosure, you may not need any substrate. However, you should be able to give your turtle access to water that varies in depth. Just don’t make the water any deeper than the length of your pet’s shell. Proper filtration, and a system that allows you to totally change the water regularly, will also be necessary to keep the water clean. A basking area should have a UVB light above it, and a heater should ensure the temperature ranges from 85-90°F. Air temperatures could be maintained anywhere from 75-85°F, and water temperatures could be maintained at 65-75°F. Using heaters and electrical timers, you could adjust the amount of light that your turtle is exposed to throughout the year so that you could mimic the seasons that the animal would be exposed to in the wild. During the summer, provide 16 hours of daylight, and then limit that to 10 hours of light during the winter. Bog Turtles can be a lot of fun to keep as pets. The Bog Turtle is an omnivore that enjoys feasting upon a variety of foods. These include dragonflies, ants, millipedes, and beetles, as well as slugs, spiders, earthworms, and snails. These turtles could even eat mice, voles, nestling birds, and frogs. And they won’t mind munching on plants either, such as seeds and berries. To mimic its wild diet, you could provide your Bog Turtle with commercial pellets for turtles, as well as insects like roaches and crickets. On top of that, you could give your pet some cut fish, aquatic plants, earthworms, green leafy veggies like romaine lettuce, grapes, melons, and strawberries. Bog Turtles can be a lot of fun to keep as pets, and they are smart animals that will learn to recognize their owners and come out to ask for food. If you are planning on keeping more than one of these turtles, though, it is best to house the males separately because they could end up fighting over territory.", "facts": " 4” Semi-aquatic turtles Pelleted commercial diet, vegetables, aquatic plants, insects, worms, fish Medium maintenance", "tags": "Bog Turtle, small turtle, turtle breed, wood turtle, "}, "cagle’s map turtle": {"page_url": "https://www.petguide.com/breeds/turtle/cagles-map-turtle/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/10/cagles-map-turtle.jpg", "name": "Cagle’s Map Turtle", "type": "turtle", "text": "There are several different types of Map Turtles, but they all feature the unique lines that cover the carapace and skin in a pattern that looks like a contour map or a road map. The Cagle’s Map Turtle, which is only found in Texas and is the only Map Turtle that’s mostly green in color, is endangered and rare. In Texas, these turtles can’t be taken from the wild, possessed, transported, or put up for sale. There are a few private breeders who are located outside of the state who are able to work with the Cagle’s Map Turtle, but this breed is not readily available throughout the United States pet trade. Therefore, it is difficult to obtain one as a pet, and you need to be absolutely certain that you are getting a turtle that has been bred in captivity and has not been removed from its natural habitat. The Cagle’s Map Turtle, which is only found in Texas and is the only Map Turtle that’s mostly green in color, is endangered and rare. Cagle’s Map Turtles have been seen in the Guadalupe River, as well as its tributaries. This breed has also been seen in the Blanco River and the San Marcos River. All of these bodies of water are found in southeastern Texas. The range for this turtle, however, has diminished, and it now appears that you can only find these animals on a stretch of roughly 75 miles along the Guadalupe River. These turtles are typically found in limestone streams and mud-bottomed streams that are shallow and have moderate currents. They can also be found in pools that are up to 10 feet deep. The upper shell of the Cagle’s Map Turtle is serrated only on the back. There are also spine-like, sharp projections that run down the center of the shell. Females will be larger, and will also feature a broader head, than males. Cagle’s Map Turtles have been seen in the Guadalupe River, as well as its tributaries. The Cagle’s Map Turtle features a greenish color overall, but the limbs, tail, and head are black and have several yellow to cream colored lines. There is also a cream colored bar found on the chin, and there is a yellow mark in the shape of a V on the top of the turtle’s head. The upper shell features a bright pattern of yellow-green and black circles and lines. It is recommended that you have a minimum of a 30-gallon tank for one adult male Cagle’s Map Turtle, although 40+ gallons is preferred. The minimum size for a female would be a 40-gallon tank, though 55+ is preferred. You want the tank to be large enough to provide these turtles with plenty of space for swimming. If you are going to have more than one turtle in the same enclosure, you should add at least 20 gallons of space for each turtle. A high quality filtration system is a must in your turtle’s enclosure. The depth of the water for this breed should at least 6-12”, as these turtles are strong swimmers. Maintaining pure water in the enclosure will help keep your turtle healthy and happy. Also add a water heater to the enclosure to keep the temperature around 74-84°F. Because this is a breed that loves to bask, you will need to provide your turtle with a UVB light and a heat lamp over a basking area so that it reaches 88-100°F. The rest of the air temperature can be anywhere from the low to mid 80s Fahrenheit. For substrate, you can use anything from a fine gravel to a large size gravel, or you can use sand. You should also provide plenty of real or artificial vegetation throughout the tank. If you are planning on housing your Cagle’s Map Turtle outside, you can provide him with an outdoor pond. Just make sure that, because your turtle is an avid basker, he will have a large basking area. You can provide additional basking areas as well. Make sure that the enclosure is large enough to prevent overcrowding if you have more than one turtle. There should be plenty of aquatic plants, including floating plants like water hyacinth, duckweed, and water lettuce. Just remember to bring the turtle inside when temperatures drop to 45-50°F as winter approaches. If you wish to establish a community tank, Cagle’s Map Turtles will get along well with Cooters, Sliders, Painted Turtles, and other Map Turtles. Cagle’s Map Turtles will thrive on a commercial turtle diet, as well as crickets, various insects and worms, snails, aquatic plants, minnows, tadpoles, and leafy green vegetables. If you wish to establish a community tank, the Cagle’s Map Turtle will get along well with Cooters, Sliders, Painted Turtles, and other Map Turtles. Turtles that have been bred in captivity will be more docile, and you may even be able to feed them by hand. However, like other aquatic turtles, you should only handle your Cagle’s Map Turtle when it’s necessary to do so.", "facts": " 2.5-6.5” Aquatic Commercial pelleted turtle diet, fish, insects, worms, leafy green vegetables, non-toxic aquatic plants, snails Low Maintenance", "tags": "Alabama Map Turtle, Cagle's Map Turtle, cooter, False Map Turtle, map turtle, painted turtle, Slider Turtle, Texas Map Turtle, turtle breed, "}, "caspian pond turtle": {"page_url": "https://www.petguide.com/breeds/turtle/caspian-pond-turtle/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/09/caspian-pond-turtle.jpg", "name": "Caspian Pond Turtle", "type": "turtle", "text": "Also known as the Caspian Turtle, the wild population of Caspian Pond Turtle has, unfortunately, been declining as a result of interactions with humans, storks, and vultures. These active and versatile turtles are available in limited numbers, thanks to a few breeders in the United States. These pets are also fast-growing, and they do need a lot of space, so if you do not have a lot of room to give them or you are too busy, they are not the right breed for you. The Caspian Pond Turtle is active and versatile, and is available in limited numbers. The Caspian Pond Turtle is found in many different countries. For example, these animals have habitat throughout Saudi Arabia, Israel, Iran, Eastern Europe, Turkey, Crete, Cypress, Yugoslavia, and Bulgaria, as a few examples. These turtles are highly adaptable and make their home in the many brackish and freshwater bodies of water throughout their wild range. There can be many of them living in permanent bodies of water, but in areas where the water is temporary, they are forced to become dormant in mud during the summer. Turtles living in northern areas will hibernate during the winter. Caspian Pond Turtles feature an oval and smooth carapace that can be black, tan, or olive. The body is also marked with cream or yellow colored lines. These turtles will usually breed in the early part of the spring season, but they might also breed in the autumn as well. Nesting will typically happen in June and July. Four to six eggs, on average, will be in each clutch, and the eggs will be brittle-shelled, elongated, and white. Hatchlings will feature carapaces that are round and roughly 33 mm long. They will also be brighter in color compared to adult Caspian Pond Turtles. When they are juveniles, these turtles will be carnivorous. As they become adults, they will shift to being omnivorous instead. Larger turtles have even been observed following a more herbivorous diet. Caspian Pond Turtles are highly adaptable and make their home in brackish and freshwater bodies of water. The Caspian Pond Turtle will feature an oval and smooth carapace that can be tan, black, or olive in color, along with yellow or cream colored patterns on the shell, head, and arms. To house a Caspian Pond Turtle, you will need a 75-gallon tank, as a minimum, for an adult. A koi pond or a commercial turtle tub would be even better. If you are planning on housing more than one Caspian Pond Turtle in a single tank, however, it should be a 90-gallon aquarium for a pair of turtles. For each additional turtle, you need to have an extra 40 gallons available in the tank. It is fine to keep these turtles in an aquarium without anything on the bottom because the gravel will only end up trapping too much waste and food (plus, the gravel may end being swallowed by the turtle). Your Caspian Pond Turtle will also require a dry surface that is designed for basking and resting, such as a commercial turtle dock. A powerful filter will be required to keep the turtle’s water as clean as possible in between manual water cleanings, and you should provide UVB lighting to keep your pet healthy. Also, the water temperature should be between 60°F and 82°F, and the basking area should be 90-100°F, so you will need a heater and a thermometer to monitor these temperatures. In terms of diet, a variety of different foods will keep your turtle happy and healthy. These turtles typically feed on aquatic insects, carrion, amphibians, small invertebrates, and various terrestrial and aquatic plants in the wild. Caspian Pond Turtles that are kept as pets enjoy eating commercial turtle pellets, as well as fish, meat, earthworms, insects, minnows, roaches, crickets, prawn, crayfish, greens, and shrimp. A cuttlebone can also be provided as an additional calcium supplement. Caspian Pond Turtles enjoy basking, but they will quickly dive into the water if they are frightened. These turtles enjoy basking, but they will quickly dive into the water if they are frightened. They are personable, and they will eventually recognize you as their caretaker. You will notice that your turtle is quite active, as well as always hungry and alert. You may even find your turtle begging you for a snack as soon as he sees you. Like other turtles, the Caspian Pond Turtle will not enjoy being handled or held. These turtles can also bite you if they are frightened. They can be housed alone or with other turtles in the same tank.", "facts": " 7-10\" Semi-aquatic turtles Pelleted commercial diet, greens, insects, fish, worms Low", "tags": "caspian pond turtle, caspian turtle, european pond turtle, pond turtle, "}, "central american wood turtle": {"page_url": "https://www.petguide.com/breeds/turtle/central-american-wood-turtle/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/09/central-american-wood-turtle.jpg", "name": "Central American Wood Turtle", "type": "turtle", "text": "The Central American Wood Turtle, also known as the Ornate Wood Turtle, is a popular and common wood turtle within the pet trade. Those imported from the northern part of Costa Rica, in particular, are brightly colored, and they feature black eyespots along with lovely swirls of yellow and orange. These turtles make wonderful pets because they become tame rather quickly, and they are intelligent and personable. They also remain at a size that is manageable, and they are hardy once they are established in the right enclosure. The Central American Wood Turtle (also known as the Ornate Wood Turtle) is a popular pet. Central American Wood Turtles are found in wild habitats from northern Costa Rica to southern Nicaragua. It is actually one of four subspecies of the Painted Wood Turtle, and there are a total of eight Wood Turtle species within the Rhinoclemmys genus that make their home in Mexico and Central America. Adult Central American Wood Turtles will be about 8” long. Males will have longer tails and will also be smaller than females. Individual turtles will vary in terms of the patterns on their shells, with the Nicaragua turtles being less showy than their Costa Rican counterparts. Overall, these turtles are sociable and well-tempered, as well as smart. They can even be fed by hand. The Central American Wood Turtle is known for coming in a variety of colors. Individuals that are from Costa Rica will showcase bright colors, while Ornate Wood Turtles from Nicaragua will be more subdued. Some of these turtles will really stand out with yellow and orange swirls and different degrees of black eyespots on their carapace. They could also have a bit of red or pink on their plastron. Central American Wood Turtles make  wonderful pets because they become tame rather quickly, and they are intelligent and personable. This is a semi-terrestrial turtle breed, so you will need to have an enclosure that will mimic the environment of a marshy pond turtle, but it will need to bit a bit drier. You can keep your Central American Wood Turtle in an area that is outside, as long as it is 8’ by 8’. You can also keep your turtle in a large tub, a medium tub, or a stock tank if your pet will be indoors. A long and wide pen that is covered with a screen top is preferred over an aquarium tank, but if you are going to keep your turtle in a tank, it should be at least 75 gallons, with 50 gallons added for each additional turtle. An indoor enclosure should have a substrate that consists of three layers. There should be a layer made up of pea gravel, then you should have a layer that is 10-12” deep and is made up of ½ peat moss and ½ dampened sand. Finally, you should have a thin layer made up of cypress mulch. Give your turtle something like a paint tray or a cat litter pan filled with fresh, clean, filtered water. The water should be changed regularly to ensure its cleanliness. There should also be piles of hay, piles of leaves, and sheets of bark to provide your turtle with hiding spaces that are safe and secure while he is on land. A UVB light bulb should be positioned overhead, along with a 100-watt light bulb over the basking area. A comfortable temperature for your turtle will be anywhere from 76-86°F. While slight fluctuations will typically be tolerated during the night, the temperature should be kept above 60°F. Basking temperature should be in the high 80s to low 90s Fahrenheit, and the water temperature should be around 75°F. You should also set the humidity to around 60%. Ornate Wood Turtles are omnivorous, so they will enjoy eating redworms, earthworms, and crickets. Ornate Wood Turtles are omnivorous, so they will enjoy eating redworms, earthworms, and crickets. They should also be provided with plenty of salad to boost their nutrition. This salad could consist of shredded vegetables and fruits, such as mango, banana, apple, cantaloupe, squash, zucchini, and kale. To give your turtle all the nutrition that he needs, you can also dust his salad with a high quality multi-vitamin and calcium supplement powder. Central American Wood Turtles should be provided with various hiding places, such as piles of dried leaves and cork bark tubes, because they can be shy. You may notice that, as you approach, your turtle will run to a sheltered spot and then come back out cautiously if you begin to offer him some food. Captive-hatched Ornate Wood Turtles will make better pets than those caught in the wild and imported. With proper care and handling, these intelligent turtles can become docile to the point that they can be fed by hand.", "facts": " 8-9\" Semi-terrestrial turtles Pelleted commercial diet, fruits, vegetables, worms, crickets Low", "tags": "Black Wood Turtle, Brown Wood Turtle, Central American Wood Turtle, Columbian Wood Turtle, omnivorous, Ornate Wood Turtle, Spot-Legged Wood Turtle, wood turtle, "}, "cherry head red foot tortoise": {"page_url": "https://www.petguide.com/breeds/turtle/cherry-head-red-foot-tortoise/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/09/cherry-head-red-foot-tortoise.jpg", "name": "Cherry Head Red Foot Tortoise", "type": "turtle", "text": "The Cherry Head Red Foot Tortoise is slightly smaller than the Red Footed Tortoise, and it is a hardy species. This is one of the most beautiful and impressive of all the tortoise breeds, and these pets are highly sought after as a result. These tortoises are intelligent, with a good memory and the ability to learn quickly, particularly when it comes to discovering when and where they will be fed, as well as where they can bask and where they can find shelter. They are also known for their strong sense of smell, though they are also highly sensitive to touch, as even a slight touch of their shell will be felt. Once you get to handle and really get to know a Cherry Head Red Foot Tortoise, it will become incredibly clear why this is one of the most popular breeds in the world. The Cherry Head Red Foot Tortoise is one of the most beautiful and impressive of all the tortoise breeds. Cherry Head Red Foot Tortoises live in exotic jungles that are found in Central America, South America, and the Caribbean. They are primarily found within limited areas of Brazilian rainforests and the Paraguayan Chaco. They are also found in Trinidad, Barbados, and Panama, and they can survive in various habitats that include dry and wet forests, grasslands, and savannas. Hatchlings will be about 1½” to 2” in length, and their rate of growth will be dependent upon several factors, including the quality and amount of food that’s provided, as well as the temperatures of the environment. As adults, these tortoises will typically be anywhere from 10-14” long, though some will be smaller or larger. Over the first 5-10 years, these tortoises will grow quickly, but their rate of growth will begin to slow with age. Cherry Head Red Foot Tortoises are intelligent, with a good memory and the ability to learn quickly. Considered one of the most attractive tortoise breeds, the Cherry Head Red Foot Tortoise has a distinct appearance. This tortoise will have leg scales and a head that features an orange or bright red color. Also, some of these tortoises are born with a darker shell, while others are lighter. However, all of them will grow up to feature the orange or red legs and the orange or red head. You should provide your Cherry Head Red Foot Tortoise with shallow water that is warm enough so that he can soak in it, along with clean, filtered, fresh water that he can drink. Always provide the soaking water in a dish that is big enough for the tortoise. Clean the water dishes regularly, especially after your pet has soaked. And he should also have a basking spot that is warm and comfortable. The enclosure for this tortoise breed should have a wall that is at least 16” high above the ground, and it should be sturdy. This wall should also be fixed a few inches below the ground in order to prevent your tortoise from digging. See-through walls and fences are not recommended for this breed, as your tortoise may attempt escaping if he can see through to the other side of the enclosure. Whenever the temperature is acceptable, you can allow your tortoise to spend time outside, but you can also raise your tortoise indoors for its first few years of his life. If you are going to be creating an indoor enclosure, stick with a basic plastic sweater box or what is known as a tortoise table, which can be constructed or purchased. Place your lighting, substrate, and other accessories inside this enclosure. You can use a variety of substrates for your indoor tortoise enclosure, but cypress mulch is an effective option because it is safe and absorbent. You can also use peat moss or coconut coir. For an outdoor enclosure, you can provide natural soil (make sure it does not have any fertilizers or chemicals). Provide flat, large rocks that can serve as a surface for your tortoise’s food. These rocks can also help to file his nails down. When indoors, room temperature should be between 68-80°F, and there should be a basking area heated to 90°F. You can provide your tortoise with a UVB light bulb placed overhead, and you can run this light for 12 hours each day. You can house a Cherry Head Red Foot Tortoise in a community setting. The Cherry Head Red Foot Tortoise enjoys eating a variety of foods. These include mixed vegetables, carrots, cactus, clover hay, grasses, and leafy greens that do not include spinach. You can also provide your tortoise with red fruits that are sweet, and you can provide supplements that are low in phosphorus and high in calcium. These tortoises will not hibernate; however, they will slow down during shorter days and cooler temperatures in the winter. You can house a Cherry Head Red Foot Tortoise in a community setting. Hatchlings will be able to do well with other tortoises, too, provided that you give them a bit of extra care. It is not recommended that you handle your tortoise too much, as doing so could stress your pet. Children, in particular, could accidentally drop the tortoise and cause harm. Older tortoises and juveniles will typically be even more resistant to any handling. Whenever you do handle your pet, do so with care. Never restrict these animals or pin them down. Let them behave as they want, particularly while young. As they get older, they will become more tolerant of people.", "facts": " 10-14” Terrestrial Fruits and vegetables Low", "tags": "Cherry Head Red Foot Tortoise, Cherry Head Tortoise, Red Foot Tortoise, Red Footed Tortoise, tortoise, tortoise breed, Yellow Footed Tortoise, "}, "chicken turtle": {"page_url": "https://www.petguide.com/breeds/turtle/chicken-turtle/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/11/chicken-turtle.jpg", "name": "Chicken Turtle", "type": "turtle", "text": "There are three species of Chicken Turtle, and they are the Eastern Chicken Turtle, the Florida Chicken Turtle, and the Western Chicken Turtle. The shell of Chicken Turtles will vary, but many of them feature lovely yellow and green rings. The three types of Chicken Turtle are seen in wild habitats in Virginia, and their range extends south all the way to Florida, as well as westward to Missouri, Texas, and Oklahoma. The Western Chicken Turtle, in particular, is mainly found to the west of the Mississippi River, while the Eastern Chicken Turtle will be found to the east of the Mississippi River. Also, the Eastern Chicken Turtle’s range does not extend as far north as the range of the Western Chicken Turtle. The Florida Chicken Turtle is found only in the lower two-thirds of the state of Florida. These animals prefer lakes, swamps, ponds, and other bodies of water that provide a soft substrate and a lot of vegetation. Chicken Turtles feature large eyes that are inquisitive looking, and they also have distinctly long and striped necks. They also feature a carapace that is pear shaped and showcases a net-like pattern. The feet are webbed to help them swim with ease. Adult females are larger than males, but when these turtles are born, they are a mere 1” in diameter. Males will also feature a thicker and longer tail, along with longer claws on the front feet. The Western Chicken Turtle can be distinguished by its flatter carapace when compared to other Chicken Turtle subspecies. They will sometimes be seen wandering on land as well. You can keep more than one Chicken Turtle in the same enclosure. The shell of Chicken Turtles will vary, but many of them feature lovely yellow and green rings. The carapace is usually anywhere from an olive color to dark brown. These turtles also feature a plastron that is yellow, and their rump will have vertical stripes. You will also easily notice a broad yellow stripe on the two front legs. The Eastern Chicken Turtle will showcase a duller color compared to Florida Chicken Turtles. They will also have narrow brown or green lines on their carapace, along with black markings on the underside of the rear and lateral marginals. There will even be a narrow band of color on the carapace rim. On the other hand, the Florida Chicken Turtle will have broad yellow or orange lines on its carapace, along with a wide band of color on its carapace rim, but there will not be any markings on its plastron. The Western Chicken Turtle will have faint, broad lines on its carapace, along with dark markings on the plastron seams. To keep your Chicken Turtle happy and healthy, you can set up an indoor or an outdoor enclosure that provides clean water with basking areas. If you have more than one Chicken Turtle living in the same enclosure, you will likely find them basking together, so piles of stones, pieces of driftwood, and large branches are good options for creating multiple basking spots. An indoor enclosure could be constructed using a large tub that is at least 20” deep, 84” long, and 48” wide. You can also use a tank that is at least 75 gallons for one or two adult males, or at least 125 gallons for one large female. Whatever enclosure you choose to use, make sure there is a high quality water filtration system in place, along with a UVB light shining down from above. You also need to set up a warm basking area, as your Chicken Turtle will spend a lot of time basking. And, finally, add both underwater and floating plants, along with driftwood, to the enclosure. For an outdoor enclosure, you can use an outdoor pond. However, these turtles will hibernate, so you need to set up a moderately cool area for hibernation, depending upon the type of Chicken Turtle you have. The Florida Chicken Turtle, for example, will remain healthy with a mild resting or cooling period. However, the Western and Eastern Chicken Turtles are more temperate, so they can use a hibernation period, especially to promote courtship and mating in spring and summer. Water depth should be about 2/3 of the enclosure, and you can add a soft substrate to the bottom. The air temperature should be set to anywhere from the mid 70s to 80s Fahrenheit, while the basking area should be heated to around 85-90°F. The water temperature should also be maintained around the mid 70s Fahrenheit for adults. Chicken Turtles are alert but shy. Hatchling and young Chicken Turtles will feast upon tadpoles, crayfish, and aquatic insects. However, as these turtles grow, they will become more omnivorous, so they will eat increasing amounts of plant material. You can feed your turtle a commercial pelleted diet, as well as invertebrates, fish, and non-toxic aquatic plants and leafy greens that include water hyacinth, water lettuce, watercress, kale, romaine lettuce, and carrot tops. You can keep more than one Chicken Turtle in the same enclosure, and you can also keep them with other turtle breeds that are not aggressive and have similar needs. Beware that these turtles will compete for food, and that could lead to injuries. Overall, these turtles are alert but shy, so they will dive into the water as they see someone approaching if they are basking. However, they do eventually become comfortable and tame, and they will end up coming to the surface to see if any food is being offered.", "facts": " 4-10” Semi-aquatic Commercial pelleted diet, invertebrates, leafy green vegetables, non-toxic aquatic plants, fish Intermediate Maintenance", "tags": "Chicken Turtle, Eastern Chicken Turtle, eastern painted turtle, Florida Chicken Turtle, painted turtle, turtle, turtle breed, Western Chicken Turtle, "}, "chinese stripe necked turtle": {"page_url": "https://www.petguide.com/breeds/turtle/chinese-stripe-necked-turtle/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/10/chinese-stripe-necked-turtle.jpg", "name": "Chinese Stripe Necked Turtle", "type": "turtle", "text": "Also known as the Golden Thread Turtle, the Chinese Stripe Necked Turtle is one of the most beautiful turtles that are kept as pets. However, in the wild, these turtles are endangered, and part of the reason why is because they are taken from their natural homes to be put into the pet trade. Therefore, if you are hoping to introduce a Chinese Stripe Necked Turtle into your family, be absolutely sure that the animal was captive bred. The Chinese Stripe Necked Turtle is one of the most beautiful turtles that are kept as pets. The Chinese Stripe Necked Turtle is mainly found in areas that are in eastern China, and their habitat extends to eastern Laos and central Vietnam. You can also find these turtles on the islands of Taiwan and Hainan. This turtle breed can inhabit a wide range of climates, including tropical, subtropical, and temperate. It also lives in just about all freshwater habitats, including rivers, drainage ditches, small ponds, and large lakes. These turtles have strong muscles and webbed feet that allow them to be powerful swimmers, even when they are in bodies of water that have a moderate current. When looking at the Chinese Stripe Necked Turtle, you will see that the head is narrow and the snout is slightly pointed. You will notice that this turtle also features scales covering the forelimbs, and every limb is webbed. You can differentiate between adult males and adult females because the females will be bigger, and the males will also feature a plastron that is slightly concave. If you wish to keep a community tank, the Chinese Stripe Necked Turtle is a good choice. The Chinese Stripe Necked Turtle features fine black and yellow lines on the neck, and it is these lines that give the breed its name. The carapace will be anywhere from black to reddish-brown in color, and the horny scutes are also outlined in yellow. The plastron will be yellow and there will be a large black or brown blotch on every scute. This turtle’s limbs will be olive and covered in the same fine yellow lines that are found on the neck. The chin and jaw feature a cream hue. You can use a glass tank, plastic storage bin, sweaterbox, or stock tank for your Chinese Stripe Necked Turtle’s enclosure. If you have a female who is 10”, she will need at least 100 gallons of space, and if you have a 5” male with two 10” females, they will need a minimum of 150 gallons. When choosing tank furnishings, make sure that they are securely set in place and that they are appropriate for the size of your pet. For example, if you have a small turtle, you can provide him with a smaller basking area, but if he grows larger, you will need to upgrade the basking site so that your pet can come out of the water and dry completely. And if there are any materials in the tank, make sure that your turtle can’t get trapped under them while underwater. Use a water heater to maintain the water temperature anywhere from 75-80°F, and keep the air temperature in the tank anywhere from 80-85°F. The basking area should be set to anywhere from 85-90°F, and there should be a UVB light overhead. Keeping the water as clean as possible is important to the health of this turtle, so invest in a high quality water filter for the enclosure. Limit handling your Chinese Stripe Necked Turtle unless it is absolutely necessary. Chinese Stripe Necked Turtles are omnivorous, so they will eat both animals and plants. Mature females, however, will be more herbivorous, while young females and males are predominantly carnivorous. These turtles are easy to feed, as they will rarely refuse food that is offered to them. You can give your pet a commercial pellet diet for turtles, as well as water hyacinth, water lettuce, duckweed, and romaine lettuce, which you can leave floating in the water. If you wish to keep a community tank, the Chinese Stripe Necked Turtle is a good choice. These turtles are social, much like sliders and cooters. Just keep in mind that, to prevent injuries, the biggest turtle in the tank should not be over twice the size of the smallest turtle in the enclosure. As is the case with many turtle breeds, it is best to limit handling your Chinese Stripe Necked Turtle unless it is absolutely necessary. And remember to purchase your turtle from a reputable breeder who can guarantee that your pet was captive bred, as you do not want to purchase one that was taken out of the wild, where this species is endangered.", "facts": " 9-10” Aquatic Commercial pelleted turtle diet, non-toxic aquatic plants, leafy green vegetables Low Maintenance", "tags": "chinese pond turtle, Chinese Stripe Necked Turtle, Golden Thread Turtle, map turtle, Red-Eared Slider, reeve's turtle, turtle, turtle breed, "}, "common musk turtle": {"page_url": "https://www.petguide.com/breeds/turtle/common-musk-turtle/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/09/common-musk-turtle.jpg", "name": "Common Musk Turtle", "type": "turtle", "text": "The Common Musk Turtle is also known as the Stinkpot Turtle because these animals can emit an offensive, foul odor from the glands that are located at the corners of their plastron. Along with this odor comes an orange colored liquid. However, that usually only happens when these turtles are startled or frightened, so if your pet Common Musk Turtle is content, and if he has gotten used to being handled, he won’t feel the need to emit this liquid and odor. The Common Musk Turtle is known as the Stinkpot Turtle because they can emit an offensive, foul odor. Common Musk Turtles are found in the eastern parts of North America, all the way from Ontario down to Florida. They are also found in habitats extending to the west, into Wisconsin and Texas. These turtles are typically located in river habitats, as well as slow-flowing portions of streams. They can also be found in ponds and lakes. When looking at a Common Musk Turtle, you will notice that it features a blackish-brown colored carapace that is also highly domed and has a vertebral keel, while the plastron is smaller. The keel typically flattens in adults, but it will be highly prominent amongst Common Musk hatchlings and juveniles. In addition to the blackish-brown carapace, the Common Musk Turtle also features a pair of yellow stripes that run parallel to one another on the animal’s head. These extend all the way from the neck to the nose, and they will begin fading in intensity as the turtle ages. Common Musk Turtles make great pets if you know how to handle them. You do not need to provide a Common Musk Turtle with substrate, so you can stick with a tank that has a bare bottom that will be easier to clean on a regular basis. However, if you want to create an attractive and natural looking tank for your pet, you can add some medium sized gravel to the bottom, though this is optional and not a requirement. Your turtle’s tank should be at least 20 gallons, and it should have a submersible canister water filter. One adult Stinkpot turtle can live in this enclosure, so if you wanted to keep a pair of these turtles, you would need a 40-gallon tank with a stronger underwater filter. Fill your turtle’s tank with non-chlorinated water. The water should be deep enough that your pet’s hind legs can touch the bottom while being able to stretch a bit and breathe at the surface. The turtle shouldn’t have to paddle constantly. Your turtle might not leave the water, but you should still provide a floating dock or area where he can bask if he chooses to do so. Provide a basking light and place it above the area of the tank where the animal would normally bask. Set the basking temperature to around 90°F, and set the ambient air temperature in the tank to around 85°F by using a ceramic heat emitter. Set the water temperature to 72-78°F using a submersible heater. To keep your turtle healthy, he will need exposure to UV rays from UVB bulbs. Keep these lights on for 12 hours and turn them off for the remaining 12 hours of the day. If you want to keep more than one Common Musk Turtle, you can get one female and one male. In the wild, the Common Musk Turtle will feast on a varied diet. For example, these turtles will enjoy eating mollusks, snails, and crayfish, and will even attack small tadpoles. They also enjoy eating both aquatic insects and terrestrial insects that end up falling into their water, such as damselfly nymphs and dragonflies. Every now and then, these turtles also like to eat plants, such as duckweed and Elodea species. Your pet turtle can also feast upon some fish that has been cut up into small pieces, as well as shrimp, earthworms, bloodworms, and crickets. To ensure that your pet gets all of the nutrition that he needs, you can also provide him with a commercial pelleted diet for turtles. Common Musk Turtles make great pets, but because they can emit an offensive liquid and odor as a defense mechanism, and because they will sometimes try to bite you, you should be careful when you handle them. You don’t want to frighten these turtles, and you should make it a point to keep your fingers towards the animal’s rear in order to reduce the odds that you will get bitten. These turtles do have flexible, long necks that can allow them to bite you easily, so beware. If you want to keep more than one Common Musk Turtle, you can get one female and one male. Keeping two males in the same enclosure isn’t recommended. But if the male shows too much interest in the female or starts to harass her, the two should be separated. As with all other turtle breeds, it is best to introduce a captive-bred Common Musk Turtle to your family, as these turtles may be less frightened of people and more accustomed to handling.", "facts": " 4-4.5” Aquatic turtle Pelleted commercial diet, Insects, Snails, Mollusks, Worms, Fish, Non-toxic aquatic plants Low Maintenance", "tags": "Common Musk Turtle, Loggerhead Musk Turtle, Mud Turtles, musk turtle, stinkpot, stinkpot turtle, "}, "cumberland slider": {"page_url": "https://www.petguide.com/breeds/turtle/cumberland-slider/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/09/cumberland-slider.jpg", "name": "Cumberland Slider", "type": "turtle", "text": "Because Cumberland Slider Turtles are related to the Red Eared Slider Turtle, they make great pets, and when it comes to their care requirements, they need the same things that Red Eared Slider Turtles would. The differences between the Cumberland Slider and the Red Eared Slider include where they are found and their color (Cumberland Sliders are more yellow, as well as lighter in color, than Red Eared Sliders, and they don’t have the distinctive “red ear” either). Cumberland Sliders make great pets. The Cumberland Slider Turtle can be found in the southeastern part of the United States, and the Mississippi River and Tennessee River drainages. They will be seen in quiet waters that feature mud at the bottom, so habitats like streams, lakes, and ponds are preferable. They also like environments where there is a lot of aquatic vegetation, basking spots, and organic substrate. A lot of experts claim that the native land of these turtles is the Cumberland River Valley, which is found in Tennessee and Kentucky, but because of the pet trade, these turtles can now be found in Illinois, Georgia, and Alabama. Cumberland Sliders have a couple of rounded projections that are located on the posterior edge of their shell, which is also a bit keeled. Adults will have a carapace that is oval and wrinkled, while the plastron will be a bit smaller compared to the carapace, and it will also be hingeless. Each of the marginals showcases a spot on the bottom side. Male Cumberland Sliders will showcase long claws on their front legs, and they will be smaller than females. Females will also feature a shell that is domed more. Hatchings will look like their adult counterparts, but their carapace will be green and their plastron will be yellow. Cumberland Sliders are known for being active and fun to watch. The Cumberland Slider Turtle features an olive brown colored carapace, and you will also note this turtle’s yellow markings. There is a yellow bar behind each eye, and it can be wide or thin. The turtle’s skin will be brown, but it will have a greenish or olive tint, along with yellow striping as well. This turtle’s plastron will have stripes or bars of yellow color, along with dark spots like those on the carapace’s ridge. The front legs will feature large yellow stripes, and the backs of the turtle’s thighs will have alternating black and yellow stripes. If you have a juvenile Cumberland Slider, you can house him in a 10-20 gallon tank, but an adult would need a 55 gallon tank. You can house a pair of adults in a 75 gallon tank. They can also be housed outdoors. Only use fresh, filtered water in your turtle’s tank, and have a high quality filtration system working in the tank at all times. UVB lighting also needs to be provided to help your turtle stay healthy, and you can turn the lights off at night to mimic natural cycles. In terms of substrate, these turtles do well with fine pea gravel or reptile sand. If you choose to use gravel, it should be big enough that your turtle will not be able to eat it. Your turtle should be able to enjoy plenty of room for swimming, and he should be able to completely submerge himself and swim around. However, there should also be an area for basking that allows your pet to climb out of the water completely. This area should also be big enough that your turtle can completely dry off his plastron and shell, and he should be able to really stretch out and relax. The water temperature should be set at 70-75°F, and the basking area should be set to 90°F. A cooler area should be on the opposite end of the basking area of the tank. Temperatures can drop to around 65°F at night, but a good daytime ambient temperature would be anywhere from the upper 70s to lower 80s. If you have more than one Cumberland Slider Turtle, you may see them all basking together. Cumberland Sliders prefer an omnivorous diet, so you can feed your pet a combination of commercial pelleted turtle food and then supplement that with mealworms, crickets, and leafy green vegetables, such as collard greens, turnip greens, and romaine. These popular pet turtles are known for being active and fun to watch. They can get used to being handled, but they are the types of animals that will slide into the water whenever they are frightened while they are basking (hence the name “slider”). If you have more than one Cumberland Slider Turtle, you may see them all basking together. They might even stack themselves on top of one another as they bask.", "facts": " 5-8” Semi-aquatic turtle Pelleted commercial diet, Insects, Leafy green vegetables Average Maintenance", "tags": "Cumberland Slider, Cumberland Slider turtle, Red-Eared Slider, Red-Eared Slider Turtle, Slider Turtle, "}, "eastern box turtle": {"page_url": "https://www.petguide.com/breeds/turtle/eastern-box-turtle/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/09/eastern-box-turtle.jpg", "name": "Eastern Box Turtle", "type": "turtle", "text": "The Eastern Box Turtle is attractive and often kept as a pet, but it should only be introduced into your family if you know for certain that a turtle was bred in captivity and properly cared for. You should not remove an Eastern Box Turtle from its wild habitat, as it likely will not do well in captivity. These turtles are not the best choice for beginner turtle owners because they do require quite a bit to keep them happy and healthy. You should not remove an Eastern Box Turtle from its wild habitat, as it likely will not do well in captivity. Eastern Box Turtles are often found in wild habitats from Michigan down to Tennessee, as well as east to Georgia, and they can even be found as far north as Maine. No two Eastern Box Turtles will look exactly the same. However, they are identified easily, thanks to their brightly colored markings. These turtles feature a dome-shaped, high carapace, as well as a hinged plastron and a down-turned beak. Males and females look the same, but the males have a brighter eye color. The males will typically feature red eyes, while females will feature yellow-brown eyes. The design and colors of Eastern Box Turtles will vary from one individual to another. The design and colors of Eastern Box Turtles will vary from one individual to another. You will notice that some of them may be almost totally solid black or yellow, while others could have different designs that include shades of yellow, brown, black, red, and white on their shells and on their skin. Most of the time, you will note that these turtles are olive colored or dark brown, and they will have bright yellow or orange patterns. You can set up an outdoor habitat for your Eastern Box Turtle by providing him with a garden-like environment and access to water all year long. You should also provide your outdoor turtle with food and a safe place where he can hibernate in the winter. Also, the enclosure should be a minimum of 4’x4’ for an adult. Dig down at least 6” below the bottom of the walls of the enclosure in order to provide a safe barrier that will prevent your Eastern Box Turtle from escaping. You can also use bricks or chicken wire, along with a screen top, to protect your turtle from predators. Your outdoor enclosure should have plants and shrubs for shade, as well as plant pots that have been turned on their sides, hollowed out logs, and other safe materials that can be utilized for hiding when necessary. If you are going to keep your turtle indoors, the enclosure’s size should be at least 48”x24”x15”. To keep your turtle safe, the walls should be 15” high for a single turtle. Avoid the use of a glass tank. Daytime air temperature for your Eastern Box Turtle’s enclosure should be set at 75-85°F, while the basking area should be set at 85-90°F (there should be a warmer side and a cooler side in the turtle’s enclosure). Humidity should remain anywhere from 60-80%. To maintain an enclosure’s humidity, mist it regularly. There should also be plenty of substrate that is deep enough (usually at least 3” deep) for your pet to burrow into it. You can use potting soil or a coir and peat moss mix. Keep the substrate moist, but not wet, as this will help with humidity. There should be a water bowl, too, and it should be large so that your turtle can climb into it and out of it with ease, as well as turn around in it comfortably. Clean the water bowl at least once a day. Be sure to provide a few hiding places at either end of the turtle’s enclosure. UVB lighting is also necessary, or you can provide your pet with access to sunshine. If you have an outdoor turtle, you should allow it get sunshine in the morning and in the late afternoon when your pet is likely to be the most active. Eastern Box Turtles are beautiful to look at, but don’t like being handled. Eastern Box Turtles can eat a varied diet of insects, plants, snails, and worms. You can also give them treats that include the rinds of cantaloupe and watermelon, along with fresh vegetables and fruits, such as squash, blueberries, carrots, blackberries, kale, dandelion leaves, strawberries, tomatoes, endive, mulberries, and pumpkin. Choose pesticide-free vegetables and fruits. Dice them finely and mix them together. When providing insects, such as wax worms, grasshoppers, crickets, slugs, red worms, and earthworms, lightly dust them with a calcium powder that is free of phosphorus. Offer the insects at every other meal. You can also give your turtle a multivitamin/mineral supplement weekly. Offer the food on a flat rock or on a plastic lid so that your pet will not eat the substrate in his enclosure. Eastern Box Turtles are beautiful to look at, but they are not the ideal choice if you are hoping to have a turtle that will enjoy being handled. It’s also recommended that children not handle these turtles. If you are going to have more than one Eastern Box Turtle, it is best to not put more than one male together because dominant males will fight. Females should not be introduced unless you plan on breeding them.", "facts": " 4-6” Terrestrial turtle Fruits, Vegetables, Insects, Worms High Maintenance", "tags": "box turtle, common box turtle, eastern box turtle, Florida Box Turtle, Gulf Coast Box Turtle, Mexican Box Turtle, Three-Toed Box Turtle, Yucatan Box Turtle, "}, "eastern painted turtle": {"page_url": "https://www.petguide.com/breeds/turtle/eastern-painted-turtle/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/09/eastern-painted-turtle.jpg", "name": "Eastern Painted Turtle", "type": "turtle", "text": "The Eastern Painted Turtle is an attractive pet turtle breed that is ideal for beginners. These turtles are small and easy to keep in an indoor or outdoor enclosure. The Eastern Painted Turtle is an attractive pet turtle breed that is ideal for beginners. Eastern Painted Turtles can be found in environments from Maine all the way down the northeastern coast to North Carolina. These animals have also been found even farther south in South Carolina and in Georgia, but they are typically found to the east of the Appalachian Mountains. These turtles prefer making their home in permanent ponds. You can also find them in farm ponds and beaver ponds. Occasionally, you will find these turtles in the slow-moving areas of rivers as well. The carapace of an Eastern Painted Turtle is oval, keelless, flattened, and smooth. The widest and highest points of the carapace will be in the center. This turtle’s plastron will not typically have a pattern, but some turtles might feature dark figures that vary in size and design and border the midline. Also, the plastron will be hingeless and a bit shorter than the carapace. Juvenile Eastern Painted Turtles will look like adults, but their carapace will be more round until they are 2 years old. The carapace of an Eastern Painted Turtle is oval, keelless, flattened, and smooth. An Eastern Painted Turtle will have a carapace that can range from olive to black in color. It will also have red or yellow borders, along with red markings, usually in the form of crescents or bars, on the marginals. The plastron is yellowish in color. The skin will be black to olive in color as well. The legs, tail, and neck will be striped with yellow or red colors. The head, too, will be striped with yellow, and there will be a yellow line extending towards the back, starting from below the turtle’s eyes. There may also be a similar line at the lower jaw. And a yellow streak is found on either side of the head behind the animals’ eyes. You will also notice that the chin has two yellow lines that are wide and meet at the jaw’s tip. The Eastern Painted Turtle is an active swimmer, so the tank you provide your pet with should be as large as possible. Whether you house your turtle inside or outside, a single juvenile or baby turtle should have at least 10 gallons of water volume to call his own. This translates to at least a 15 or 20 gallon tank filled with 10 gallons of water. If you plan on adding more baby turtles, add 5 gallons of water volume for each one. A single adult turtle should have at least 20 gallons of water volume, and each additional turtle should have another 10 gallons of water volume. Because Eastern Painted Turtles like to bask, you will need to provide your pet with a solid platform or a sloping log that will give him the space necessary to be completely out of the water. You can try an egg crate material or plastic grating for the platform, as this won’t be abrasive to the plastron, and it will also allow the turtle’s body to dry completely. For basking, you should also have a light that warms the basking spot to around 85-95°F. The depth of the water in your turtle’s tank should not be any less than roughly twice the width of your pet’s shell. There should also be hiding spots under the water, provided by things like plastic plants or non-toxic live plants, but avoid any tank décor that would potentially cause your turtle to become trapped and drown. You can leave the bottom of your turtle’s tank bare or you can use a substrate, such as gravel or sand, if you wish to provide a more natural looking enclosure. When choosing a substrate, go with one that has particles that are either small enough that they’ll easily pass through the animal’s digestive tract if swallowed, or too large to be swallowed in the first place. Add a UVA/UVB light to your turtle’s enclosure, unless your turtles will be outside and will get adequate amounts of natural sunlight. In terms of temperature, the water should be heated to 75-80°F, and the ambient air should be 80-85°F. Eastern Painted Turtles typically showcase a pleasant disposition, and they are energetic and active. Eastern Painted Turtles prefer an omnivorous diet, so they will enjoy eating green leafy vegetables and aquatic plants, such as water hyacinth, duckweed, elodea, and water lettuce. They also like to eat fish and insects like crickets and earthworms. You can also provide a commercial pelleted turtle diet. When eating, these turtles will have to swallow the food while underwater. Eastern Painted Turtles typically showcase a pleasant disposition, and they are energetic and active, so they make great family pets. However, you shouldn’t expect these animals to be social with people. You should only handle your turtle when necessary because handling will be stressful to your pet. You can house more than one Eastern Painted Turtle in the same enclosure, and you can even include turtles of other species if they have similar requirements. Both males and females, however, can be dominant or show aggressive behavior over territory, so you have to give them plenty of space and hiding places.", "facts": " 4.5-6” Semi-aquatic turtle Pelleted commercial turtle diet, Fish, Non-toxic aquatic plants, Worms, Insects, Green Leafy Vegetables Low Maintenance", "tags": "eastern painted turtle, Midland Painted Turtle, painted turtle, Southern Painted Turtle, Western Painted Turtle, "}, "european pond turtle": {"page_url": "https://www.petguide.com/breeds/turtle/european-pond-turtle/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/11/european-pond-turtle.jpg", "name": "European Pond Turtle", "type": "turtle", "text": "The European Pond Turtle is one of just a few freshwater turtle breeds that are found throughout Europe. These unique and attractive turtles are highly sought after as pets. There are actually 14 regional subspecies of European Pond Turtles, and they will be different according to their colors, markings, and size. European Pond Turtles are unique and attractive, and are highly sought after as pets. In addition to being found in the central and southern countries of Europe, the European Pond Turtle also makes its home in northern Africa and central and western Asia. These aquatic turtles will only leave the water in order to nest or to bask. They prefer an array of freshwater habitats that include rivers, drainage canals, streams, lakes, and ponds. They like big bodies of water that feature soft bottoms of sand or mud, and they like slow-moving water as well. Sandy areas that are near the water are used for nesting, and lush vegetation provides food and hiding places. Juveniles, however, prefer to stick with shallow waters. Northern turtles will end up hibernating during the winter, while those found in southern areas will aestivate during the summer. European Pond Turtles will look a little different depending upon where they are found in their extensive range. For example, the turtles that are found in the southern part of their range will be noticeably lighter and smaller than their northern counterparts, who are bigger and darker. These turtles feature a round or oval carapace that has a small amount of flaring on its marginal scutes. The shell will be smooth and it will glisten in the sunshine when it is wet. The plastron will be hinged, and these turtles will only be able to close up partially. The head of these turtles will be slightly pointed and large, though it can also sometimes be blunt and smooth. There are actually 14 regional subspecies of European Pond Turtles. These turtles can typically be identified quite easily, thanks to their bright gold or yellow speckling, which is found on their dark colored carapace, as well as on the skin of adults and juveniles. Some European Pond Turtles, though, could actually be almost totally black in color, with hardly any yellow markings on their body. The iris of the male European Pond Turtle will vary by region, so you might find these turtles with eyes that range from brownish yellow or red, to pure white or yellow. Females, on the other hand, typically have yellow eyes, although they can be white occasionally as well. When young, the European Pond Turtle will need to be housed indoors only, but once your turtle is an adult, an in-ground outdoor enclosure is preferred. Your turtle will need room for both walking and swimming, so a 30’x30’ enclosure is a good place to start, along with a 15’x15’ water area within it, for a small group of turtles. Just make sure that the walls, which can be made of cement blocking, fencing, or wood materials, are securely kept in place to prevent the turtles from getting out by climbing or digging. The water depth should be maintained at over 18” deep, but gradually slope the bottom of the pond so that the turtles can get into and out of the water easily. Make the middle of the pond the deepest area. If you will be leaving the turtles outside in the winter to hibernate, the water will need to be deep enough that it will not completely freeze. Decorate the enclosure with vegetation both on land and in the water. Good options include frogbit, lotus, water lettuce, water hyacinth, lilies, cattails, anacharis, and iris. In this way, the turtles can hide and look for food in the water. On land, you can plant flowering plants, grasses, and low-lying shrubs. Your turtles can use those plants in the summer to escape the heat. For basking platforms, you can add driftwood or logs, as a couple of examples, but you should avoid adding too many rocks to the enclosure, as these could be abrasive to the plastron. Filtration will help keep the water as clean as possible, but the use of live plants in the pond will also work to filter the water naturally. For the substrate, add 12-24” of mud or peat to the bottom of the pond so your turtle can burrow into it and for your plants to have a good base to root into. Finally, make sure that your turtles have access to natural sunlight when outdoors or UVB lighting when indoors. You will not need to use an aquarium heater for this breed. European Pond Turtles can be identified quite easily, thanks to their bright gold or yellow speckling. These turtles will enjoy feasting on a wide variety of foods, including shrimp, crickets, insects, fish, various meats like chicken, beef, and turkey, frogs, tadpoles, worms, mice, slugs, and snails. They will also do well with commercial pelleted diets for turtles to ensure all nutritional needs are met. The European Pond Turtle will likely dive into the water if he is on land and sees you coming near him. However, he will eventually learn to associate you with food. You may notice that your turtle, upon seeing you, swims towards you, climbs out of the water, and waits for the food to be dropped in his enclosure.", "facts": " Up to 9” Aquatic Commercial pelleted turtle diet, worms, insects, invertebrates, crickets, fish, meat Moderate Maintenance", "tags": "Blanding's Turtle, european pond turtle, pond turtle, Sicilian Pond Turtle, turtle, turtle breed, "}, "false map turtle": {"page_url": "https://www.petguide.com/breeds/turtle/false-map-turtle/", "image_url": "https://www.petguide.com/wp-content/uploads/2017/12/false-map-turtle.jpg", "name": "False Map Turtle", "type": "turtle", "text": "The False Map Turtle is one of several breeds of Map Turtles. They are also referred to as Sawback Turtles, thanks to the interesting points that run along the top of the shell. Although they are considered moderate maintenance turtles, False Map Turtles can also be a good choice if you are new to keeping turtles as pets. The False Map Turtle is one of several breeds of Map Turtles. False Map Turtles could be found living in large rivers and their tributaries, but they could also sometimes be found living in backwaters, oxbows, and floodplain ponds as well. Their wild range includes Missouri, Minnesota, Illinois, Indiana, Nebraska, the Dakotas, and Kentucky. When they are not in the water, they can be seen basking. The reason why the False Map Turtle has this name is because it features light yellow lines on its carapace. These lines form what looks like the pattern that would be found on a map. However, the pattern is more obvious on younger turtles, as it tends to fade with age. When looking at a False Map Turtle, you will also notice that this breed features an obvious ridged keel on its carapace. False Map Turtles are also referred to as Sawback Turtles. A False Map Turtle’s carapace will range from brown to olive in color. It will also showcase light yellow markings that have dark borders. The plastron, on the other hand, will vary from a yellow color to a cream color. It features dark lines that run along the seams and create a pattern in juveniles. In addition to the map-like pattern of light yellow lines on the carapace, the False Map Turtle also features light yellow lines on the limbs and head. You will even note a backwards “L” shape behind each of the eyes. The overall body color ranges from gray-brown to black, and a False Map Turtle could have white, yellow, or light brown stripes on the body as well. The eyes could be light yellow, green, white, or brown, and they also feature a dark bar. Small spots that are light in color can also be seen on the turtle’s chin and below the eyes. False Map Turtles prefer living in flowing water, and you should provide your pet with a large enclosure that has proper filtration in place because these turtles are highly sensitive to water quality. Also, females will grow to a fairly large size, so it is important to keep the size of your enclosure in mind, particularly if you are planning on keeping your turtle indoors or with other turtles. The depth of the water should be enough that your False Map Turtle can swim comfortably, as these animals are great swimmers and will need deep water. Your turtle will also like to have a log snag underwater, as that could provide an ideal place to rest. In terms of substrate, you could use fine to medium sized gravel, or you could instead opt for sand. When it comes to basking, set up an area where your turtle can completely dry the plastron and carapace to help prevent health problems like shell rot and fungus. Ensure that the basking site is warmed to a minimum of 80°F, although it could also range from the high 80s to low 90s Fahrenheit, with the help of a heat lamp. And don’t forget that UVB lighting should also be provided for basking. Maintain the air temperature in your False Map Turtle’s enclosure anywhere from the low to mid 80s Fahrenheit. And when it comes to water temperature, this turtle can do well in water that is maintained anywhere from the low to mid 70s Fahrenheit, so a submersible heater can definitely come in handy. A single male adult can be housed in an aquarium that is 40 or more gallons, while females could do well in an aquarium that is 90 or more gallons. If you wish to house more than one False Map Turtle in the same enclosure, provide at least 20 additional gallons of tank space for every extra male, or an additional 50 gallons for every additional female. False Map Turtles can also be a good choice if you are new to keeping turtles as pets. Because the False Map Turtle is a carnivorous breed, you can feed your pet a variety of foods, such as snails and mussels, fish, crickets, worms, and aquatic insects. However, these turtles could also enjoy some aquatic plants occasionally, and you can also feed your pet commercial turtle pellets. In terms of their personality, False Map Turtles are considered docile, and they typically will not bite you, so they make good pets. They can be housed with other turtles, such as other Map Turtles, Painted Turtles, Cooters, Sliders, Mud Turtles, and Musk Turtles, in a community enclosure as well. And they really do enjoy basking a lot (in the wild, they could spend hours in the sunshine). ", "facts": " 6”-10.5” Aquatic turtles Pelleted commercial diet, snails, mussels, fish, crickets, worms,  aquatic insects, aquatic plants Medium maintenance", "tags": "Cooters, False Map Turtle, map turtle, Mississippi Map Turtle, Mud Turtles, Musk Turtles, Painted Turtles, Sliders, turtle breed, "}, "flattened musk turtle": {"page_url": "https://www.petguide.com/breeds/turtle/flattened-musk-turtle/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/11/flattened-musk-turtle.jpg", "name": "Flattened Musk Turtle", "type": "turtle", "text": "The Flattened Musk Turtle is one of five species of Musk Turtles that include the Razorback Musk Turtle, Loggerhead Musk Turtle, Stripe-Necked Musk Turtle, and Common Musk Turtle. As is the case with all other Musk Turtles, this animal will release a foul smelling liquid when frightened, so care needs to be taken to ensure your pet will feel safe and at ease. This breed is rare in the pet trade, so it might be difficult to find one. However, like all other turtle breeds, it is best to purchase your Flattened Musk Turtle from a reputable breeder who can ensure that your pet was born and raised in captivity, especially since these turtles are already endangered. Taking turtles out of their wild habitats could lead to a decline in their populations, and animals that are captive bred tend to be healthier and more accustomed to the presence of humans. The Flattened Musk Turtle is one of five species of Musk Turtles. Flattened Musk Turtles are found in Alabama, particularly in the upper Black Warrior River system. This species can survive in a range of lakes and streams, but it prefers small rivers and free-flowing creeks that have vegetation and rocks. What distinguishes the Flattened Musk Turtle from the other Musk Turtle breeds is the fact that it does not feature a keel on the carapace. Instead, the top is flattened and the carapace is serrated slightly on the back edge. Two barbels are seen on this turtle’s chin, and all four of the feet are webbed. Males will have spine-tipped tails that are thick and long. The upper shell of the Flattened Musk Turtle will range from a dark brown hue to a yellowish brown or orange color. The upper shell of the Flattened Musk Turtle will range from a dark brown hue to a yellowish brown or orange color. It will also feature small black streaks and spots. The plastron will be yellowish to pink, while the head and the body of these turtles will be mottled with black and will be olive green in color. Often you will find spots on the top of this turtle’s snout, as well as narrow stripes on the sides and top of the neck. It is recommended that you have, at a minimum, a 40-gallon aquarium for an adult Flattened Musk Turtle. However, to give your pet enough room to swim, it is best to get an aquarium that is longer rather than tall. While a hatchling will only require water that is up to 4” deep, adults will need a minimum of 8-12” when it comes to water depth. Also, because these turtles need their water to be clean at all times, a high quality filtration system will be necessary. Don’t put too much décor in your tank, although a couple of hiding places will keep your turtle happy. Just make sure that he can’t get caught and drown. Build up one end of the tank with driftwood, rocks, and other materials that will lead to a basking area. Although your pet will spend the majority of time underwater and will not bask often, there should always be one in place. Over the basking area, set up a heat lamp to heat the spot to around 90°F, and also set up a UV light over the enclosure. A water temperature of 72-78°F can be maintained with the help of a water heater, and ambient air temperature can be maintained in the mid-80s Fahrenheit with the use of a heater over the enclosure. Artificial or live plants can be added to the tank to create a natural looking habitat and even more hiding places. If you are using live plants, make sure that they are non-toxic, as your turtle may decide to eat them. And for substrate, you can choose to add large gravel, silt, or sand to the bottom of the tank, or you can keep the bottom of the tank empty. Flattened Musk Turtles are shy animals that should only be kept as pets by those who will be fine with simply observing them. In the wild, Flattened Musk Turtles will primarily consume aquatic insects and mollusks. Adults, in particular, will feed on aquatic snails, as well as mussels and clams, but juveniles will usually feast on aquatic insects instead. In addition to non-toxic aquatic plants, snails, and insects, you can also provide your Flattened Musk Turtle with a commercial pelleted diet to fulfill all of your pet’s nutritional needs. You can feed an adult every two or three days, but juveniles will need to eat every day or at least every other day. Flattened Musk Turtles are shy animals that should only be kept as pets by those who will be fine with simply observing them. This is not a good choice if you are hoping to bring home a turtle that you will be able to handle a lot. In fact, you should keep handling of these turtles to a minimum and only do so when it is necessary. When handled, they may be inclined to bite if they are stressed or scared.", "facts": " 3-5” Aquatic Commercial pelleted diet for turtles, non-toxic aquatic plants, aquatic insects, snails Low Maintenance", "tags": "Common Musk Turtle, Flattened Musk Turtle, Loggerhead Musk Turtle, musk turtle, Razor-Backed Musk Turtle, Stripe-Neck Musk Turtle, Stripe-Necked Musk Turtle, Stripenecked Musk Turtle, stripneck musk turtle, turtle, turtle breed, "}, "florida box turtle": {"page_url": "https://www.petguide.com/breeds/turtle/florida-box-turtle/", "image_url": "https://www.petguide.com/wp-content/uploads/2017/12/florida-box-turtle.jpg", "name": "Florida Box Turtle", "type": "turtle", "text": "The Florida Box Turtle is an attractive breed, but these animals are high-maintenance, so they aren’t the best idea for those who are beginners at turtle care. The Florida Box Turtle is an attractive breed, but these animals are high-maintenance. Florida Box Turtles spend their time in marshes, scrub areas, and forest. They are primarily found in Florida and the Florida Keys, but they could also be seen in the most southern parts of Georgia. The Florida Box Turtle features a shell that is highly domed, and it also has a hinge so that this turtle could enclose itself completely in its shell. You will also notice that the back of the shell slightly flares outward as well. Florida Box Turtles often feature four toes on their back feet. And, thanks to their sharp claws, these little turtles are also great climbers, which makes properly securing your pet’s enclosure necessary. Females will showcase brown or dark red eyes, and their plastron will typically be flatter than that of males. Male Florida Box Turtles, on the other hand, will have eyes that are orange or bright red. Their tail will also typically be longer and thicker compared to females, and their back feet will feature a hooked claw. Florida Box Turtles often feature four toes on their back feet. In terms of coloration, the Florida Box Turtle looks similar to the Western Ornate Box Turtle; however, this breed features more yellow markings that are also thinner. The shell itself is black, and there are also thick yellow lines on both sides of the turtle’s head. Even though you could house a Florida Box Turtle indoors, the best type of habitat for this breed is one that is set up outside. This should be a secure enclosure to help keep your pet safe, and it should be in an area that will get sunlight for part of the day, as well as provide shaded spots throughout the day. An enclosure that is made of cinder blocks or wood and is around 4’ by 8’ could house up to four adults. Using fencing is recommended, and ensuring that your turtle can’t see through to the outside of the enclosure will prevent it from constantly trying to escape. Also, using an underground barrier will help prevent your turtle from digging and getting out. The humidity in your Florida Box Turtle’s enclosure should always be anywhere from 70-90%. To maintain this high humidity level, you could spray the animal’s enclosure at least a couple of times each day, as well as whenever it is necessary to do so. On top of that, you will also need to provide your pet with a substrate that is moist and deep enough for your turtle to be able to burrow into it. And be sure to provide a variety of hiding spots, along with a large, shallow dish that could be filled with clean water (your turtle should be able to climb into and out of this water dish easily as well, as Florida Box Turtles enjoy soaking in water). If you have several turtles in the same enclosure, there should be multiple water dishes to accommodate all of them, or you should have a water area that’s big enough for all of them. Within the enclosure, you could also use grass clippings and fallen leaves to create a compost area that could attract invertebrates and insects that your turtle could hunt down. This compost area could also double as a hiding spot. The Florida Box Turtle enjoys eating a variety of invertebrates, as well as plants and insects, along with a commercial food for turtles. You could feed your pet wax worms, mealworms, silkworms, earthworms, and crickets, but your turtle could also consume slugs, flies, spiders, and beetles. Dusting your turtle’s food with a high quality vitamin powder and calcium supplement is also recommended. When it comes to vegetables, your Florida Box Turtle might enjoy turnip greens, mustard greens, and dandelion greens, as well as yellow squash, sweet potatoes, and grated carrots. Various fruits could also be offered as treats, and they could include blackberries, cantaloupe, raspberries, strawberries, papaya, bananas, and honeydew melon. And your turtle might even enjoy feasting on mushrooms and moss too. Overall, these turtles make good pets for experienced owners because they typically do not bite, they are small, and they are fun to observe, but they are not fond of being handled. And, even though the Florida Box Turtle does not require a companion, if you wish to keep more than one of these turtles in the same enclosure, you could do so, provided that there is enough space and there are at least two females to every one male because males will aggressively harass females in order to breed.", "facts": " 4-6\" Terrestrial turtles Pelleted commercial diet, vegetables, fruits, worms, insects High maintenance", "tags": "box turtle, common box turtle, eastern box turtle, Florida Box Turtle, ornate box turtle, turtle breed, Western Ornate Box Turtle, "}, "florida red-belly turtle": {"page_url": "https://www.petguide.com/breeds/turtle/florida-red-belly-turtle/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/09/florida-red-belly-turtle.jpg", "name": "Florida Red-Belly Turtle", "type": "turtle", "text": "The attractive Florida Red-Belly Turtle is actually a type of Cooter, and it is a popular breed for those who want to bring a turtle into their family. These pets are sociable, and even when they are shy, they will get over the shyness pretty quickly and become comfortable in their enclosure and around the people that they are familiar with. It is important to note that these turtles do get quite large, so you will need to be certain that you have enough space for this breed to thrive, whether you choose to set up your pet’s enclosure inside your home or outside in your garden. The Florida Red-Belly Turtle is actually a type of Cooter, and it is a popular breed for those who want to bring a turtle into their family. The Florida Red-Belly Turtle is found in the Okefenokee Swamp, which is located in southern Georgia. These turtles are also found westward to Apalachicola, Florida, and their range extends to the south through the Florida peninsula. You will find these turtles in lakes, sloughs, mangrove bordered creeks, marshes, ponds, rivers, and ditches. They prefer habitats where there is an abundant amount of vegetation available. Florida Red-Belly Turtles have a few distinguishing features. For example, these turtles showcase broad stripes on their carapace. These stripes are colored red, so they are hard to miss. There is also a variable red and black pattern on their plastron that is attractive and distinctive. When looking closely at these turtles, you will even notice a serrated pattern on the jaw. Also, the front of the turtle’s upper jaw features a deep notch that has a pair of cusps. These sit on each side and look somewhat like teeth. Florida Red-Belly Turtles are sociable, and even when shy, they will get over the shyness quickly. In addition to the red stripes on the Florida Red-Belly Turtle’s carapace, and the black and red patterns on the plastron, these attractive turtles also have thin yellow lines streaked across the head. One of these lines actually goes down the center of the head in between both eyes and ends close to the nose, forming a shape that looks like an arrow. Florida Red-Belly Turtles can be kept in indoor or outdoor enclosures. For the substrate, you can choose a fine gravel, a medium sized gravel, or sand. These turtles really enjoy basking, so you have to set up a basking spot in your turtle’s enclosure. You should place a heat lamp, along with a UVB light bulb, over the area where your turtle will bask. And these turtles are also strong swimmers, so they should have deep water that they can dive into and swim around in. A single adult Florida Red-Belly Turtle should be housed in a 90-gallon tank as the minimum. 100 gallons or more is preferable when it comes to how much space your turtle should ideally have. If you plan on adding additional turtles to the tank, you will need to double the tank size. A reliable and high quality filtration system should be used to keep the tank water clean at all times. In terms of temperature, you should maintain the air temperature of your Florida Red-Belly Turtle’s enclosure in the low to mid 80s. The basking temperature should be anywhere from the upper 80s to low 90s, and the water temperature can be anywhere from the low to mid 70s. If you do decide to give your turtle plenty of space in an outdoor pond, it should be fenced so that you can keep your turtle in the enclosure while also protecting him from predators. A good option would be a plastic-lined, in-ground pond that measures at least 5’x5’. This size will even be suitable for a pair of Florida Red-Belly Turtles. The Florida Red-Belly Turtle is an herbivore in the wild, so they enjoy feeding on a variety of non-toxic aquatic plants. Younger turtles can consume some insects, but they will become more herbivorous as they get older. To keep this turtle happy and healthy, you can feed your pet some commercial pelleted food designed for turtles, as well as fresh fruits, vegetables, and aquatic plants. Florida Red-Belly Turtles can be kept in indoor or outdoor enclosures. Provided that you have the space, you can house your Florida Red-Belly Turtle with others of its own kind, or you can create a community tank that includes other Cooters, Musk Turtles, Mud Turtles, Slider Turtles, Painted Turtles, and Map Turtles. As is the case with other turtle breeds that are kept as pets, it is best to get one that was captive-bred, as he will be more comfortable around people and content in his enclosure. Taking these animals out of the wild damages wild populations, and they also tend to be more skittish when placed in a captive environment, making it more likely that your turtle will try to bite or scratch you. Plus, Florida Red-Belly Turtles, like other Cooters, can be powerful, so they can destroy the tank setup that you put them in when they are not captive-bred.", "facts": " 7-13” Semi-aquatic turtle Pelleted commercial turtle diet, non-toxic aquatic plants, fruits, vegetables Moderate ", "tags": "Alabama Red-Bellied Cooter, Alabama Red-Bellied Turtle, cooter, cooter turtle, Florida Red-Belly Cooter, Florida Red-Belly Turtle, Northern Red-Bellied Cooter, Northern Red-Bellied Turtle, "}, "florida softshell turtle": {"page_url": "https://www.petguide.com/breeds/turtle/florida-softshell-turtle/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/10/florida-softshell-turtle.jpg", "name": "Florida Softshell Turtle", "type": "turtle", "text": "The Florida Softshell Turtle, like other Softshell Turtles, are unique and attractive animals that many pet owners seek when they want to add a turtle to their family. But because of their care requirements and personality, these turtles are best suited to experienced turtle owners. These turtles are powerful swimmers that need deep water, and they also grow quite large, so you will need to be sure you have the space for these pets before bringing one home. The Florida Softshell Turtle is best suited to experienced turtle owners. You can find the Florida Softshell Turtle throughout Florida, as well as north into the Coastal Plain of the state of Georgia and the southern portion of South Carolina. You can also find these turtles west to Mobile Bay in Alabama. These turtles are naturally found in large lakes like Okeechobee, large karst springs and slow-moving river channels that have plenty of vegetation, and big sinkhole ponds. You can also sometimes find these turtles in seasonal ponds. The Florida Softshell Turtle is the biggest of all of the North American Softshell Turtles. Females can grow as large as 24”, while males will be about half the size of females, growing to about 12”. The shell of a Florida Softshell Turtle will be smooth, as well as soft along the edge. The shell is covered in leathery skin. This is living tissue, and it is sensitive and vulnerable to infections and injuries. The Florida Softshell Turtle is the biggest of all of the North American Softshell Turtles. Adult Florida Softshell Turtles will usually be a dark brownish-green color, although they can also feature tan shells. The shells and their skin can feature blotches as well. Florida Softshell Turtles will only bask occasionally, and they will usually do so while they float upon aquatic plants or while they are partially under the water as they extend the rest of their body on a basking site. The best type of basking area for this turtle is not abrasive, so avoid concrete and sandstone rocks, as you don’t want to irritate the plastron. Whatever basking platform you choose to use, whether it’s natural or artificial, just make sure that it’s in a stable position and on an angle, reaching to the bottom of the tank. In this way, your turtle can easily move up the platform and choose whether to come out completely to bask or stay partially submerged. To keep your Florida Softshell Turtle healthy for many years, you need to focus on creating an environment that will provide him with filtered freshwater at all times. A high quality filter is a must, and you should stick with a sand substrate rather than rocks that would be abrasive to this turtle’s sensitive body. You will find your turtle digging into the substrate, so it should be deep enough for your pet to burrow. Because these turtles are such strong swimmers, they do well in enclosures that have deep water. The water temperature should be maintained anywhere from 70-80°F with the help of a high quality water heater. Maintain the air temperature of your turtle’s enclosure anywhere from 75-85°F. The basking area, however, should be warmer at around 90°F. Temperatures in your turtle’s enclosure can drop roughly 5° overnight, and you can let it drop an additional 5° in the winter. If you want, you can provide a hiding spot underwater for your turtle, provided that it will be safe enough that your pet won’t get trapped. Remember, these turtles are strong swimmers, so secure any underwater structures to keep them in place if your pet knocks into them. In terms of tank size, this turtle should have 5-10 gallons of water for every inch that his carapace is long. This is the minimum, so you can certainly go larger. An average adult Florida Softshell Turtle might require a 200-gallon tank, so you should have plenty of space for this pet to thrive. It is important to know that the Florida Softshell Turtle could exhibit aggressive behavior. Because Florida Softshell Turtles are carnivorous, their diet in the wild will include snails, amphibians, fish, insects, and crustaceans. They will also consume algae and aquatic plants, and they will scavenge as well as hunt. You can even find them burrowing into mud located near a shore or bank so that they can then extend their snouts to the surface in anticipation of small crustaceans, fish, and frogs. You can feed your turtle some minnows and small fish, including mosquitofish. However, you can also provide your pet with a commercial pellet diet to ensure all of his nutrient requirements will be met. Just be aware that these animals are more attracted to live food, so you should use both types of food. It is important to know that the Florida Softshell Turtle could exhibit aggressive behavior. Even when housed with other Softshell Turtles, they can injure each other, so it is best that they be housed alone. Also, these turtles should only be handled when absolutely necessary.", "facts": " 12-24” Aquatic Commercial turtle diet, small fish, insects, non-toxic aquatic plants High Maintenance", "tags": "Florida Softshell Turtle, Smooth Softshell Turtle, softshell turtle, Spiny Softshell Turtle, turtle, turtle breed, "}, "greek tortoise": {"page_url": "https://www.petguide.com/breeds/turtle/greek-tortoise/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/10/greek-tortoise.jpg", "name": "Greek Tortoise", "type": "turtle", "text": "Also referred to as the Spur-Thighed Tortoise, the Greek Tortoise enjoys a varied wild range because there are actually a few subspecies of Greek tortoises. These include the North African Greek Tortoise, the Ibera Greek Tortoise, the Libyan Greek Tortoise, the Golden Greek Tortoise, and the Tunisian Greek Tortoise. In the course of the last few decades, a lot of Greek Tortoises were imported to the United States and then sold in the pet trade. Most were Golden and Ibera tortoises, and many had diseases and parasites, so they didn’t survive long. However, those that were given proper medical care were able to thrive and continue living in captivity. Offspring was produced from that original stock, and some of those tortoises were able to grow and produce more offspring. Captive-bred Greek Tortoises have since become a popular choice for pet owners. The Greek Tortoise is also referred to as the Spur-Thighed Tortoise. The range for Greek Tortoises includes Turkey, the Middle East, Sardinia, southern Spain, southwest Asia, and North Africa. They prefer grassland, rocky hillsides, forests, Mediterranean scrub land, meadows, fields, semi-desert environments, and coastal dunes. The Greek Tortoise features a carapace that is highly domed, and it joins a plastron that is singe-hinged. On either side of this tortoise’s tail, on each of the thighs, you will find anywhere from one to three spurs. You will also notice overlapping, large scales that cover the fronts of the tortoise’s forelimbs. The head will be blunt, the eyes will be large, the five claws on each foot will be strong, and the supracaudal shield that is found just above the animal’s tail will be undivided. When looking at a Greek Tortoise, you will also note the many spots, rays, borders, and flecks that are found on the shell. These form a pattern a lot like that found in a Greek mosaic. Greek Tortoise can be interactive, friendly, and easygoing. The color of a Greek Tortoise’s carapace could be anywhere from tan or yellow with dark brown or black blotching, to completely black or gray. The plastron could be greenish-yellow to yellow, or it could be gray or brown, and it will also feature some black or dark brown markings. This tortoise’s limbs, tail, and neck can be gray to yellowish-brown in color. The head will be brown to yellow in color, but it can also be black or gray, and it might feature dark spotting. Southern Greek Tortoises should be housed in an enclosure with a temperature set at a minimum of 80°F. Their basking area should be 95-100°F. If your Greek Tortoise is one of the northern types, he will want to hibernate if the temperature falls too much for too long, so you should keep the temperature within a range of 75-90°F. Make sure that one end of your pet’s enclosure is kept warm for basking, while the opposite end is cooler. It is best to house this tortoise in a safe outdoor enclosure that is made to appear as natural as possible. When the weather is warm, you can keep your tortoise in a large enclosure with plants and edible vegetation, making sure the enclosure is exposed to plenty of sunlight. If you choose to keep your Greek Tortoise indoors, you will need to build a tortoise table. If you have a single adult tortoise, or a pair of adults, you can use a 3×6’ table constructed of plywood. It is best to stick with wood instead of glass or plastic, as the wood will prevent your tortoise from being able to see through the enclosure’s border and will be less inclined to try to escape. The bigger you can make your tortoise pen, the better, as that will help reduce stress and allow your tortoise to behave more naturally. If you are going to house your tortoise indoors, you will need to set up a UVA/UVB light. In terms of substrate for indoor enclosures, good options include aspen shavings, cypress mulch, or a mix of play sand and topsoil (50/50 mix). Avoid pine and cedar beddings because they are toxic. Occasionally mist your tortoise’s enclosure with clean water. The humidity should remain low at around 30-50%. The color of a Greek Tortoise’s carapace could be anywhere from tan or yellow with dark brown or black blotching, to completely black or gray. Greek Tortoises are herbivores that like to graze on edible plants in their environment, so you can offer your pet weeds, such as clover, dandelion, hawkbit, wild strawberry, cat’s ear, thistle, and plantain. You can replace these with dried organic herbs in the winter. You can also give your turtle natural hays and grasses, as well as dark, leafy greens, such as kale, turnip, mustard, and collard greens, and you can also occasionally offer some fruit. To provide your tortoise with all of the nutrients his body needs, you can feed your pet a commercial tortoise diet in moderation. Also give your pet a calcium supplement, such as a cuttlebone. Although a lot of the Greek Tortoise subspecies come from arid environments, some are naturally found in temperate regions. Regardless of where your Greek Tortoise is from, you will need to be sure he remains hydrated, so provide a shallow water dish that is filled with clean water for soaking and drinking at all times. Change and clean this water dish frequently. Greek Tortoises that are found to the north of the Mediterranean Sea will be more tolerant to colder conditions and will typically hibernate according to the weather. However, those tortoises that are found south of the Mediterranean Sea and in the Middle East do not have as much tolerance to the cold and typically will not hibernate. Be aware that putting more than one male Greek Tortoise in the same enclosure could result in fights, especially if you also have a female present. Don’t expect that your tortoise will enjoy being held, so only pick up your pet when necessary. However, these tortoises will become responsive to your presence, and they are known for walking over to you when you have food. These tortoises can be interactive, friendly, and easygoing, especially when they are provided with a healthy environment and when they aren’t stressed.", "facts": " 5-8” Terrestrial Commercial tortoise food, organic dried herbs, weeds, dark leafy greens, natural hays and grasses  Intermediate Maintenance", "tags": "Egyptian Tortoise, Golden Greek Tortoise, greek tortoise, Hermann’s Tortoise, Ibera Greek Tortoise, Libyan Greek Tortoise, North African Greek Tortoise, Russian Tortoise, Spur-Thighed Tortoise, tortoise, tortoise breed, Tunisian Greek Tortoise, "}, "hermann’s tortoise": {"page_url": "https://www.petguide.com/breeds/turtle/hermanns-tortoise/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/11/hermanns-tortoise.jpg", "name": "Hermann’s Tortoise", "type": "turtle", "text": "The Hermann’s Tortoise is a popular breed that makes a great pet. These animals have wonderful personalities and they can develop a bond with their owners. You’ll even notice differences in personality and preferences from one individual tortoise to another, as each one has its own likes and dislikes. As with any other turtle or tortoise breed, the Hermann’s Tortoise should be purchased from a reputable breeder who can guarantee that the animal was born in captivity, as doing so will help maintain their wild populations. The Hermann’s Tortoise is a popular breed that makes a great pet. Hermann’s Tortoises are actually split up into eastern and western subspecies, both of which can be attained as pets in the US. The eastern subspecies is naturally found in wild habitats throughout western Turkey, eastern Italy, Greece, and the Balkans. The western subspecies, on the other hand, is naturally found throughout southeast France, northeast Spain, southern or western Italy, Corsica, Sicily, Sardinia, Minorca, and Majorca. These tortoises live in a climate that is typically moist throughout the spring and the autumn but dry during the summer. They prefer Mediterranean forests, but a lot of their habitat has disappeared. As a result, you can now find these animals living throughout dry meadows, farmland, rocky slopes, and arid hillsides. They like areas that provide resting places where they can hide, and areas where they can easily find shade. They generally avoid moist areas. The Hermann’s Tortoise is one of the most attractive of the tortoise breeds. The shell of this species is domed, and the upper jaw is slightly hooked. The mouth does not contain any teeth; instead, there is a strong beak. The tail features a spur at the tip, and adult males will have tails that are distinctly thick and long, along with a spur that is well-developed, making them easy to identify from females. The Hermann’s Tortoise is one of the most attractive of the tortoise breeds. One of the most distinctive features of the Hermann’s Tortoise is its orange-yellow shell, which also has black markings. You will notice that the head is black or brown in color, but the chin might sometimes be a lighter hue. There is often a yellow spot found on either side of the head as well. This tortoise’s scaly limbs will be anywhere from brown to gray, and they will also have some markings that are yellow. You can house your Hermann’s Tortoise outside during the warmer months of the year, but be aware that these animals are active and they do like climbing and burrowing, so the enclosure will have to be secured properly and it should be large. Use soft soil so that your tortoise can comfortably walk around the enclosure and burrow, but make sure the barriers to the enclosure are dug deep into the ground so you pet won’t tunnel his way out. An outdoor enclosure should provide cooler and warmer spots throughout it. There should also be an elevated area that is well-drained, several shaded places, and sections that are fully exposed to the sun. Hermann’s Tortoises can also be housed indoors, as they prefer temperatures that are above 70°F. Your indoor enclosure needs to include a heat lamp and UV light, and the temperature should be maintained around 80°F during the day, but it can drop to around 75°F at night. There should also be a substrate that consists of sand and mixed compost, and it should be around 2” deep. In terms of size, you can house your pet in an enclosure that is 36”x16” or larger. There should a cool and shaded area in your tortoise’s indoor enclosure, along with a bright and warm area where he can bask. The basking area can be anywhere from 90-95°F. You can also provide boxes or hollow logs that will create some hiding places. Whether you are housing your tortoise indoors or outside, provide a tray of fresh, clean water at all times. This tray needs to be big enough so your pet can soak in it, but it also needs to be less than 4” deep. Humidity within the enclosure can be anywhere from 40-75%. Hermann’s Tortoises will hibernate when the temperature drops to around 40-50°F. In the wild, these animals will hibernate for around four to five months between October and April. For captive turtles, recommended hibernation length is around three months for adults. However, because it’s hard to replicate the conditions that would provide safe hibernation and aestivation, you can simply maintain your pet’s habitat at a moderate temperature all year long to keep him active. Hermann’s Tortoises are popular because they are passive and gentle. The Hermann’s Tortoise is mostly herbivorous. In the wild, they prefer feasting on plants but will occasionally consume invertebrates like snails and worms. Don’t feed your Hermann’s Tortoise meat, and it is best to avoid feeding him peas and beans as well. These animals need a diet that is low in phosphorous and high in calcium. You can ensure your pet is getting the right amount of calcium by leaving a cuttlebone in his enclosure at all times. This tortoise will do well with a diet that consists of plenty of leafy greens. You can feed your pet non-toxic flowers, weeds, and clover, along with hibiscus, grass, wild lupine, romaine, endive, chickweed, watercress, dandelion, plantain leaves, sow thistle, lilac, and rose, as a few examples. You can also give your pet a variety of vegetables, such as carrots, bell peppers, and squash, and small amounts of fruit, such as strawberries, bananas, apples, and figs. Supplement this diet with a high quality vitamin for tortoises to prevent deficiencies. You can also provide your pet with a commercial pelleted diet for tortoises. Hermann’s Tortoises are popular because they are passive and gentle, but they could get scared if they are kept off the ground for too long. So if you are going to handle your pet, make sure that his feet are supported. You can pet your tortoise and hand feed him. These animals are smart and they will recognize you and respond to you being near them.", "facts": " 6-11” Terrestrial Commercial pelleted diet for tortoises, leafy greens, vegetables, fruits Low Maintenance", "tags": "european tortoise, greek tortoise, Hermann’s Tortoise, Kleinmann's Tortoise, Marginated Tortoise, mediterranean tortoise, Russian Tortoise, tortoise, tortoise breed, turtle, turtle breed, "}, "loggerhead musk turtle": {"page_url": "https://www.petguide.com/breeds/turtle/loggerhead-musk-turtle/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/11/loggerhead-musk-turtle.jpg", "name": "Loggerhead Musk Turtle", "type": "turtle", "text": "The Loggerhead Musk Turtle is one of several Musk Turtle species. These small turtles make great pets, including for beginners. However, you should be aware that, when these animals become extremely stressed, they will end up releasing a yellowish liquid from glands that are found beneath the carapace rim. This liquid will be foul smelling, and it is their defense mechanism against predators. Nevertheless, these turtles are popular in the pet trade because they are easy to manage and they are responsive and personable. The Loggerhead Musk Turtle is one of several Musk Turtle species. You can find Loggerhead Musk Turtles throughout the southeastern portion of Alabama, from the Apalachicola River drainage to Tensaw River, as well as in Tennessee, Louisiana, Mississippi, Georgia, and Florida. These turtles prefer slow moving creeks, streams, and rivers that have a soft bottom. You can also find them in lakes and ponds. The Loggerhead Musk Turtle features a keeled carapace. When looking at these turtles, you will also notice that they have a fairly large head, and it is the size of their head that contributed to their common name. You will also note that the carapace of the Loggerhead Musk Turtle is a bit serrated. It also features lateral keels, which might go away as your turtle gets older, along with a vertebral keel. This turtle’s snout is described as tubular, and it feature barbels on its chin. Loggerhead Musk Turtles make great pets, including for beginners. The carapace of the Loggerhead Musk Turtle will be orange, dark olive, or brown, and it will also feature dark colored seams. The shell could showcase dark streaks or spots, while the body and the head of this turtle will be orange, light brown, gray, or pink and also feature dark colored markings like splotches and spots, but it might even have yellow stripes. The plastron will typically be anywhere from yellow to pink in color. This aquatic turtle breed will need a large sized tank that will allow for complete submersion and comfortable swimming. In other words, the enclosure for your Loggerhead Musk Turtle should have deep water. The minimum enclosure for this breed would be a 30-gallon tank. However, if you are going to be housing more than one turtle in the same tank, you will need to provide them with additional space. Also, even though these turtles do not bask frequently, you will need to provide an area where your pet can climb out of the water to dry off. You can create a basking area easily using a rock that projects from the water, but young turtles might also do fine with floating aquatic plants that are non-toxic. Keep in mind that these turtles are active, and they are messy eaters. Therefore, you will need to invest in a high quality filtration system that will keep the water in the enclosure as clean as possible. In terms of substrate, you can keep the bottom of the tank bare or you can opt to put down river pebbles. It is also important to maintain the temperature in your Loggerhead Musk Turtle’s enclosure. The air temperature should remain between 75-83°F, while the basking area should have a heater over it in order to ensure it reaches the mid 80s to low 90s Fahrenheit. Finally, a high quality water heater should be used to keep the water temperature anywhere from the mid to high 70s Fahrenheit. Once Loggerhead Musk Turtles become comfortable, they will be quite responsive and outgoing rather than shy. You can feed your Loggerhead Musk Turtle a high quality commercial pelleted diet that is designed for turtles. On top of that, you can also give your pet fish, worms, aquatic insects, and snails. Rest assured that, once your Loggerhead Musk Turtle becomes comfortable in your home and in his enclosure, the odds of him releasing the foul smelling liquid will be slim. Also, once these turtles become comfortable, they will be quite responsive and outgoing rather than shy. If you wish to establish a community tank with multiple turtles, Loggerhead Musk Turtles will do well with Sliders, Cooters, and Painted Turtles. They can typically live peacefully with these other species because they prefer living in deep water while the other species bask. Just make sure you provide plenty of room in the enclosure for all of the turtles to be comfortable, and all of the other species in the enclosure should grow to be roughly the same size as your Loggerhead Musk Turtle. Finally, use caution if housing multiple Musk Turtles together, as males could become aggressive. Only handle your Loggerhead Musk Turtle when it is really necessary to do so. These animals have strong jaws that can produce a painful bite when agitated.", "facts": " 3-5” Aquatic Commercial pelleted turtle diet, snails, fish, insects, worms Low Maintenance", "tags": "Common Musk Turtle, Flattened Musk Turtle, Loggerhead Musk Turtle, musk turtle, Razor-Backed Musk Turtle, Stripe-Neck Musk Turtle, turtle, turtle breed, "}, "midland painted turtle": {"page_url": "https://www.petguide.com/breeds/turtle/midland-painted-turtle/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/10/midland-painted-turtle.jpg", "name": "Midland Painted Turtle", "type": "turtle", "text": "There are four subspecies of Painted Turtle, and the Midland Painted Turtle is one of them. The other subspecies are Eastern, Western, and Southern Painted Turtles. These pets are a good option for beginner turtle keepers, as they are tame, hardy, and enjoyable to watch. The Midland Painted Turtle is a good option for beginner turtle keepers, as is is tame, hardy, and enjoyable to watch. Painted Turtles are found throughout North America, from the southern part of Canada all the way down to northern Mexico. The Midland Painted Turtle, in particular, is most highly concentrated within the Great Lakes region. You can find this turtle in states like Wisconsin, Indiana, Ohio, Michigan, Illinois, and Iowa. The Midland Painted Turtle features a classic basking style body that is a lot like the body of a Slider Turtle. Its carapace is lightly domed and smooth, the upper jaw features cusps that look like teeth, and the eyes, which are typically yellow, will have a horizontal bar that runs through the pupil. Males are generally smaller than females, and they are also less domed. They also do not showcase any signs of plastral concavity like other species of turtles. They do have front claws that are elongated, and their tails are a lot longer than the tails of females. Midland Painted Turtles have shells that can feature a range of colors. Midland Painted Turtles have shells that can feature a range of colors, from olive green to black, and there is also a noticeable vestigial vertebral stripe. This turtle’s marginal scutes might feature red stripes, blotches, or bars. The carapace scutes might have light red lines that run along the borders. In terms of skin color, the Midland Painted Turtle will typically be anywhere from light green to black. You will note broad red lines on the forearms, and the throat and head will feature yellow lines that prominently run across the face from the tip of the turtle’s mouth and nose. These yellow lines will typically transform into a red color towards the turtle’s neck. Another distinct feature is the yellow blotch or line that is often seen directly behind the Midland Painted Turtle’s eye. A single adult male Midland Painted Turtle will be comfortable in a 55-gallon aquarium as a minimum, but a single adult female will need more room, so a minimum of 125 gallons would be a good place to start. If you add more Midland Painted Turtles to your enclosure, you will have to increase the size of the aquarium tank by half. So, for example, two males would need a 75-90 gallon tank. Because these turtles enjoy basking, you will need to provide your pet with a UVB light and a heat lamp. Set up a large enough basking area that is made of flat rocks, smooth rocks, gravel, sand, dirt, driftwood, or any other platform that will be non-abrasive and support the weight of your pet. Then keep the temperature there anywhere from 85-90°F. Maintain the air temperature in your Midland Painted Turtle’s enclosure anywhere from the low to mid 80s Fahrenheit. The turtle’s water temperature should be kept in the low to mid 70s, so you should use a safe and high quality water heater. Midland Painted Turtles also enjoy swimming, so the depth of the water in an enclosure should be deep enough that they can completely submerge and swim around. Hatchlings will do well in shallower water of about 4-6 inches, but the water should be much deeper for juveniles and adults. Make sure that the water is always clean and filtered, and provide spots underwater where the turtle can stop and rest. In terms of aquatic substrate, it is optional. You can keep the bottom of the turtle’s enclosure bare, or you can add sand, fine-to-medium sized gravel, or river rock. Midland Painted Turtles are a good option for pet owners who are new to keeping turtles in their homes. This is an omnivorous turtle species, so a well-rounded diet is key. You can provide your pet with a commercial turtle diet, along with feeder fish, shrimp, and non-toxic aquatic plants like water hyacinth, water lilies, water lettuce, duckweed, pondweed, hornwort, frogbit, water milfoil, water starwort, and water fern. These turtles will also enjoy eating vegetables, such as squash, beet leaves, collard greens, zucchini, romaine, endive, kale, mustard greens, dandelions, escarole, and red leaf lettuce. You can even provide your pet with some fruit, and Midland Painted Turtles will like feasting on bloodworms, mealworms, and crickets too. Midland Painted Turtles are a good option for pet owners who are new to keeping turtles in their homes. These animals are hardy, and they are also tame when they are around people, so they will not always be hiding or running away when you come near their enclosure like so many other turtles do. If you want to house more than one turtle together, Midland Painted Turtles do well in communities with other Painted Turtle species, as well as other turtles from the same region that they are from. They should all be of comparable size, and each turtle should have plenty of space. However, you must keep an eye out for aggressive behavior, even in spacious enclosures.", "facts": " 5-9” Semi-aquatic Commercial turtle diet, non-toxic aquatic plants, vegetables, fruits, insects, fish, shrimp, worms Low Maintenance", "tags": "eastern painted turtle, Midland Painted Turtle, painted turtle, painted turtle breeds, Southern Painted Turtle, turtle breed, Western Painted Turtle, "}, "mississippi map turtle": {"page_url": "https://www.petguide.com/breeds/turtle/mississippi-map-turtle/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/10/mississippi-map-turtle.jpg", "name": "Mississippi Map Turtle", "type": "turtle", "text": "The Mississippi Map Turtle is one of 13 Map Turtle species, and it is a subspecies of the False Map Turtle. It is sometimes referred to as the “sawback turtle” because of its unique carapace, which has a ridge running down the center. Although these turtles are beautiful to look at, they can be difficult to keep as pets, especially because they can get stressed easily and they have a nervous temperament. Their water also needs to be kept as clean as possible, and they need a large enclosure, so they may not be the best choice for beginner turtle owners. Although the Mississippi Map Turtle is beautiful to look at, it can be difficult to keep as a pet. Despite their name, Mississippi Map Turtles aren’t native to Mississippi. Instead, they get their name from their habitat in the Mississippi River, which can be found in 10 states from Louisiana to Minnesota. You can see these turtles living in the wild in the Mississippi Valley, which extends from Nebraska to Illinois, as well as down into Mississippi and to Texas. They prefer lakes, large streams, and rivers that provide them with plenty of vegetation. All Map Turtles, including the Mississippi Map Turtle, get their name from the various markings and lines that are found on their carapace. These markings look a lot like the lines that are found on a map. Mississippi Map Turtles will also have a ridge of knobs that are black-tipped along their spine. The rear of the carapace will showcase a jagged edge as well. There are a few ways to distinguish a male from a female turtle of this breed. The female Mississippi Map Turtle will be larger than her male counterpart, as she will grow to be 6-10” while males will only reach 3½-5”. Females will appear bulkier, while males will be leaner like juveniles. Also, a female’s tail will be smaller than a male’s tale, and a male’s tail will have a thicker base. Plus, a male turtle will have nails on his forelegs that are a bit longer than those on a female. One of several notable features of the Mississippi Map Turtle is the head. You will notice that there is a curved line behind and under each eye on the side of the turtle’s head. There is also a line that runs down the center of this turtle’s head, between the two curved lines. Also, this turtle’s pupils will be round and bright, and there usually will not be a bar across the pupils. The Mississippi Map Turtle is sometimes referred to as the “sawback turtle” because of its unique carapace. The carapace of a Mississippi Map Turtle will usually be anywhere from a brown color to an olive color. You will easily note the patterns of orange to yellow colored semi-circles on the scutes. The pattern on the shell will be more obvious when the turtle is young, and it will fade as the turtle grows. This turtle’s plastron will be yellowish to tan in color, and it will feature brown lines that look a lot like wood grain along the edges of the scutes. Like the patterns on the carapace, these will also fade and be less obvious as the turtle ages. To keep the Mississippi Mud Turtle happy and healthy, you will need to use a high quality water filter to keep the freshwater as clean as possible. The water temperature should also be maintained with the use of a high quality water heater. Set the temperature anywhere from the low to mid 70s Fahrenheit for adults, but if you have hatchlings, the water temperature should be around 80°F. In addition to providing enough water for your turtle to swim in, you also need to give him a basking area where he can totally come out of the water and dry off. The basking temperature needs to be anywhere from the high 80s to low 90s Fahrenheit, while the air temperature can be set to anywhere from the low to mid 80s Fahrenheit. Indoor turtle enclosures will also require UVB lighting that can be on for 12 hours every day all year. If you are housing your turtle outside during the warmer months of the year, be sure to bring your pet inside when the temperature drops. These turtles will become lethargic and fail to eat right, as well as begin to go into hibernation, when the temperature dips below 60°F. A male will need an enclosure that’s anywhere from 75-90 gallons, but a female that’s 10” will need a minimum of 125 gallons. The water should be deep enough that your turtle can swim vertically and horizontally. And if you use substrate, river rocks are a good choice. The Mississippi Map Turtle is nervous and skittish that will get stressed out easily. The Mississippi Map Turtle is an omnivorous breed that will eat while swimming. These animals like consuming live foods, including earthworms, mealworms, fish, and crickets, but they will also enjoy eating vegetables that have been put in their water. Good choices include leafy greens, such as parsley, dandelion greens, and romaine lettuce. You can also feed your pet a high quality commercial diet designed for turtles to ensure all of his nutritional requirements will be met. Treats can include freeze-dried shrimp and chopped apples. These nervous and skittish turtles will get stressed out easily, so they should only be handled when it is absolutely necessary. When frightened, these turtles will escape into the water. However, they are a good choice for a community tank in which they will love with other turtles.", "facts": " 5-10” Semi-aquatic Commercial turtle diet, worms, insects, fish, vegetables, fruits, shrimp High Maintenance", "tags": "False Map Turtle, map turtle, Mississippi Map Turtle, turtle, turtle breed, "}, "mud turtle": {"page_url": "https://www.petguide.com/breeds/turtle/mud-turtle/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/11/mud-turtle.jpg", "name": "Mud Turtle", "type": "turtle", "text": "The Mud Turtle is a popular breed of turtle that is kept as a pet. They are low maintenance turtles that are a good choice for those who are beginners at keeping these animals, and they can easily be maintained in a terrarium. When deciding to bring a Mud Turtle into your family, though, you should be certain that you are purchasing one from a reputable breeder who can guarantee that your pet was bred in captivity. Taking turtles out of their natural habitat could put their wild populations in decline, and wild turtles also tend to showcase short tempers that could lead to bites from their strong jaws. Mud Turtles are a popular breed of turtles that are kept as pets. Mud Turtles make their home in ponds, as well as in bodies of water with and without vegetation, though they do prefer ponds that have a lot of vegetation. These animals can generally be found in spring-fed streams, and they prefer clean, oxygenated water. In the wild, they also prefer sandy and muddy areas, as they will hibernate by burrowing into the mud. Various species of Mud Turtles can be found throughout the United States, Central America, South America, and Mexico. Because there are so many different species of Mud Turtles, their appearance will vary a bit. Generally, though, these are small turtles that are similar to Musk Turtles. However, they are even smaller than Musk Turtles, and their carapace isn’t domed as high. Instead, the shell of a Mud Turtle will be oval. Also, Mud Turtles will have one or two hinges on the plastron. Therefore, they have the ability to tightly close their shell. And these turtles will feature glands that are located on the sides of the body. These could release a foul smelling fluid when these animals are stressed. Male Mud Turtles will be larger than their female counterparts, and they will also feature a larger tail, larger legs, and a larger head. The tail of males will showcase a bony spine, and the male has scaly, rough patches on the insides of the legs as well. The low maintenance Mud Turtle are a good choice for those who are beginners. Again, there are many different species of Mud Turtles. To give you an idea of how their appearance is similar but with minor differences, let’s focus on four of the more popular breeds: the Eastern Mud Turtle, the Mississippi Mud Turtle, the Striped Mud Turtle, and the Yellow Mud Turtle. The Eastern Mud Turtle will have a dark shell that is olive brown in color and does not feature any kind of pattern, but the plastron will be yellow. The Mississippi Mud Turtle is very similar, but you will notice that there are a couple of light colored lines on the turtle’s head, extending from the tip all the way back to the shell. These can be pale yellow or deep tan. The Striped Mud Turtle is easy to recognize because the coloring is different. You will quickly note that there are three stripes that are light in color and run vertically on the shell. There is also one stripe in between the eyes. These stripes can be yellow, gold, or tan. Finally, the Yellow Mud Turtle can be recognized by its head and neck, which feature yellow extending from the shell to the chin. To keep your Mud Turtle happy and healthy, he will need enough space. If you are planning on housing one or two Mud Turtles, you should have a minimum of a 40-gallon tank (more space is preferred). You will need to clean this enclosure, which should provide adequate space for your turtle to swim comfortably, frequently. Mud Turtles will need to bask, so you should set up a basking area within the enclosure. A heat lamp should be placed above the basking site, and it should be set to around 90°F. The rest of the enclosure should be maintained anywhere from 80-85° and should not go below 70°F. And in addition to the basking temperature, you will also need to use a high quality water heater to maintain the temperature anywhere from 70-75°F. For substrate, you can simply place gravel along the bottom of your pet’s tank. You will also need to set up a UVB light that you can place over your turtle’s enclosure and keep on for half of the day. Mud Turtles can do well in a community tank with fellow Mud Turtles, as well as with Musk Turtles. You can feed your Mud Turtle a commercial pelleted diet for turtles, along with vitamin and calcium supplements, to provide a foundation for good health through proper nutrition. Because Mud Turtles are omnivorous, they will eat a variety of foods, including snails, insects, fish, various worms, and dark leafy greens. Mud Turtles can do well in a community tank with fellow Mud Turtles, as well as with Musk Turtles. You should only handle your turtle when it is necessary to do so, as these turtles can bite and hurt you if they become stressed or frightened. Also, like Musk Turtles, they will release a liquid from their anal glands as a defense mechanism. This will be foul smelling, so you want to avoid it by keeping your turtle relaxed and comfortable.", "facts": " 5\" Semi-aquatic Commercial pelleted turtle diet, snails, fish, insects, worms, dark leafy greens Low Maintenance", "tags": "eastern mud turtle, mississippi mud turtle, mud turtle, musk turtle, striped mud turtle, turtle, turtle breed, yellow mud turtle, "}, "north american wood turtle": {"page_url": "https://www.petguide.com/breeds/turtle/north-american-wood-turtle/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/11/north-american-wood-turtle.jpg", "name": "North American Wood Turtle", "type": "turtle", "text": "The North American Wood Turtle is a good choice for pet owners who have never kept a turtle before. This is a popular turtle breed, thanks to its friendliness, its endearing personality, and the fact that it is tame and easy to handle. When choosing to bring a North American Wood Turtle into your family, just be sure that you purchase one from a reputable breeder who can guarantee that the animal was born in captivity. In this way, wild populations of these turtles can be preserved. The North American Wood Turtle is a good choice for pet owners who have never kept a turtle before. You can find the North American Wood Turtle throughout the northeastern portion of the United States and all the way down to the northern part of Virginia, as well as north into southern Nova Scotia. This turtle’s range also extends northwest all the way to the eastern portion of Minnesota and the northeastern portion of Iowa. These animals can even be found as far north as the southern portion of Quebec. Some of the other states where these turtles make their home include Maryland, Pennsylvania, Connecticut, Delaware, New Jersey, Michigan, Ohio, New York, Massachusetts, Vermont, New Hampshire, Ohio, Illinois, Wisconsin, Indiana, and Maine. North American Wood Turtles prefer slow moving, cold water that does not have strong currents. They also prefer water that is unpolluted and shaded. They will, however, also roam on the land near streams in search of food and sites to lay eggs. These turtles will also hibernate during the winter season. They will do so beneath the water in large streams and rivers. One of the distinct features of the North American Wood Turtle is the chiseled pattern on the shell, which also typically features a raised line dividing the carapace vertically. When these turtles are fully grown, they will have feet that are slightly webbed, but they will be strong swimmers. Their tail will also be rather thick. The North American Wood Turtle is a popular turtle breed, thanks to its friendliness, its endearing personality, and the fact that it is tame and easy to handle. The North American Wood Turtle’s carapace will be brown to olive green in color. The plastron is typically brown or yellow, and it will feature dark colored splotches. The head and the limbs, on the other hand, will be dark brown or black with red, orange, or yellow colors coming from the underside of the limbs and neck. When it comes to North American Wood Turtles, an outdoor enclosure is best. Just be sure that you provide your pet with an aquatic environment, as well as room on land, as he will need a mix of both. And you should also take steps to properly secure your turtle’s outdoor enclosure from predators. You also want to be sure that the enclosure is built in a way that will prevent your turtle from escaping by climbing or digging his way out. One adult will do well in an enclosure that is 5’x5’ large and has a high quality filtration system to keep the water clean. If you are planning on housing more than one adult in the same enclosure, you should provide an additional 4 square feet of room for each adult. Also, an adult North American Wood Turtle will need to have a minimum of 2 feet of water that remains under 70°F. These turtles could overheat easily, and that could be fatal. Provide your pet with shade to remain cool at all times, but there should be a basking area and exposure to UVB light in the enclosure as well. For substrate, you can use topsoil, and if you have more than one adult turtle in the same enclosure, provide sight barriers to prevent fighting or unwanted breeding. Ideally, indoor housing will only be temporary. For example, hatchlings and juveniles can be indoors until they grow to roughly 5” in length. Air temperature should be anywhere from 70-80°F, while the basking area should be around 85°F. The water temperature should be anywhere from 60-69°F. You can keep the North American Wood Turtle with other types of Wood Turtles, as well as Sliders and Box Turtles. These omnivorous turtles will eat just about anything. In addition to a commercial pelleted turtle diet, they will enjoy feasting on various worms, insects, fruits like raspberries, strawberries, and blueberries, crickets, romaine lettuce, carrots, and leafy greens. These personable turtles can be kept in a community tank but there should not be more than one male in a single enclosure. You can keep the North American Wood Turtle with other types of Wood Turtles, as well as Sliders and Box Turtles. One of the most popular features of this particular turtle breed is the fact that you can pick up and handle your pet, thanks to its tame and friendly disposition. So if you are in search of a turtle that you will be able to handle without having to just view your pet from outside his enclosure, the North American Wood Turtle can be a good choice. Just be sure to handle your pet with care at all times.", "facts": " 7-9” Semi-aquatic Commercial pelleted turtle diet, worms, crickets, insects, leafy greens, vegetables, fruits Low Maintenance", "tags": "black wood turle, Brown Wood Turtle, Central American Wood Turtle, north american wood turtle, turtle, turtle breed, wood turtle, "}, "northern map turtle": {"page_url": "https://www.petguide.com/breeds/turtle/northern-map-turtle/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/10/northern-map-turtle.jpg", "name": "Northern Map Turtle", "type": "turtle", "text": "The Northern Map Turtle is also referred to as the Sawback Turtle. Although these animals are popular as pets, they are demanding in their care and are one of the most difficult turtle species to keep in captivity. In the wild, these turtles are found in areas where water is always moving, such as in large streams or rivers, so when they are kept in an aquarium, Map Turtles become prone to a fungal or bacterial infection known as shell rot. Therefore, if you are planning on keeping a Map Turtle as a pet, you need to make cleanliness the priority. The Northern Map Turtle is also referred to as the Sawback Turtle. There are actually 13 species of Map Turtles, and their natural habitat is found in North America. They are mostly found in the eastern half of the United States, but their range extends north into the southern part of Canada as well. Map Turtles typically make their home in large bodies of water, including lakes and rivers. This semi-aquatic turtle species will leave the water to lay eggs and bask in the sunshine, so it prefers areas that provide plenty of basking space, such as fallen trees and rocks. You can even find these turtles basking together as a group. Larger adults can often be found in deeper water that has less vegetation, and they will also be found basking at a greater distance from shore. These turtles will also prefer slow-moving, deep bodies of water when they are ready to hibernate over the winter. Northern Map Turtles got their name from the fact that their carapace has a design that looks like a map, or like the waterways that are drawn on a map. These lines could fade as a turtle gets older. When looking at a Northern Map Turtle, you will also notice that there are thicker lines on the limbs and the face. Females are a few inches larger than the males, and they are also typically the more dominant, and more aggressive, gender in this species. However, males will feature longer claws on the front legs. Northern Map Turtles are one of the most difficult turtle species to keep in captivity. The lines that are found on a Northern Map Turtles carapace are typically orange or yellow in color, though there will be darker colors, including varying shades of brown and green, also found between the brighter colored lines. Also, the lines that are found on this animal’s face and limbs are often a bright yellow color, so they can be more noticeable than the lines on the shell. These freshwater turtles will need a large outdoor enclosure or a large indoor aquarium tank in which they can swim comfortably and have places to hide. In addition to hiding places underwater, you will also need to provide your pet with a basking area above the water. Just make sure that the hiding places are safe so your turtle won’t get stuck underwater and drown. And make sure that the basking area allows the turtle to dry completely. The basking temperature should be set anywhere from 84-94°F, while the water temperature should be 72-80°F. There should also be a UVB lamp set up over the indoor enclosure, while outdoor enclosures should be exposed to sunlight. A long 20-gallon aquarium can work well, but make sure the water is kept as clean as possible with a high quality filtration system. Even if your turtle is placed in an outdoor enclosure, make sure there is filtration and the water is kept moving. It is also a good idea to regularly check the pH level of the water in your turtle’s enclosure, making certain that it is anywhere from neutral to slightly alkaline. If you’d like to add aquatic plants to your turtle’s enclosure, floating varieties, such as duckweed, water hyacinth, and water lettuce, are good options. Like other aquatic turtle breeds, the Northern Map Turtle does not enjoy being handled or held. Northern Map Turtles are omnivorous, and because they have better mobility when they’re in the water, they should be fed while underwater. What you feed your pet will depend upon the turtle’s gender. Because males are smaller, they will enjoy smaller prey, such as aquatic insects and small crustaceans, while females can have snails and clams. You can feed your Northern Map Turtle a commercial turtle diet, as well as dead mealworms or frozen shrimp that have been thawed, both of which can be purchased from a pet store. And you can even provide your pet with dark leafy greens placed on the basking area above water, or you can float the plant matter in the water. Another option would be to grow aquatic plants naturally in your turtle’s outdoor enclosure. Like other aquatic turtle breeds, the Northern Map Turtle does not enjoy being handled or held. Therefore, only handle your turtle when it is absolutely necessary. If you are planning on housing more than one Northern Map Turtle in the same enclosure, be sure to give them enough space and enough food, and monitor their behavior for possible aggression.", "facts": " 4-10” Semi-aquatic Commercial turtle diet, insects, mealworms, dark leafy greens, non-toxic aquatic plants, shrimp High Maintenance", "tags": "map turtle, Northern Map Turtle, painted turtle, sawback turtle, semi-aquatic turtle, turtle breed, "}, "northern red-bellied turtle": {"page_url": "https://www.petguide.com/breeds/turtle/northern-red-bellied-turtle/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/10/northern-red-bellied-cooter.jpg", "name": "Northern Red-Bellied Turtle", "type": "turtle", "text": "The Northern Red-Bellied Turtle is also referred to as the Northern Red-Bellied Cooter. There are three distinct breeds of red-bellied turtles, and they are isolated from one another geographically. However, they all have broad red stripes on their carapace, along with a varied red and black pattern on their plastron. Northern Red-Bellied Turtles are also referred to as Northern Red-Bellied Cooters. These turtles are usually found in freshwater bodies of water, such as ponds, creeks, streams, lakes, and rivers that also provide basking areas and a soft substrate that is used for hibernating. However, these turtles can also survive in brackish water. The Northern Red-Bellied Turtle prefers permanent ponds with a lot of vegetation. It is found in states ranging from New Jersey to North Carolina, although it has also been found in Massachusetts. The plastron of a Northern Red-Bellied Turtle is hingeless, and it is also a bit smaller than the carapace. Northern Red-Bellied Cooters can be differentiated from Pond Cooters and River Cooters because they feature a serrated pattern on the jaw. They also have a deep notch in the front of their upper jaw, and the upper jaw will feature a cusp on either side as well. Don’t expect to hold or handle a Northern Red-Bellied Turtle because these animals are generally shy. The Northern Red-Bellied Turtle features a carapace that is brownish in color but also features a red pattern, and you will often note a broad red line on every marginal scute. Some females can be almost completely black in color. Also, the underside of the marginals will range from yellow to red, and you will notice black spots. This area will often showcase a more intense color when compared to the plastron. The bridge, too, will have a black bar or a few black spots. In young turtles, the plastron will be red or orange, and it will feature a dark pattern along the seams, but it will fade as the turtle grows. This turtle’s head will be a dark brown color and will feature light stripes that are thin and yellow. A distinct streak is seen running down the middle of the top of this turtle’s head, in between the animal’s eyes. This line comes to an end near the nose so that, when the lines join together, they form what looks like an arrow. You can house your Northern Red-Bellied Turtle in an indoor aquarium or in an outdoor pond. Either way, the water must be kept clean with the help of a high quality filter, and these turtles prefer their water to be clear. The depth of the water should be around 1-2 feet or more for an adult turtle, as you want to give these strong swimmers a chance to completely submerge and swim around. Northern Red-Bellied Turtles really enjoy basking, so you will also need to provide areas where your turtle can bask and rest. You should provide your pet with a solid basking platform that is large enough to hold him comfortably and allow his body to dry off completely. A light source that provides UVB rays should also be set up if your pet will be kept indoors. Outdoor enclosures should provide your pet with UVB from the sun. The basking site’s temperature should be around 85°F, while the water temperature should remain around 75°F. To keep the water temperature ideal, you can use a high quality water heater. If you are going to keep your turtle outside, make sure that he will be in a fenced outdoor pond that will prevent predators from harming your pet. A plastic-lined, in-ground pond that measures around 5×5’ or more will work for a pair of cooters, as long as they don’t show aggression. For basking, you can line the edges of the pond with smooth rocks. The Northern Red-Bellied Turtle features a carapace that is brownish in color but also features a red pattern. Northern Red-Bellied Turtles are mostly herbivorous when they are adults, but they will follow an omnivorous diet while they are young. They will enjoy feasting on insect larvae, worms, fish, crustaceans, and aquatic plants. Herbivorous adults can be fed greens, such as romaine lettuce, but you can also provide your pet with non-toxic aquatic plants, such as duckweed, arrowhead, and coontail. Hydrilla and water hyacinth are also good options, and Northern Red-Bellied Turtles will even enjoy pickerelweed and water lilies. So whether you are keeping your pet in an outdoor pond or an indoor aquarium, consider growing aquatic plants in their enclosure, if possible. You should also provide your Northern Red-Bellied Turtle with a calcium supplement. A cuttlebone is a good option because your turtle can chew on it as he pleases. And you can also give your turtle a commercial diet that will ensure all of his nutritional needs are met. While you can house more than one of these turtles in the same enclosure, just make sure that they don’t show any signs of aggressive behavior towards one another. Even if you have a male and female together, the male might harass the female. Don’t expect to hold or handle a Northern Red-Bellied Turtle because these animals are generally shy and will hide when they are scared, often diving into the water when they are frightened. ", "facts": " 10-12.5” Semi-aquatic Commercial turtle diet, non-toxic aquatic plants, and leafy greens as herbivorous adults. Plants, worms, insects, and fish as omnivorous juveniles. Low Maintenance", "tags": "Northern Red-Bellied Cooter, Northern Red-Belly Turtle, Red-Bellied Cooter, Red-Bellied Turtle, Red-Belly Cooter, Red-Belly Turtle, semi-aquatic turtle, turtle, turtle breed, "}, "razorback musk turtle": {"page_url": "https://www.petguide.com/breeds/turtle/razorback-musk-turtle/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/10/razorback-musk-turtle.jpg", "name": "Razorback Musk Turtle", "type": "turtle", "text": "The Razorback Musk Turtle is the biggest type of Musk Turtle. It is a species that is nearly entirely aquatic, but these turtles will come out of the water to bask occasionally. Also, because they even walk along the bottom of their tank, they are a delight to watch. The Razorback Musk Turtle is the biggest type of Musk Turtle. The Razorback Musk Turtle is found in areas throughout the United States. The states where these turtles are found include Arkansas, Oklahoma, Texas, Mississippi, Florida, and Louisiana. These turtles prefer swamps and slow-moving rivers. They can also be found in streams and in shallow ponds that have a lot of vegetation. Razorback Musk Turtles feature a bulbous, large head and a long neck. They also have a noticeably sharp beak, along with short legs. And these turtles feature a sharp keel that runs down the center of their shell and for the whole length of their shell. It is this keel that gives this turtle breed its name. Baby Razorback Musk Turtles will showcase a tan or cream color with brown spots on the shell and body. As these turtles grow, their shell starts to darken into a brown color, and there will be darker rings around your pet’s scutes as well. The body will turn into a gray color, and there will be spots on the legs and head. Baby Razorback Musk Turtles will showcase a tan or cream color with brown spots on the shell and body. Because the Razorback Musk Turtle spends a lot of time in the water, you will need to provide your pet with an enclosure that has enough water for your turtle to completely submerge, swim, and walk around on the bottom of the tank. However, baby turtles can do well in water that is quite shallow at just 4-6” deep. At a minimum, a 30-gallon aquarium tank will give your pet the room that he needs. However, if you are planning on housing more than one turtle in the same tank, you will need to increase the size of the tank to accommodate each additional turtle. As active animals, Razorback Musk Turtles will appreciate and use all of the space that you can give them. Also, even though these turtles do not bask frequently, you will need to set up a basking area, complete with UV light and heat lamp, in your pet’s tank. You can create a basking spot by using a rock that projects from the water, or you can even use floating aquatic plants. Set the temperature in the basking area anywhere from the mid 80s to low 90s Fahrenheit, whereas the rest of the air temperature in the tank should be 75-83°F. Your Razorback Musk Turtle will also benefit from a substrate consisting of smooth river pebbles or sand, as he will spend time walking on the bottom of his tank, in addition to swimming. And because these turtles can be messy eaters, you will need to have a strong and high quality water filtration system in place. Set the water temperature to the mid to high 70s Fahrenheit. Adding non-toxic aquatic plants and rocks will give these shy turtles places to hide and will also provide them with a sense of security. This is especially helpful if your turtle is young. In addition to ensuring you provide your pet with a well-planted aquarium, you can also set up ceramic plant pots, rocks, bogwood, and other hiding places underwater. The Razorback Musk Turtle is shy, and might even be the shyest of all of the Musk Turtles. You can feed your Razorback Musk Turtle a high quality commercial pelleted diet for turtles. Supplement the commercial diet with feeder fish, crickets, roaches, mealworms, bloodworms, and earthworms. You can also follow their wild diet and provide your turtle with snails, mussels and aquatic insects, as well as non-toxic aquatic plants like duckweed. The Razorback Musk Turtle is shy, and might even be the shyest of all of the Musk Turtles. Also, even though these turtles are not the type to bite you, you should only handle them when it is necessary to do so. When they are provided with enough space, Razorback Musk Turtles will do well in a community tank. You can house these turtles with Sliders, Cooters, and Painted Turtles. These species will often live together peacefully, particularly if they are all around the same size. If you are planning on housing more than one Musk Turtle in the same tank, be careful that they do not show aggression towards one another.", "facts": " 5-6” Semi-aquatic Commercial pelleted diet for turtles, insects, non-toxic aquatic plants, worms, fish Low Maintenance", "tags": "Common Musk Turtle, Flattened Musk Turtle, Loggerhead Musk Turtle, musk stinkpot, musk turtle, musk turtle breed, Razorback Musk Turtle, stinkpot, stinkpot turtle, Stripe-Necked Musk Turtle, Stripenecked Musk Turtle, turtle, turtle breed, "}, "red footed tortoise": {"page_url": "https://www.petguide.com/breeds/turtle/red-footed-tortoise/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/10/red-footed-tortoise.jpg", "name": "Red Footed Tortoise", "type": "turtle", "text": "The Red Footed Tortoise is one of the most popular tortoise breeds kept as pets. These pets are easy to find, as large-scale breeding is available in the United States, and you can acquire captive-bred Red Footed Tortoises from a variety of sources, including reptile expos, breeders, and pet stores. Pet owners also like the Red Footed Tortoise because these animals are easy to care for. Their size is easy to handle, and they’re beautiful to look at, thanks to the lovely colors on their shells, legs, and head. They also have a curious personality, and they’re a good choice for beginners. The Red Footed Tortoise is one of the most popular tortoise breeds kept as pets. The Red Footed Tortoise is found in grasslands, savannah, and dry forest areas. However, they might also be seen in rainforests that are located near open habitats. These animals are native to southern Central America, as well as much of South America. The Red Footed Tortoise features a carapace that’s oval, a relatively small head, and large eyes. Also, the carapace is fairly highly domed, and the scutes might be raised or smooth. The marginals will appear as those they’re tucked under the sides, but will also flare a bit over the limbs. You’ll even notice growth rings that are evident as your tortoise grows, but these could become smooth as your pet ages. The skin of the Red Footed Tortoise is mostly black. The carapace will be gray, black, or brown. There will also be small areas of tan or yellow coloring that surrounds or covers every bump on the carapace. You’ll also notice that there are a few bright red scales or marks on the lower jaw and head of this tortoise. The tail and the legs usually have scales or patches that are yellow, red, or orange. This tortoise’s plastron will be black, brown, or a dull yellow color. Pet owners like the Red Footed Tortoise because these animals are easy to care for. The enclosure for your Red Footed Tortoise will need to have sturdy walls that are a minimum of 16” above the ground. The walls should also be a few inches below the ground in order to discourage and prevent your tortoise from trying to dig his way out. Don’t use fences or walls that your tortoise will be able to see through because he’ll try to escape if he can see what’s on the other side. If you have a young Red Footed Tortoise, you can raise him indoors, especially if the outdoor conditions aren’t tolerable. Overall, outdoor enclosures are preferred for adults, as long as the temperatures are acceptable. When outside, these tortoises are tolerant to high temperatures if they have shaded spots and access to water. They can also handle cooler temperatures down to 45°F, but you should provide a heated hiding box that’s in the 70s Fahrenheit, especially at night. When housing this tortoise indoors, it’s best to utilize a tortoise table that you can build yourself or purchase, or a plastic sweaterbox. Inside this enclosure, there should be substrate, hiding places, heating, and lighting. Good substrate options include cypress mulch, coconut coir, and peat moss. As long as your soil isn’t contaminated with fertilizers or chemicals, you can use it for your turtle’s outdoor enclosure. Also provide several large, flat rocks, as these will be a great surface on which you can place food for your pet, and your tortoise can file his nails down using these rocks as well. The humidity level should be moderate inside your tortoise’s enclosure, so mist it regularly. A baby tortoise should have access to a hiding area that’s humid. This will allow him to burrow and snuggle in to get the humidity necessary for his shell to grow properly, as well as to remain hydrated. Maintain the temperature of your indoor tortoise enclosure at 68-80°F, and have a basking area of around 90°F. UVB lighting should be provided to tortoises that aren’t exposed to sunshine, and the lights can run for 12 hours each day. Finally, your tortoise should always have a shallow dish filled with filtered water so he can soak in it and drink from it. The Red Footed Tortoise has a curious personality, and is a good choice for beginners. The Red Footed Tortoise is an omnivore, so you need to provide a varied diet. You can feed your tortoise vegetables that include turnip greens, watercress, dandelion greens, escarole, broccoli, mustard greens, collard greens, Swiss chard, kale, parsley, romaine, cooked sweet potatoes, squash, parsnips, pumpkin, zucchini, peas, carrots, and bell peppers. Avoid pale colored greens like celery and iceberg lettuce. Other good plant options include rose blossoms, hibiscus flowers, and other non-toxic flowers and leaves. Fruit that you can offer include berries, apples, papaya, melon, pineapple, guava, cactus fruit, bananas, plums, grapes, tomatoes, and peaches. A small part of your pet’s diet should be animal protein. Stick with low fat sources, and feed these foods once a week. Good options include roaches, crickets, mealworms, bloodworms, waxworms, and earthworms. You can also supplement your tortoise’s diet with a multi-vitamin/mineral and calcium product. Red Footed Tortoises shouldn’t be handled regularly, as they can become stressed. However, these tortoises are a pleasure to watch, and their curious personalities are certainly endearing.", "facts": " 11-14” Terrestrial Commercial tortoise diet, vegetables, flowers, fruits, insects, worms Low Maintenance", "tags": "Red Footed Tortoise, tortoise, tortoise breed, Yellow Footed Tortoise, "}, "red-eared slider turtle": {"page_url": "https://www.petguide.com/breeds/turtle/red-eared-slider-turtle/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/09/red-eared-slider.jpg", "name": "Red-Eared Slider Turtle", "type": "turtle", "text": "The Red-Eared Slider Turtle is one of the most popular and most commonly kept pet turtles. These turtles are great swimmers, and they really enjoy spending most of their time underwater; however, they do spend a lot of time basking as well. In fact, on sunny and warm days in the wild, you may find more than one Red-Eared Slider sitting on top of one another while they bask in the sunshine together. Even though Red-Eared Sliders that are kept as pets will be quite personable and are known for swimming up to their owners and asking for food, these attractive turtles are also easily startled. Even the slightest sound or movement will cause a turtle to quickly slide off of his log or rock and dive right back into the water. This sliding motion, combined with the red mark on either side of the turtle’s head, is how its name was created. The Red-Eared Slider Turtle is one of the most popular and most commonly kept pet turtles. This turtle breed has its origins in the area that is found around the Gulf of Mexico and the Mississippi River. It prefers the warmer climates of the southeastern region of the United States, and native habitats include the southeastern part of Colorado, all the way to Virginia and even down to Florida. In the wild, these turtles prefer warm, still waters, so they will be found in and around creeks, slow flowing rivers, streams, swamps, lakes, and ponds. These calm waters allow them to easily move into and out of the water, and they can easily climb onto tree trunks and rocks that give them the ideal spot for warming themselves while exposed to the sunshine. This means that they are semi-aquatic turtles.\n Nevertheless, even though they are native only to these parts of the Americas, the Red-Eared Sliders can be found in the wild all over the world. This is a direct result of pet releases and other reasons, and it makes this turtle breed one of the most invasive species in the world! As such, it is the most common pet turtle, and the most traded turtle breed in the world. In parts of the world where they are not a native wild species, they can become a threat for native flora and fauna.  The Red-Eared Slider Turtle is green and features bright yellow stripes. There is also a distinct red patch located behind both eyes. However, some of these turtles might actually be missing this red spot, and some might even showcase a small red patch on the top of the head. When looking at the Red-Eared Slider, you will notice that it has strong claws and webbed feet. Hatchlings will feature a shell that is green, and it will have a pattern consisting of dark green or yellow-green marks. However, as these turtles grow, their carapace might become olive green or yellow. The once yellow-green or dark green pattern can also change into patches on every scute, or into dark lines. Also, parts of the turtle’s shell might be red, yellow, or white, and as the animal continues to age, the patches and lines might disappear slowly until the shell becomes a uniform color of dark olive green or a greenish-brown color. Some males might even turn black or dark gray. There are two color morphs within the Red-Eared Slider Turtle breed, thanks to breeders. The first is called the pastel. These turtles will be lighter and will feature varying levels of yellow and red. The second is albino, and those turtles will be bright yellow when they are young but their color will fade with age. Either way, these little critters are quite charming in every way, and can become the bright little spark in every household.  Even though Red-Eared Sliders are personable, these attractive turtles are also easily startled.  To properly house your Red-Eared Slider Turtle, you will need a tank with a filtration system, a basking dock, a basking lamp that provides both UVA and UVB rays, and a water heater. While all of this might sound too much, it is quite easily available in every pet store. Of course, these gadgets and accessories are quite important for a proper and healthy life for your pet turtle, so make sure you get them first. Beware that these turtles are messy eaters, and they do create a lot of waste. Therefore, it is best to use a water filter that’s rated for a minimum of double the gallons of water in the tank. In addition to filtration, however, you will need to do regular water changes as well. One of the biggest mistakes that careless turtle owners make is irregular water change. This results in a messy tank full of that nasty green slush, or pondweed known as Zannichellia. These unhygienic conditions can create health problems for your little pet, so don’t allow them to become a common thing. Set the temperature of the basking area to 85-90°F, and set the water temperature to 75-85°F. Using a water heater and thermometer, you can maintain these temperatures consistently at all times, as the animal’s metabolism will slow down and threaten its health if the temperature drops too low. Also, too many fluctuations in the temperature could result in respiratory ailments. Either way, proper temperature and good hygiene are crucial for your turtle to thrive in this confined environment.  The Red-Eared Slider Turtle is green and features bright yellow stripes. The Red-Eared Slider Turtle is an omnivorous animal that likes to eat small fish, aquatic vegetation, and even decaying materials in the wild. Therefore, you can feed your turtle a variety of foods. A good place to start is a commercial turtle diet that will provide adequate nutrition for growth and overall health. As an extra treat, however, you can also give your turtle some leafy greens, worms, crickets, freeze dried krill or shrimp, and minnows. Whatever dietary approach you opt for, you will discover that a red-eared slider turtle is a hearty pet which isn’t too picky about its food. If you are a first time turtle owner and need some guidelines about a good food choice, you can always find information from your local pet store, or a vet.  Besides the diet and optimal conditions in the tank, there isn’t much else you need to ensure for your turtle’s good health. As pets they are usually hardy and hale when cared for properly. Just keep in mind that the first year or two will be instrumental for their well being. Those red-eared sliders that continue thriving after that initial period can be expected to live up to an amazing 30 years! This is great news for all turtle lovers out there. If you develop a bond with your aquatic little friend, you can expect a quirky and docile pet that will always be around to boost your mood and keep you company. It is always best to get a pet turtle that was hatched in captivity, as they will be more personable. Wild-caught turtles will be much more frightened and cautious of people. You can expect that, as your Red-Eared Slider gets to know you, he will swim up to you and even beg you for some food. However, when you handle your turtle, he may decide to withdraw and hide in his shell, or he may even bite you if he feels frightened or threatened. While every turtle is an individual and will have his own personality, it is generally not recommended that you handle these animals frequently. After all, you shouldn’t expect a pet that exhibits the same character traits as, for example – a dog. The nature of a turtle is simply too different – it is a reptile, after all. As a pet, a red-eared slider won’t offer much in terms of play or emotion. Some of its natural tendencies will come off as fun and cute, and some goofy behavior will always be there. But in the end, that’s as far as it goes with a pet turtle. Either way, that does not make them any less of a great pet – they are superb in every other way.", "facts": " 6-8\" Semi-aquatic Pelleted commercial diet, Commercial turtle treats, Krill, Non-toxic aquatic plants, vegetables, Insects, Worms, Fish Average", "tags": "Red-Eared Slider, Red-Eared Slider Turtle, Red-Eared Turtle, Slider Turtle, "}, "reeve’s turtle": {"page_url": "https://www.petguide.com/breeds/turtle/reeves-turtle/", "image_url": "https://www.petguide.com/wp-content/uploads/2017/12/reeves-turtle.jpg", "name": "Reeve’s Turtle", "type": "turtle", "text": "The Reeve’s Turtle, which is also known as the Chinese Pond Turtle, is a popular breed in the pet world, and it has a great personality that makes it a good choice for those who are beginners at keeping turtles as pets. The Reeve’s Turtle, which is also known as the Chinese Pond Turtle, is a popular breed in the pet world. You can find this breed living in eastern and central China, South Korea, North Korea, Japan, and Taiwan. These turtles prefer still water or slow-moving water, such as small streams, ponds, and lakes that have plenty of aquatic plants and basking areas, along with soft substrate. However, Reeve’s Turtles have also been found in flooded rice paddies, marshes, and swamps. The shell of a Reeve’s Turtle could be described as a bit rectangular. The carapace has three keels that run down the length of it. These become less pronounced as the turtle gets older and the keels become increasingly worn over time. It could be difficult to differentiate between a male and a female Reeve’s Turtle. However, you might notice that the plastron on a female will be either slightly convex or flat, while the plastron on a male will be concave. The tail of a male will also be thicker and longer compared to that of a female. The Reeve’s Turtle has a great personality that makes it a good choice for beginners. The Reeve’s Turtle features a carapace that could be anywhere from olive green to tan or even black, and there might also be subtle smudging that provides a bit of contrast in the coloration. Also, the plastron will be tan, yellow, or cream, along with dark brown, black, or gray smudges on the scutes. And the scutes’ seams could be lighter in color than the overall base color of the plastron and carapace. The color of this turtle’s skin will be similar to the color of its carapace. You will also notice yellow stripes creating patterns on the head and neck, but these could vary from one turtle to another. Typically, there could be yellow to cream colored speckling, mottling, or striping. Also, the scales on the legs might feature lighter hues as well. Even though males and females will be the same in terms of color while they are young, as they get older, males could become darker. Although Reeve’s Turtles are active in their enclosures, these animals are not considered the best swimmers, so shallow water is recommended for them. Ensure that the water is deep enough, however, that your turtle will be able to turn around and avoid drowning. And your turtle should also be able to climb, rather than swim, to the surface. So if your turtle is 4” long, the water should be at least 6” deep, while a 2” turtle would need water that is 3” deep. You could keep one adult in a 50-gallon or larger tank. For every additional adult turtle, add another 15 gallons of space. And you could house your turtle indoors or outside, provided that you are able to protect your pet from temperature extremes, escape, and predators. Offer your turtle various plants for hiding and climbing, as well as snacking. Shaded areas are also necessary, in addition to a basking area with a UVB light and a heater to ensure the temperature remains anywhere from 85-95°F. Just be sure that your turtle could come out of the water completely when basking to totally dry off. A heater could keep the water temperature anywhere from 70-80°F, while the air temperature could be anywhere from 75-85°F. The temperature could drop roughly 5° during the night, and an additional 5° during the winter. When it comes to substrate, you have the option of leaving the bottom of your turtle’s tank bare. If you choose a substrate, ensure that it is the appropriate size so that your turtle either can’t swallow it or it will pass through your pet’s digestive tract easily if it does end up being swallowed. Reeve’s Turtles live in eastern and central China, South Korea, North Korea, Japan, and Taiwan. Reeve’s Turtles are omnivorous, so they could feast on a variety animals and plants. This breed is not considered really picky when it comes to food, so you can provide your pet with everything from commercial pellets, crickets, bloodworms, and earthworms, to aquatic insects, feeder fish, aquatic plants, fruits, and leafy greens like kale, escarole, and romaine lettuce. Overall, the Reeve’s Turtle is fun to watch and could make a great pet, thanks to its friendly personality and its small size. Nevertheless, it is best to keep handling to a minimum. You can also keep multiple Reeve’s Turtles in the same enclosure, as they enjoy basking together, or you could house Reeve’s Turtles with other breeds that have similar requirements. Just be aware that males and females could exhibit territorial aggression and dominance, so providing plenty of hiding places and space is key.", "facts": " 4-9” Semi-aquatic turtles Pelleted commercial diet, insects, worms, fish, vegetables, aquatic plants, aquatic insects, fruits Low maintenance", "tags": "caspian pond turtle, chinese pond turtle, chinese stripe neck turtle, Chinese Stripe Necked Turtle, Golden Thread Turtle, Mediterranean Pond Turtle, reeve's turtle, turtle breed, "}, "russian tortoise": {"page_url": "https://www.petguide.com/breeds/turtle/russian-tortoise/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/10/russian-tortoise.jpg", "name": "Russian Tortoise", "type": "turtle", "text": "Also known as the Steppe Tortoise, the Afghan Tortoise, and the Horsfield’s Tortoise, the Russian Tortoise is one of the most popular pet tortoise breeds. If you want to bring one of these tortoises into your family, make sure that the animal has been bred in captivity rather than taken from the wild. Those that have hatched in captivity are more accustomed to people, and imported wild tortoises tend to have health problems, such as parasites, as well as difficulty acclimating to life in captivity. The Russian Tortoise is one of the most popular pet tortoise breeds. Russian Tortoises are found in dry, desert environments throughout Iran, Afghanistan, Kazakhstan, Uzbekistan, China, Russia, and Pakistan. They prefer areas that have cold winters and dry, hot summers, and they are typically found in hilly or rocky areas that are located in close proximity to springs where vegetation and grass are abundant. They do burrow, so their habitat will also provide areas where they can dig, or they will modify animal burrows that have been abandoned. The small Russian Tortoise can be described as stocky in appearance. You will notice a rounded and oval carapace, along with a rigid plastron that does not have a movable hinge. These tortoises also feature four claws on each foot instead of the usual three. The tail also showcases a terminal claw. Males have longer tails than females. The Russian Tortoise can feature a range of beautiful colors. These animals can be almost black to bright yellow, but most of them will be anywhere from brown to olive. The carapace is usually olive brown to green in color, and it will feature dark patches of color as well. The legs and the head will typically be a yellowish brown hue. The Russian Tortoise can feature a range of beautiful colors. A single Russian Tortoise should be provided with an enclosure that is a minimum of 2’x4’. You can use soil or sand as the substrate, making certain that it is deep enough for your pet to burrow. The enclosure should not be see-through, as your tortoise will try to get to the other side of the glass. Also be sure that the enclosure is secure, as these tortoises can escape by digging. Provide your tortoise with a dry area to escape wet and cold conditions that could result in disease. These animals need a dry, warm environment. Humidity should be maintained at around 60%, and a basking area should be created where the temperature will be anywhere from 90-95°F. The rest of the enclosure should be in the low 70s Fahrenheit. Nighttime temperatures should drop down into the 60s Fahrenheit. Also provide your pet with a shallow dish of clean water at all times. Your tortoise should be able to drink the water, as well as soak in it. You should also give him a place to hide, such as a box, and this should be placed on the cooler end of the enclosure. Unless your tortoise is in an outdoor enclosure that exposes him to natural sunlight, you will need to set up a full-spectrum fluorescent bulb that will provide UVB rays for around 12 hours a day. If your tortoise has the room to burrow and it gets too cold, he will hibernate in the winter. But if he is in an indoor enclosure and temperatures are kept stable all year round, he will not feel the need to hibernate. You should feed your Russian Tortoise a diet that is low in protein, rich in calcium, and high in fiber. This will ensure that your pet’s digestive tract will function optimally and that he will grow beautifully. Because these animals are herbivorous, they should not be fed animal protein. Instead, stick with leafy greens, grasses, and hay, and provide a calcium supplement. A few of the foods that your Russian Tortoise will enjoy munching on include geranium, dandelion flowers and leaves, Bermuda hay, hibiscus, hollyhocks, geranium, timothy hay, romaine, turnip greens, red and green leaf lettuce, mustard greens, escarole, endive, collard greens, spring mix, and kale. Russian Tortoises are entertaining, friendly, active, and outgoing. Russian Tortoises are entertaining, friendly, active, and outgoing. If you are patient and gentle when handling your tortoise, he can become pleasant and tame, but be aware that handling your tortoise can also stress him out. It is not advisable to house your Russian Tortoise with other tortoises because there are potential health risks involved, and the behavior and structure of these tortoises makes them incompatible with the majority of other tortoise breeds that are kept as pets. When mixed with other species, these animals can suffer from traumatic injuries. Also, Russian Tortoises are aggressive towards one another, so if you are going to keep a pair, or more than one male, you will have to provide a large enclosure with sightline breaks to keep the males from harming the females or hurting one another.", "facts": " 4-8” Terrestrial Leafy greens, hays and grasses, flowers, weeds Low Maintenance", "tags": "Afghan Tortoise, greek tortoise, Hermann’s Tortoise, Horsfield’s Tortoise, Kleinmann's Tortoise, Marginated Tortoise, Russian Tortoise, Steppe Tortoise, tortoise, tortoise breed, "}, "smooth softshell turtle": {"page_url": "https://www.petguide.com/breeds/turtle/smooth-softshell-turtle/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/10/smooth-softshell-turtle.jpg", "name": "Smooth Softshell Turtle", "type": "turtle", "text": "Pet owners who would like to make a unique looking turtle a part of their family should consider the Smooth Softshell Turtle. These turtles are larger than many other breeds, so you will need to be certain that you have the space for one, and you also need to have the right equipment to keep the water as clean as possible. Also, their care level is considered advanced, so this breed may not be the best choice if you have never had turtles before. Pet owners who would like to make a unique looking turtle a part of their family should consider the Smooth Softshell Turtle. Smooth Softshell Turtles are naturally found in unpolluted bodies of water that include large streams, big lakes, and rivers. These habitats will contain sandy or muddy bottoms, as the turtles do not prefer water that has a rocky bottom. They will end up burying themselves in the sand or the mud underwater when they want to be left undisturbed, and they will use the water as a place where they can retreat when they’re threatened. These animals also prefer environments that have sandbars that can be used for basking. This breed is active particularly from April through the end of October. You can find these turtles in the Mississippi River drainage and its tributaries from Minnesota to Louisiana, as well as North Dakota, South Dakota, and western Pennsylvania. You might also spot them in the river drainages of Oklahoma, Nebraska, Kansas, and Texas. The Smooth Softshell Turtle features a uniquely smooth carapace that does not display any of the typical bony scutes that are found on other turtle breeds. Also, the carapace will be flat and leathery, and the edges will actually be flexible. When looking at a Smooth Softshell Turtle, you will also note that the nose tapers and comes to a point, and you will not see any ridges within the nostrils. Females will be larger than males, reaching a length of around 14”. Males will only grow to be about half the size of females. The Smooth Softshell Turtle features a smooth carapace that does not display any of the typical bony scutes found on other turtle breeds. An adult male Smooth Softshell Turtle will be gray or brown in color, and there will also be some small dots and dashes found on the animal’s back. On the other hand, an adult female will feature a carapace that is brown or tan in color, and it will have dark brown blotches that are irregular in shape. Juveniles will look like adults males, with a grayish or brown hue and the scattered and small dark brown dashes or dots. Despite their differences in color, male and female Smooth Softshell Turtles also feature light colored lines along the sides of the head. One line will be located behind the ear, while another will start below the snout. Because a Smooth Softshell Turtle will grow to a medium size, you need to be sure that you will have enough space for your pet once he matures. If you can’t provide a Smooth Softshell Turtle with the proper space, there are smaller breeds that you can consider. The key to your Smooth Softshell Turtle’s health will lie in the maintenance of clean, filtered water. These are freshwater turtles that spend most of their time in the water, so a high quality filtration system should be in place. Provide your pet turtle with a sandy substrate so that he can hide in it. Your turtle should be able to completely bury himself in the sand. The water should also be shallow enough that he can reach his long neck to breathe at the surface. A basking site will be necessary in your turtle’s enclosure. Place it at a slant so that it can dip into the water and your pet can easily come out. You can even make a basking area from a plastic egg crate. In this way, your turtle can come out of the water completely, or he can partially bask while the rest of his body remains under the water. Place a warming light over the basking area so that it can reach 90°F. The tank should be lit with a multi-spectrum light bulb, the water temperature should be 70-80°F, and the air temperature should be around 75-85°F. The Smooth Softshell Turtle could get hurt when housed with other turtle species, so it is best to keep this breed on its own. Smooth Softshell Turtles are primarily carnivorous, so they will eat just about every aquatic creature that they can get into their mouths comfortably. Their wild diet includes small fish, as well as aquatic plants and aquatic insects, so you can mimic this diet in captivity as well. You can give your turtle a commercial pellet diet as a foundation, and then give him some non-toxic plants and insects as well. The Smooth Softshell Turtle could get hurt when housed with other turtle species, so it is best to keep this breed on its own. It is important to know that your Smooth Softshell Turtle will be a strong and fast swimmer. If you pick up your turtle, you should expect that your pet will use that power to try to scratch and bite you, so you need to limit the handling of these turtles to those times when it is really necessary. Also, when you handle these turtles, you should do so with extra care, keeping the pet away from your body and making sure that the animal’s face is pointing away from your fingers.", "facts": " 7-14” Aquatic Commercial turtle diet, insects, non-toxic aquatic plants High Maintenance", "tags": "Florida Softshell Turtle, Smooth Softshell Turtle, softshell turtle, Spiny Softshell Turtle, turtle, turtle breed, "}, "snapping turtle": {"page_url": "https://www.petguide.com/breeds/turtle/snapping-turtle/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/11/snapping-turtle.jpg", "name": "Snapping Turtle", "type": "turtle", "text": "You can keep a Snapping Turtle as a pet, but you should be prepared to put in a lot of effort and time in order to properly care for your turtle. These animals can be difficult to keep at home, particularly when they get older and can weigh as much as 40 pounds, so being aware of what to expect is an important step in determining if this is the right turtle breed for your family. You can keep a Snapping Turtle as a pet, but you should be prepared to put in a lot of effort and time in order to properly care for your turtle. Common Snapping Turtles are found throughout the eastern portion of North America, from Quebec and Ontario all the way down to Florida. They are also found in habitats that are farther west into Kansas, as well as all the way to Central America. These turtles prefer freshwater environments like marshes, ponds, swamps, and lakes, as well as slow-moving rivers and streams. Adults may go into brackish water as well. Snapping Turtles are also known for sometimes walking long distances on land, with females often seen crossing roads from May to June, which is their nesting season. It is easy to recognize a Snapping Turtle when you see one. You will notice the rough shell that has ridges and peaks, and you will also note that the head is large and the jaws are muscular. These turtles also have a beak that is pointed and sharp, and they feature a muscular, long tail. A large enclosure with deep water is a must for your Snapping Turtle. These large turtles can showcase various colors, including different shades of olive, brown, and black, as well as a cream. A large enclosure with deep water is a must for your Snapping Turtle, so if you do not have the space to accommodate this animal, it is best to go with a smaller turtle breed. These turtles will do well in a big outdoor pond with a high quality filtration system that will keep the water clean. You should also provide your pet with plenty of non-toxic aquatic plants and driftwood in order to make the enclosure as natural looking as possible. A large enclosure with the right décor will provide your pet with space to swim and stay active, and that will help maintain your turtle’s health and happiness. If you are planning on housing your Snapping Turtle indoors, you can use a stock tank or a large tub to create a basic setup for your pet. You will need to add a high quality filtration system to keep the water clean, especially since these turtles are messy eaters that need high-protein foods. Also add a UVB light bulb over the enclosure, along with a 100-watt spotlight over one end. Even though your Snapping Turtle will rarely get out of the water to bask, a basking area is recommended just in case he does decide to climb out and dry off a bit. You can set up the basking area by positioning the lamp over a shallow area in the tank that has a flat stone or similar object for your turtle to rest on. Doing so will create a slightly warmer area for your turtle to bask in while staying in the water. And, as with an outdoor enclosure, your indoor enclosure should also have a variety of submerged and floating aquatic plants. For substrate, you can use gravel and rocks. The water should be maintained at a temperature of 75-86°F by day, but it can drop by 10° at night. You can use a water heater to keep the water temperature at the right level. To keep the water clean and free of contamination, you can change 50% of it twice weekly. Be aware that Snapping Turtles are feisty and aggressive. Snapping Turtles are omnivores, so they will eat a wide array of floating aquatic plants and live prey. You can feed your pet a commercial pelleted diet for turtles, along with crayfish, insects, worms, and fish. Just make sure that you don’t overfeed your pet, as these turtles will have a big appetite and could become overweight. You can feed your turtle at least once a week, but remove any food that hasn’t been eaten in order to keep the water clean. As with all other turtle breeds, make sure you purchase a Snapping Turtle that was born in captivity rather than taken from the wild. However, be aware that Snapping Turtles are feisty and aggressive, even when they are bred in captivity. They are known for viciously striking at their owners, and they should not be housed in a community tank because they will kill and consume other animals, including other Snapping Turtles. These turtles should be housed alone, and they should be admired from a distance, as they are not the types of animals that can be held. If your Snapping Turtle grows too big for you to handle, never release him into the wild. Instead, seek out a turtle rescue or adoption group or a local turtle club who can help.", "facts": " 9-20” Aquatic Commercial pelleted diet for turtles, fish, crayfish, insects, worms, non-toxic aquatic plants High Maintenance", "tags": "alligator snapping turtle, common snapping turtle, Florida Snapping Turtle, Mexican Snapping Turtle, Northern Common Snapping Turtle, Snapping Turtle, turtle, turtle breed, "}, "southern painted turtle": {"page_url": "https://www.petguide.com/breeds/turtle/southern-painted-turtle/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/10/southern-painted-turtle.jpg", "name": "Southern Painted Turtle", "type": "turtle", "text": "The Southern Painted Turtle is an attractive turtle that is commonly kept as a pet, so it is easy to find hatchlings that were bred in captivity. This is important because experts do not recommend keeping wild turtles as pets, and wild turtles should not be taken out of their natural environment. There are actually four types of Painted Turtles, and the Southern Painted Turtle is the smallest. Some people even consider this type of Painted Turtle the most attractive of all four types. These semi-aquatic turtles are low maintenance and a good beginner option if you are new to keeping turtles as pets. Southern Painted Turtles are attractive turtles that are commonly kept as pets. Painted Turtles are found throughout the United States, from the east coast all the way to the west coast, as well as up to southern Canada and down to northern Mexico. Southern Painted Turtles, in particular, are found in Missouri, Illinois, Louisiana, Arkansas, Tennessee, Alabama, and Mississippi. These turtles prefer still and slow-moving freshwater environments that feature plenty of aquatic vegetation; however, they have also been seen in brackish environments. They like to make their homes in bodies of water that feature soft bottoms, and they need to be in habitats that also provide basking areas, so they favor everything from rivers and swamps, to ponds and lakes. Southern Painted Turtles are similar in appearance to the Eastern Painted Turtle, but they do not feature aligned scutes on the carapace. These turtles are also smaller when compared to the size of the other three types of Painted Turtles. When looking at a Southern Painted Turtle, you will notice that the males have long front claws. Males will also feature longer tails than females, and the tails will be thicker at their base. Males can also be distinguished from females because they are smaller when they are fully grown. Southern Painted Turtles spend a lot of time basking. The Southern Painted Turtle features a dark green carapace that has a thin red, orange, or yellow stripe that runs right down the middle of the shell from the top to the bottom. Also, when you look at this turtle’s head, you will notice markings that include wavy or jagged yellow stripes. There are also markings along this turtle’s marginals. The legs, which are black or dark green like the head, will also feature colored stripes, and the plastron will be yellow or tan without any patterning. Southern Painted Turtles spend a lot of time basking, so you will need to provide your pet with a basking area that has overhead UVB lighting and a heat lamp that will maintain the temperature anywhere from the upper 80s to lower 90s Fahrenheit. You will also need to maintain the water temperature in the low to mid 70s Fahrenheit, so a high quality submersible water heater will be necessary. A high quality filtration system will also be required in order to keep the water pure at all times. Your turtle’s enclosure should have water that is deep enough that he can completely submerge and swim around. A good place to start is to make the water about 10-12” deep. You can opt to leave the bottom of the tank bare, but if you do choose to use a substrate, gravel or sand is recommended. No matter what substrate you choose, make sure the particle size is either small enough that it can move through your pet’s digestive tract with ease, or large enough that it can’t be swallowed in the first place. The minimum recommended tank size for just one male adult Southern Painted Turtle is 40 gallons, but 55 gallons or more is a better option. Because females will grow to a larger size than males, a single adult female should have a tank that is at least 55 gallons, but the preference would around 75 gallons. If you are planning on housing more than one Southern Painted Turtle in the same enclosure, you should add a minimum of 40 gallons for each female and a minimum of 20 gallons for each male. Provide your turtle with hiding places under the water, but make sure that they are safe, as you don’t want your turtle to get stuck and drown. You can also add non-toxic plants to the enclosure in order to give your turtle more places to hide, as well as extra sources of food. Southern Painted Turtles are a good option if you wish to build a community habitat for several different turtle species. These turtles follow an omnivorous diet. Therefore, to keep your Southern Painted Turtle healthy, you can feed him a commercial turtle diet, as well as fish, vegetables, non-toxic aquatic plants, crickets, insects, worms, and snails. Southern Painted Turtles are a good option if you wish to build a community habitat for several different turtle species, as these animals will get along with other Painted Turtle breeds, as well as Map Turtles, Cooters, and Sliders. Always watch out for aggressive behavior in community tanks, and provide your turtles with plenty of space and places to hide. Handle your Southern Painted Turtle only when necessary, and be aware that these turtles can bite if they are provoked, frightened, or stressed.", "facts": " 3.5-7” Semi-aquatic Commercial turtle diet, non-toxic aquatic plants, fish, vegetables, insects, worms, snails Low Maintenance", "tags": "eastern painted turtle, Midland Painted Turtle, painted turtle, painted turtle breed, Southern Painted Turtle, turtle breed, Western Painted Turtle, "}, "spiny softshell turtle": {"page_url": "https://www.petguide.com/breeds/turtle/spiny-softshell-turtle/", "image_url": "https://www.petguide.com/wp-content/uploads/2017/12/spiny-softshell-turtle-668x501.jpg", "name": "Spiny Softshell Turtle", "type": "turtle", "text": "There are several subspecies of the Spiny Softshell Turtle, but one thing that makes all of them interesting is their unique shell. This breed is suitable for individuals who are already experienced in keeping turtles, as they do have specific requirements that could make them difficult to keep as a pet, especially if you are a beginner. There are several subspecies of Spiny Softshell Turtles, but one thing that makes all of them interesting is their unique shell. The aquatic Spiny Softshell Turtle could be found living across much of North America. Its range includes southern parts of Quebec and Ontario in Canada and the areas east of the Rocky Mountains. You could even find them in the southern part of the United States as well. This breed is known for burying itself in a shallow body of water so that its nostrils could easily reach the surface. However, these animals could also bury themselves in water that is deeper too, as they could get oxygen through their skin from the water, so you could find them underwater for an extended length of time. But in addition to spending time in the water, you will also find these turtles basking on rocks or logs. Depending upon where a Spiny Softshell Turtle is located, it might hibernate during the winter by finding well-oxygenated water that is sufficiently deep and then burying itself into the substrate. For example, the turtles found in Canada could hibernate for roughly six months until May. Overall, this breed prefers freshwater habitats that include lakes, ponds, ditches, creeks, and rivers that have soft bottoms, aquatic vegetation, and areas for nesting and basking. The Spiny Softshell Turtle is suitable for individuals who are already experienced in keeping turtles. Spiny Softshell Turtles feature a unique shell that is described as being leathery, round, and flat. The front edge of the carapace will also have small spines, and the shell’s surface will be covered by a soft skin that, when touched, has a texture similar to that of sandpaper. Another distinguishing feature of the Spiny Softshell Turtle is its tubular snout and large nostrils. Also, the feet will be webbed, with the webbing of the back feet extending onto the animal’s back legs. The feet will have three claws as well. You can distinguish adult males from females by looking at their size, as a female Spiny Softshell Turtle will be bigger than a male. Females will also feature a short tail compared to the thick, long tail of males. And the texture of a female’s shell might also be smoother. A Spiny Softshell Turtle’s carapace will typically be anywhere from a yellow-brown to olive color. It will feature a pattern that is made up of dark blotches or black spots. There will also be a dark line that goes around the outer edge of the carapace. The limbs and the head will be gray to olive in color, and will feature dark spots as well. And the head will have a couple of pale lines that have a black border. These will extend backwards from the animal’s eyes to the jaw. The plastron, on the other hand, will usually be yellow or white in color. Juveniles will look a lot like adult males, but adult females will typically end up losing the black spots and developing a blotched or mottled pattern as they get older. Spiny Softshell Turtles feature a unique shell that is described as being leathery, round, and flat. Because the Spiny Softshell Turtle could grow to be quite large, it’s best to ensure that you have the proper space available for your pet before bringing one into your family. Experts recommend that a single adult male be housed in a 90-gallon aquarium, at the minimum. Females are too active and too big to keep in an aquarium, so you might be able to use a 600-gallon or larger stock tank. In order to help your turtle maintain its health, you will need to keep a close eye on the water quality of the enclosure. Investing in a strong filtration system and setting it up to prevent sand from getting sucked into it is important. And you could also provide some type of cover, such as live plants, to help your pet feel more secure. Also, because Spiny Softshell Turtles could develop fungal or bacterial infections from scratches, don’t put any abrasive materials into your pet’s enclosure. When it comes to substrate, it’s a good idea to provide sand so that your turtle will be able to easily bury itself. Set up an area where your turtle will be able to bury itself while still being able to reach the surface for air by using its long neck. And your turtle will need a basking site as well, placed at an angle into the water so that your pet could partially come out of the water and bask or come out completely. Just be sure to set up a multi-spectrum light and ensure the temperature in the basking area is at least 80°F. Spiny Softshell Turtles are mainly carnivorous. They prefer to eat crustaceans, small fish, tadpoles, frogs, insects, mollusks, and worms. And these turtles occasionally enjoy feasting on plants. This means that you could feed your turtle a variety of foods, including commercial pellets, crickets, grasshoppers, small crayfish, ghost shrimp, bloodworms, earthworms, and fish. You could also offer romaine lettuce and aquatic plants, as well as spirulina algae wafers. Use caution when handling your Spiny Softshell Turtle, as these animals could become aggressive and bite you. It is best to avoid handling your turtle unless it is necessary. Also, keeping your pet in a community enclosure might not be a good idea, as Spiny Softshell Turtles tend to hurt one another when they are housed together or when they are kept with other breeds of turtles.", "facts": " 5-19\" Aquatic turtles Pelleted commercial diet, crustaceans, fish, insects, mollusks, tadpoles, worms High maintenance", "tags": "aquatic turtle, Smooth Softshell Turtle, softshell turtle, Spiny Softshell Turtle, turtle breed, "}, "spotted turtle": {"page_url": "https://www.petguide.com/breeds/turtle/spotted-turtle/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/10/spotted-turtle.jpg", "name": "Spotted Turtle", "type": "turtle", "text": "The Spotted Turtle is an attractive species, but its wild populations are declining as a result of the pet trade taking these animals out of their natural habitats. Therefore, if you are planning on introducing these turtles into your family, make sure that you are purchasing them from a reputable breeder who can guarantee that your turtles were born in captivity. The Spotted Turtle is considered one of the smallest turtles in the United States. Spotted Turtles can be found across the northeastern portion of North America, but they are primarily found in the Great Lakes region of Canada and the United States, as well as along the eastern seaboard. This species prefers shallow bodies of water, such as marshes, sedge meadows, swamps, bogs, woodland brooks and streams, and seasonal and permanent ponds. These turtles will go on land when they travel between wetlands, and when they need to use land for nesting and hibernation. The Spotted Turtle is considered one of the smallest turtles in the United States. Even though these turtles feature a hingeless plastron, you can differentiate males from females because the males will have a slightly concave plastron, while the females will feature a flat plastron. Also, males will have a thicker and longer tail than females. This breed’s most distinguishing feature is its shell, which features yellow spots that increase in number as the animal ages. There could sometimes be over 125 spots scattered across the face and shell of a Spotted Turtle, while a younger turtle will only have a few spots, such as one on each scute. There can sometimes be over 125 spots scattered across the face and shell of a Spotted Turtle. The Spotted Turtle can be recognized easily, thanks to its distinct orange to yellow colored spots on its brownish-black carapace. This spotting pattern also extends to the dark limbs and head. The legs are mostly black but will also have yellow spots, along with orange and red colors mixed in. When looking at a Spotted Turtle, you will note a large orange or yellow blotch on either side of the head. Also, the plastron will be orange to yellow in color, and it will have big black patches on every scute. These patches typically become darker, as well as more extensive, as the turtle ages. Males typically have brown eyes, along with a black, brown, or tan chin. Females, on the other hand, with have a yellow, reddish, or orange chin and orange eyes. Your Spotted Turtle’s enclosure should contain a basking area so that your pet can easily climb out of the water and dry himself off completely. Place a heat lamp roughly 12” above the basking area, and also have UVB lighting for your pet in order to simulate natural sunlight and help his body synthesize vitamin D. Keep the temperature over the basking area at around 90°F. To keep your turtle healthy, you will need to provide him with clean water, so a high quality filtration system should be set up. An oxygen pump that adds a bit of splashing at the water’s surface can help with oxygen flow as well. Just make sure that the water doesn’t come into contact with the dry basking area. The depth of the water should only be around 4-6” because Spotted Turtles are not good swimmers, so they should only have shallow water. Deeper waters can cause these pets to drown. You can also provide artificial plants throughout the enclosure to help prevent drowning. Maintain the water temperature around 65°F with the help of a high quality water heater. When it comes to substrate, choose from dirt, sand, and small to medium sized rocks for the Spotted Turtle. The tank itself should be at least 55 gallons, and you can place three Spotted Turtles into this size enclosure, as they will have enough room to swim and bask. Spotted Turtles should be handled sparingly and for a short amount of time. Although a Spotted Turtle will enjoy a varied diet, this breed is mainly carnivorous. These animals will eat insects, waxworms, earthworms, mealworms, tadpoles, crickets, crab, and meats like poultry and beef. They will also do well on a commercial turtle diet, and can also be given some aquatic vegetation and leafy greens. You can house more than one Spotted Turtle in the same enclosure, and you can also set up a community tank that includes Spotted Turtles, Bog Turtles, and Wood Turtles. Even though you might want to hold your Spotted Turtle a lot, these animals should only be handled sparingly and for a short amount of time, such as for about 20 minutes a few times every week. Avoid handling any Spotted Turtles that you have recently added to your family, as they should get used to their new home and become completely comfortable first. Remember that, because these turtles are endangered in their wild habitats, you should make it a point to purchase only from sellers who can prove that their turtles have been bred in captivity.", "facts": " 4-6” Semi-aquatic Commercial turtle diet, insects, worms, meats, aquatic plants, leafy green vegetables Low Maintenance", "tags": "Bog Turtle, spotted turtle, turtle, turtle breed, wood turtle, "}, "stripe-necked musk turtle": {"page_url": "https://www.petguide.com/breeds/turtle/stripe-necked-musk-turtle/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/11/stripe-necked-musk-turtle.jpg", "name": "Stripe-Necked Musk Turtle", "type": "turtle", "text": "There are five different species of Musk Turtles, and they are the Stripe-Necked Musk Turtle, Razorback Musk Turtle, Loggerhead Musk Turtle, Flattened Musk Turtle, and Common Musk Turtle. There are actually two subspecies of Loggerhead Musk Turtle, and one of them is the Stripe-Necked Musk Turtle. This breed is rare in the pet trade. However, like all turtles, the Stripe-Necked Musk Turtle should be purchased from a reputable breeder who can guarantee that the animal was born and raised in captivity. Not only will these animals be healthier and more comfortable around people, but you will also be doing your part to keep wild turtles in their natural habitats where they belong. Beware that Musk Turtles will release a foul smelling liquid when they are highly stressed or frightened. Therefore, care needs to be taken whenever you handle a Stripe-Necked Musk Turtle. Stripe-Necked Musk Turtles will release a foul smelling liquid when they are highly stressed or frightened. The Stripe-Necked Musk Turtle can be found in a range that stretches from eastern Tennessee and southwest Virginia all the way to the Pearl River of Mississippi and the Gulf of Mexico. They prefer living in fast flowing streams and rivers that have cobble and rock bottoms within the Cumberland Plateau region. Sometimes they will be found living in shallow, clear creeks along the edges of mountains. The Stripe-Necked Musk Turtle is similar in appearance to other Musk Turtles, especially since its carapace is keeled and features overlapping vertebral scutes. There are barbels on the chin, and males will have a bigger head and a longer tail than females. There will be a central keel that is well-defined, along with two keels on the side of the carapace, and these will be more apparent in juveniles than in adults. Also, the plastron of these turtles will be small, so it will not totally protect the animal. There is also be one gular scute and one anterior hinge. Stripe-Necked Musk Turtles will be anywhere from olive brown to brown in carapace color. Stripe-Necked Musk Turtles will be anywhere from olive brown to brown in carapace color. The carapace may also feature small black spots. The head of these turtles will showcase black spots on the top, and the throat will have distinctive brown, black, and yellow alternating stripes. These active aquatic turtles will need a large tank of at least 30 gallons with plenty of water for swimming. Water depth can be maintained at 12” so that your turtle will have loads of space to move around freely. These turtles will spend the majority of their time underwater, so they will not bask often. Nevertheless, you do need to provide your pet with a suitable basking spot. This can be a rock that projects from the water. This basking area should have a UV light above it, along with a heat lamp that will ensure it reaches anywhere from the mid 80s to low 90s Fahrenheit. Use a high quality filtration system to keep the water as clean as possible at all times, especially since these turtles are messy eaters. You can keep the bottom of the tank bare or you can use river pebble as the substrate. A water heater will ensure that the temperature remains consistent at all times, preferably anywhere from the mid to high 70s Fahrenheit. You should also use a heat lamp above the tank to maintain the air temperature at 75-83°F. Stripe-Necked Musk Turtles should only be handled when it is necessary to do so. Stripe-Necked Musk Turtles will be primarily carnivorous, so even though they will consume some plants, their diet will mostly consist of crayfish, snails, mollusks, and aquatic insects. You can mimic their wild diet in captivity, but it is also a good idea to provide your pet with a commercial pelleted diet for turtles, as that will ensure that all of his nutrient requirements will be met. Other foods that you can give your turtle include feeder fish and worms. Stripe-Necked Musk Turtles should only be handled when it is necessary to do so. This will prevent your pet from releasing its foul smelling liquid when stressed, and it will also protect your from painful bites. The more your turtle grows accustomed to you and his enclosure, however, the more comfortable and at ease he will become. If you would like to set up a community tank, make sure the enclosure is large enough to accommodate all of the turtles comfortably. Stripe-Necked Musk Turtles will do well with other Musk Turtles, as well as Sliders, Cooters, and Painted Turtles. Just watch out for aggressive behavior between rival males, and make sure females are not harassed by males, especially when you are housing multiple Musk Turtles together.", "facts": " 3-5” Aquatic Commercial pelleted diet for turtles, worms, crayfish, feeder fish, mollusks, snails, non-toxic aquatic plants, aquatic insects Low Maintenance", "tags": "Common Musk Turtle, Flattened Musk Turtle, Loggerhead Musk Turtle, musk turtle, Razor-Backed Musk Turtle, Stripe-Neck Musk Turtle, Stripe-Necked Musk Turtle, stripeneck musk turtle, Stripenecked Musk Turtle, turtle, turtle breed, "}, "three-toed box turtle": {"page_url": "https://www.petguide.com/breeds/turtle/three-toed-box-turtle/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/11/three-toed-box-turtle.jpg", "name": "Three-Toed Box Turtle", "type": "turtle", "text": "The Three-Toed Box Turtle is one of the subspecies of the Common Box Turtle, and it is named “three-toed” because its back feet feature three toes. These turtles are quiet, shy, and gentle. They can make ideal pets for those who wish to add a turtle to their family, but they are solitary animals. Also, they should be protected from other pets, such as dogs, and they will be sensitive to their environment until they get comfortable. The Three-Toed Box Turtle is a subspecies of the Common Box Turtle, and it is named “three-toed” because its back feet feature three toes. Three-Toed Box Turtles can be found in their natural habitat in a few states that are located to the west of the Mississippi River. These include Arkansas, Louisiana, and Missouri. You can also find these turtles in southeastern Kansas, eastern Texas, and eastern Oklahoma, as well as in portions of Georgia, Alabama, and Mississippi. You can typically find these turtles inhabiting grassy meadows and woodlands, as they prefer humid areas, including grasslands and marshes. They also prefer living near shallow bodies of water there they can soak, hunt for insects, and drink. The Three-Toed Box Turtle can be recognized easily by the three toes on the hind limbs, although some turtles might have four toes. Males will feature a concave plastron, while females will have a flat plastron. Also, males will have a tail that is longer and thicker than that of females, and they also have bigger, hook-like claws on the back feet. However, females will be larger in size overall. Like other Box Turtles, the Three-Toed Box Turtle features a carapace that is highly domed and a plastron that is hinged. The turtle is able to close its shell completely in order to keep predators out. The Three-Toed Box Turtle is quiet, shy, and gentle. The carapace of a Three-Toed Box Turtle will not be as colorful as other Box Turtles. Instead, it will typically be a solid hue of olive, yellow, or brown. Occasionally, you might find some light striations or spotting. The plastron will be yellow. The skin will typically also be plainly colored, though there will occasionally be light spotting on the legs and/or face. Males, in particular, will have faces that are more brightly colored with orange, red, or a combination of black, white, and red. Males will have eyes that are red, while females will have green eyes. To house your Three-Toed Box Turtle indoors or outdoors, you will need to set up a large tub or terrarium. If you go with a tub, it should be at least 48” wide, 84” long, and 24” deep. If you go with a terrarium, it should be at least 55-75 gallons. The walls should not be see-through or your turtle will always try to move beyond them. For substrate, mix peat moss and dampened sand in equal parts after adding roughly 10” of pea gravel at the bottom of the enclosure. Then, add a top layer of cypress mulch over 75% of the substrate. Add shade-loving plants, sheets of bark, and slabs of slate resting on bricks in order to provide cover for these shy turtles. Also spray the enclosure heavily once a week using warm water during the summer and spring, but spray lightly twice a month when the weather is cooler during the winter and fall. Add a large, shallow bowl of clean water so that your turtle will be able to sit in it and drink from it. You should set up a UVB light bulb overhead, and it should be kept on for 12 hours each day. Also, a heat lamp should bring the temperature in the basking area to 85°F, while the rest of the enclosure should be around 80°F in the warm area and 10° cooler on the opposite cooler end. Even though the Three-Toed Box Turtle is gentle and does not bite, it should only be handled when it is necessary. Three-Toed Box Turtles can eat a variety of animals and plants. You can start with a commercial diet for turtles, and then provide your pet with crickets, earthworms, mealworms, and dark leafy greens like arugula, kale, and red leaf lettuce. You can also feed your turtle fruits like grapes, apples, cantaloupe, cherries, bananas, mulberries, and strawberries, as well as vegetables that include zucchini, peas, sweet potatoes, and winter squash. Variety is the key, so don’t use one or two foods exclusively. You can also provide your pet with a vitamin/mineral supplement designed for turtles a few times each week. Always feed your turtle on a flat, hard surface, and include a cuttlebone in the enclosure at all times for calcium. Remove all of the uneaten food right away. Even though these small turtles are gentle and do not bite, they should only be handled when it is really necessary to do so, as they will not like being held. It does take some time for them to become accustomed to their captive enclosure, but once they do, they are fun to watch as they explore. Because these turtles are solitary and do not require companions, it is best to house them individually. As with all other pet turtle breeds, get your Three-Toed Box Turtle from a reputable breeder or seller who can prove that the animal has been bred in captivity and has not been taken from the wild.", "facts": " 4-6” Terrestrial Commercial turtle diet, insects, worms, fruits, vegetables, dark leafy greens High Maintenance", "tags": "box turtle, common box turtle, eastern box turtle, Florida Box Turtle, Gulf Coast Box Turtle, Mexican Box Turtle, Three-Toed Box Turtle, turtle, turtle breed, Yucatan Box Turtle, "}, "western painted turtle": {"page_url": "https://www.petguide.com/breeds/turtle/western-painted-turtle/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/10/western-painted-turtle.jpg", "name": "Western Painted Turtle", "type": "turtle", "text": "One of the most popular pet turtle breeds, and one that is appropriate for beginner turtle keepers, the Western Painted Turtle is the largest of the four Painted Turtle species. There are many captive-bred Western Painted Turtles, and these attractive, colorful turtles are a joy to watch as they swim and bask. The Western Painted Turtle is appropriate for beginner turtle keepers. Painted Turtles can be found all over the United States, from east to west. They can also be found all the way down to northern Mexico and up to the southern part of Canada. Western Painted Turtles, in particular, can be found in New Mexico, Oklahoma, Colorado, Idaho, Wyoming, Michigan, North Dakota, South Dakota, Washington, Oregon, Arizona, Indiana, Kansas, Missouri, and Wisconsin, as well as British Columbia, across southern Canada, and western Ontario. You will find these turtles near rivers, lakes, and streams, as well as wetland habitats that are located near bodies of water. When compared to Sliders, the Western Painted Turtle is similar in both form and size. You will notice that the carapace has no keel, and it is oval, flattened, and smooth. Also, the posterior rim isn’t serrated, and the vertebral scutes of the Western Painted Turtle are broad. The Western Painted Turtle also features a plastron that isn’t hinged, and the head will be moderate in size with a snout that projects slightly. You will even note that the upper jaw features a terminal notch that has a cusp on either side. These attractive, colorful turtles are a joy to watch as they swim and bask. The Western Painted Turtle features a carapace that is olive or green to black in color, and it can be mildly or moderately patterned. Along its seams, there are red or yellow borders, and there are red crescents or bars on the turtle’s marginal scutes. There will also be a medial stripe that could be red or yellow, though this is not always apparent. The plastron features a beautiful pattern of color. The skin will be black to olive in color, and there will also be yellow and red stripes found along the tail, legs, and neck. The yellow stripes on the head include a yellow line that extends from underneath the turtle’s eye and may connect with a stripe from the lower jaw. You will also see a big yellow streak behind each eye, and the chin has a couple of wide yellow lines that will come together at the tip of the turtle’s jaw. Western Painted Turtles can be housed indoors or outside in a garden pond that is safe and enclosed. Like other Painted Turtles, the Western Painted Turtle likes to spend a lot of time basking, so you need to set up a good basking spot for your pet. This should include a non-abrasive platform on which your turtle can completely dry off, along with a heat lamp that will ensure the basking area remains anywhere from 85-90°F. These turtles will also require a UVB lamp over their enclosure. The rest of the air temperature in the enclosure should be anywhere from the low to mid 80s Fahrenheit. The water should be filtered and pure at all times, and a water heater will ensure that the water temperature remains anywhere from the low to mid 70s Fahrenheit. Keep in mind that these turtles are avid swimmers, so they should be able to dive down into the water and swim around easily. Tank substrates are optional for these turtles, so you can keep the bottom of the tank bare or you can opt to get river rock, gravel, or sand. Just make sure that the substrate is either small enough to easily pass through your turtle’s digestive tract if it is swallowed, or too big to swallow in the first place. Provide your turtle with underwater hiding places, but make sure that they are safe, as you don’t want your pet to get stuck and drown. A single adult male Western Painted Turtle can be housed in a 75-gallon tank, as a minimum, while females would need at least a 125-gallon enclosure. The enclosure would need to be even bigger if you are going to house multiple turtles in the same tank. Western Painted Turtles do well when they are not handled often. Western Painted Turtles can be fed a commercial turtle diet, along with fish, shrimp, and non-toxic aquatic plants like water hyacinth, water lettuce, pondweed, water lilies, duckweed, water fern, hornwort, and frogbit, as a few examples. You can also provide your pet with vegetables, such as collard greens, endive, red leaf lettuce, escarole, dandelions, mustard greens, kale, romaine, beet leaves, squash, and zucchini. These turtles will also enjoy crickets, fruit, and worms, such as bloodworms and mealworms. Western Painted Turtles do well when they are not handled often, so only pick up and hold your turtle whenever it is necessary to do so. They can become stressed if they are handled too much, and they can bite or scratch if they are frightened or provoked. These turtles do well in community tanks with other Painted Turtles, as well as similar species of comparable size. Make sure you give them plenty of space and hiding places, and watch out for aggressive behaviors.", "facts": " 4-10” Semi-aquatic Commercial turtle diet, vegetables, fruits, insects, fish, shrimp, aquatic plants, worms   Low Maintenance", "tags": "eastern painted turtle, Midland Painted Turtle, painted turtle, painted turtle breed, Southern Painted Turtle, turtle, turtle breed, Western Painted Turtle, "}, "yellow-bellied slider": {"page_url": "https://www.petguide.com/breeds/turtle/yellow-bellied-slider/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/10/yellow-bellied-slider.jpg", "name": "Yellow-Bellied Slider", "type": "turtle", "text": "The world of pet turtles is a diverse one: there are many breeds of turtles and each has its own characteristics that could potentially make it a better choice of pet for your family’s needs. The Yellow-Bellied Slider is an attractive turtle that will need a lot of space as it grows- in the first three years of its life, it can be housed in a smaller tank around 40 gallons, but it will eventually require an aquarium that’s at least 75 gallons. Not unlike most land and water turtles, Yellow-Bellied Slider will not like being handled and petted, so if you are looking for a cuddly and overly affectionate pet, a turtle might not be the best choice for you.  The Yellow-Bellied Slider belongs to the group of diurnal turtles, or in other words- turtles that are active during the day. They love munching on chopped veggies or insects in the morning, and will spend the day basking in the sun- in the wild, it would be on a floating log or on the shore. In captivity, your pet turtle will depend on you to provide a suitable environment for it to thrive.  Even though they are not as well known or as popular as the similar Red-Eared Slider, these animals are a good choice for those who wish to add a turtle to their family. The Yellow-Bellied Slider is an attractive turtle that makes a great pet.  You can find the Yellow-Bellied Slider throughout the southeastern portion of the United States, from Virginia to Alabama. They are a subspecies of pond sliders, semi aquatic turtles that are most popular as pets. These turtles can be found in a variety of freshwater habitats that include marshes, lakes, permanent ponds, floodplain swamps, slow-moving rivers, and seasonal wetlands. They prefer bodies of water that are shallow and that provide plenty of aquatic vegetation, basking areas, and soft bottoms. At first glance, especially if you are new to the world of pet turtles, it can be difficult to easily distinguish between similar subspecies. But, in the case of Yellow-Bellied slider it’s distinguishing mark is in its name- the underside of the species is yellow and often features markings similar to the shape of a question mark. It also has yellow S-shaped stripes on its neck.  As for the rest of their body, Yellow-Bellied Sliders feature an oval carapace and a rounded jaw. Females are usually larger than males. Females reach 8 to 13 inches in length and males remain between 5 and 9 inches in size.  Also, males will have a thick, long tail and will showcase darker colors than females as they grow and mature. The Yellow-Bellied Slider has distinct markings that make it stand out. You will quickly notice this turtle’s pretty yellow stripes, which are found on the legs, neck, and head. There is also a bright orange, red, or yellow spot on the sides of the turtle’s head. The carapace ranges in color from brown to olive, and it also features yellow bars or stripes. However, these yellow or golden markings are more common for young specimens, and as they age, Yellow-Bellied Sliders have more of a muted brownish carapace. Also, the plastron, which is yellow, can feature dark blotches on the bony plates. Yellow-Bellied Sliders do well in community tanks, as long as they are housed with similar turtle breeds. You will need to provide your Yellow-Bellied Slider with a large aquarium of at least 60 gallons for a single turtle. Hatchlings should not be housed in an aquarium that is smaller than 15 gallons. If you plan on housing more than one turtle in the same enclosure, you should add an extra 20 gallons for each turtle, as a minimum. Always use a high quality water filtration system to ensure the freshwater is kept pure at all times. Maintain the water temperature anywhere from 75-80°F with the help of a submersible water heater. And make sure the water is deep enough that your turtle can totally submerge himself and swim around comfortably. A good recommendation for water depth is around 18”. Yellow-Bellied Slider Turtles enjoy basking, so you will need to provide your pet with a basking area that is large and comfortable. The material should be non-abrasive and your turtle should be able to dry off completely. Use a heat lamp to keep the basking area’s temperature anywhere from the high 80s to low 90s Fahrenheit. The rest of the air temperature in the tank should be kept anywhere from the low to mid 80s Fahrenheit. Also set up a UVB light bulb over your turtle’s enclosure. In terms of substrate, you can decide whether or not you would like to include it in your turtle’s tank. Using a substrate could make your turtle’s tank harder to clean, and you will need a highly efficient water filtration system as well to help you keep the substrate clean. If you are going to use a substrate, choose gravel that is larger than what your turtle would be able to swallow. In addition to filtration, you will need to perform complete water changes on a regular basis in order to maintain the water quality. Yellow-Bellied Sliders are highly sociable animals. Because the Yellow-Bellied Slider is a turtle that follows an omnivorous diet, you will be able to feed your pet a variety of foods. These include insects, fish, certain types of worms, vegetables and non-toxic aquatic plants. Good options for Yellow-Bellied Slider are small feeder fish, crickets, wax worms, mealworms, chopped vegetables, and commercial turtle food. Not only will these types of food be particularly yummy to your new pet, but they will also provide all essential nutrients your turtle needs to thrive and stay healthy.  Yellow-Bellied Sliders do well in community tanks, as long as they are housed with similar turtle breeds, such as Red-Eared Sliders, Painted Turtles, Cooters, and Map Turtles. Just be sure that you can give your turtles a large enclosure in order to give each animal enough space and hiding places, and always keep an eye out for aggressive behaviors between your turtles. Of course, when it comes to tanks that include fish, the general recommendation is not to mix the two. A Yellow-Bellied Slider feeds on some types of fish and probably wouldn’t hesitate making a snack out of your other aquatic pets, so be sure not to house them together. Overall, Yellow-Bellied Sliders are highly sociable animals, and even those turtles that are shy at the beginning will become more comfortable in a short period of time. It is always best to purchase turtles that have been bred in captivity, as they will be more comfortable around humans and you can rest assured that they were not taken out of their wild habitats. Still, it’s important to reiterate that even captive-bred turtles will not be as friendly as other types of pets, but there are plenty of other merits to pet reptiles and your Yellow-Bellied Slider will quickly show them to you. Giving your turtle a high quality enclosure and keeping the handling of your Yellow-Bellied Slider to a minimum will help keep your pet happy and healthy.", "facts": " 5-13” Semi-aquatic Commercial turtle diet, non-toxic aquatic plants, worms, fish, insects, vegetables Moderate Maintenance", "tags": "Cumberland Slider, Red-Eared Slider, slider, Slider Turtle, turtle, turtle breed, Yellow-Bellied Slider, Yellow-Bellied Slider Turtle, "}, "yellow-footed tortoise": {"page_url": "https://www.petguide.com/breeds/turtle/yellow-footed-tortoise/", "image_url": "https://www.petguide.com/wp-content/uploads/2016/11/yellow-footed-tortoise.jpg", "name": "Yellow-Footed Tortoise", "type": "turtle", "text": "Like the Red-Footed Tortoise, the Yellow-Footed Tortoise is one of the most popular and beloved tortoise breeds in the pet trade. These animals can be personable, and they are attractive and hardy, so they are a good choice even for beginners. If you do decide that you would like to bring a Yellow-Footed Tortoise into your family, just be sure to purchase one from a reputable breeder who can guarantee that the animal was born in captivity, as that will help ensure its already threatened wild populations will be able to thrive. The Yellow-Footed Tortoise is one of the most popular and beloved tortoise breeds in the pet trade. You can find the Yellow-Footed Tortoise throughout rainforests that are located in South America, from Venezuela, French Guiana, Guyana, Brazil, and the Amazon basin, to Ecuador, Colombia, Bolivia, and Peru. These animals prefer tropical lowlands and dense rainforest. Yellow-Footed Tortoises have a flatter and wider shape overall compared to the Red-Footed Tortoise. They also do not have the unique hourglass shaped carapace. Males will typically have a flatter carapace when compared to females, and they will also have tails that are wider and longer, along with an obviously concave plastron. The Yellow-Footed Tortoise will have a shell that is colored light golden brown. The Yellow-Footed Tortoise is similar to the Red-Footed Tortoise, but it also has some distinctive features. On the front legs, in particular, there will be yellow scales on the Yellow-Footed Tortoise, while the Red-Footed Tortoise will have red scales. Also, the Yellow-Footed Tortoise will have a shell that is colored light golden brown. The limbs and the head will be darker than the shell. On top of that, the Yellow-Footed Tortoise will usually feature a yellow mark located behind the eyes. There may even be a few yellow scales found on the legs and head. And every scute of the shell will be black along the edges but will be yellow in the center. When housing a Yellow-Footed Tortoise indoors, you can use an enclosure that is about 8’x4’ for an adult. Provide your pet with a dish that is filled with fresh, clean water at all times. This dish should be shallow so that your tortoise will not drown, but it should be big enough that he can soak in it. When it comes to substrate, mix peat moss and sand and then add a top layer of cypress mulch in order to trap moisture. There should be a heat lamp in one area of your Yellow-Footed Tortoise’s enclosure so that he can bask, and the temperature should be around 90°F in this basking area. Also include a UV light and a cooler area complete with a damp hiding place that is located away from the basking area. These animals are shy, so it is a good idea to provide a variety of hiding places for security and comfort. They can use everything from piles of grass clippings or hay, to big banana leaves and pieces of cork bark as shelter. If you are planning on housing your Yellow-Footed Tortoise outside when the weather is warm, just make sure that the enclosure is properly secured so that he will not be able to escape and so he will be protected from predators. These enclosures should be around 9 square feet in size. They should also have plenty of plants, such as ferns and low bushes, to block out the sunlight and provide your pet with a place to retreat to when he doesn’t want to be in the sun. The Yellow-Footed Tortoise is shy, so these animals will not like being handled. The Yellow-Footed Tortoise is mostly herbivorous, so your pet’s diet should primarily consist of fruits and leafy greens like endive, clover, and dandelion, as a few examples. You can feed your pet a mix of greens, vegetables, and fruits, as well as flowers, each day or every other day. Good options include collard greens, mustard greens, watercress, escarole, kale, romaine, squash, carrots, pumpkin, zucchini, mango, melon, kiwi, papaya, cantaloupe, and hibiscus. Avoid giving this tortoise animal protein often. Instead, every three weeks or so, you can provide him with a commercial diet designed for tortoises. The Yellow-Footed Tortoise is shy, so these animals will not like being handled. Often, they will end up retreating into their shells. However, some animals might be tame and outgoing, particularly if they were born and raised in captivity (another reason to search out the best breeders who can guarantee your tortoise was not taken out of the wild).", "facts": " 16-30” Terrestrial Leafy greens, vegetables, fruits, commercial pelleted tortoise food Low Maintenance", "tags": "Red Footed Tortoise, south american tortoise, tortoise, tortoise breed, turtle, turtle breed, Yellow Footed Tortoise, "}}